{
  "id": "huberman-immune-system",
  "titleCn": "Huberman 播客：大脑如何控制免疫系统",
  "titleEn": "Using Your Nervous System to Enhance Your Immune System",
  "originalUrl": "https://www.hubermanlab.com/episode/using-your-nervous-system-to-enhance-your-immune-system",
  "date": "2025-11-10",
  "duration": 4929,
  "tags": [
    "神经科学",
    "免疫系统",
    "健康"
  ],
  "cover": "/images/huberman-immune.jpg",
  "audioUrl": "https://pub-a31ba1df1a8546fe86dc40cba53d796e.r2.dev/huberman-immune.mp3",
  "chapters": [
    {
      "title": "大脑与免疫的联系",
      "start": 48
    },
    {
      "title": "免疫系统的三道防线",
      "start": 329
    },
    {
      "title": "先天与适应性免疫",
      "start": 545
    },
    {
      "title": "鼻腔微生物与呼吸方式",
      "start": 1102
    },
    {
      "title": "免疫系统与疾病行为",
      "start": 1357
    },
    {
      "title": "食欲与抑郁症的关联",
      "start": 1628
    },
    {
      "title": "发烧的生物学意义",
      "start": 1881
    },
    {
      "title": "快速与慢速免疫反应",
      "start": 2090
    },
    {
      "title": "呼吸法与免疫增强",
      "start": 2893
    },
    {
      "title": "心理影响生理的证据",
      "start": 3412
    },
    {
      "title": "螺旋藻的替代疗法",
      "start": 4253
    },
    {
      "title": "针灸与迷走神经研究",
      "start": 4558
    }
  ],
  "captions": [
    {
      "start": 0.0,
      "end": 43.760000000000005,
      "zh": "欢迎来到EchoMind回声思维。\n\n您现在收听的这期播客，是对原英文博客基于 AI 技术生成的中文版本。我们不仅搬运优质内容，还保留原汁原味的嘉宾音色。\n\n我是Lorraine，在互联网大厂从事数据科学，同时也是一名 AI 深度爱好者。本期内容来自斯坦福大学 Andrew Huberman 教授的播客。Huberman 教授将带你探讨：我们的大脑如何控制免疫系统。从哈佛医学院关于针灸的最新研究，到睡眠中大脑的自我清洁机制，再到如何通过呼吸和心态来增强免疫力——这些都不是玄学。如果你对神经科学、免疫系统，或者如何用科学方法优化健康感兴趣，这期节目一定不会让你失望。\n\n好，让我们开始吧。",
      "en": "[Introduction by Lorraine]",
      "speaker": -1
    },
    {
      "start": 46.400000000000006,
      "end": 53.0,
      "zh": "欢迎来到Huberman Lab播客，我们聊聊科学和日常生活中的科学工具。",
      "en": "Welcome to the Huberman Lab Podcast, where we discuss science and science-based tools for everyday life.",
      "speaker": 0
    },
    {
      "start": 53.36,
      "end": 57.84,
      "zh": "我是Andrew Huberman，斯坦福医学院的神经生物学和眼科教授。",
      "en": "I'm Andrew Huberman, and I'm a professor of neurobiology and ophthalmology at Stanford School of Medicine.",
      "speaker": 0
    },
    {
      "start": 57.84,
      "end": 65.26,
      "zh": "今天我们聊聊免疫系统，还有神经系统，就是大脑、脊髓，以及它们和身体各器官的联系。",
      "en": "Today, we are discussing the immune system, and we are also discussing the nervous system, which is the brain spinal cord and the connections of the brain and spinal cord with all the organs of the body.",
      "speaker": 0
    },
    {
      "start": 65.26,
      "end": 69.0,
      "zh": "我们还会聊聊怎么用神经系统激活和控制免疫系统。",
      "en": "We are also going to discuss how the nervous system can be used to activate and control the immune system.",
      "speaker": 0
    },
    {
      "start": 69.56,
      "end": 85.5,
      "zh": "\"大概十几二十年前，要是有人说大脑能控制免疫系统，可能会被学术会议嘲笑，论文也发不出来。但现在，有几十甚至上百篇高质量的同行评审研究，探讨大脑和神经系统如何激活免疫系统。\"",
      "en": "Now, about 10, 20 years ago, if somebody said that the mind could control the immune system, they'd probably get laughed out of most academic conferences and certainly the work wouldn't be published in quality journals, but nowadays, there are dozens, if not hundreds, of quality peer-reviewed studies on how the mind and how the nervous system can control activation of the immune system.",
      "speaker": 0
    },
    {
      "start": 85.5,
      "end": 96.28,
      "zh": "这是个很棒的研究领域。而且我给你透露一下我们要聊的内容，就在上周，《Nature》这本顶级科学期刊，发表了一篇相关论文，非常严格的审稿标准。",
      "en": "This is a wonderful growing body of research, and just to give you a hint of where we are headed with this, just this last week, there was a paper published in Nature, which is the apex journal for scientific publishing, premier journal, extremely stringent.",
      "speaker": 0
    },
    {
      "start": 96.28,
      "end": 120.34,
      "zh": "\"哈佛医学院Chufu Ma的实验室在《Nature》上发表了一篇论文，研究针灸如何减少身体的炎症。等会我会详细讲讲这项研究。他们发现，通过特定方式刺激身体特定部位，可以释放出一些细胞和分子，增强免疫系统功能，可能用来对抗不同类型的感染。\"",
      "en": "A paper published in Nature from Chufu Ma's lab at Harvard Medical School explored how acupuncture can reduce inflammation in the body and I will describe this study in a bit more detail later, but what they discovered was that by stimulating the body in particular ways at particular sites on the body, they were able to liberate certain cells and molecules that enhance the function of the immune system and potentially can be used to combat different types of infection.",
      "speaker": 0
    },
    {
      "start": 120.34,
      "end": 126.04,
      "zh": "还有个小提示，他们发现一种叫筋膜的组织，有些人可能听说过。",
      "en": "And just to give you another little hint, they found that a particular type of organ tissue called fascia, some of you may have heard of fascia.",
      "speaker": 0
    },
    {
      "start": 126.04,
      "end": 128.6,
      "zh": "\"筋膜包裹着我们的肌肉。\"",
      "en": "Fascia surrounds our muscles.",
      "speaker": 0
    },
    {
      "start": 128.6,
      "end": 132.44,
      "zh": "\"乍一看，你可能觉得这是一种没用的组织。\"",
      "en": "Just to look at it, you might think it's a kind of useless tissue.",
      "speaker": 0
    },
    {
      "start": 132.44,
      "end": 135.5,
      "zh": "\"它有点像一个包裹肌肉的密实袋子。\"",
      "en": "It's sort of like a dense bag in which the muscles are contained.",
      "speaker": 0
    },
    {
      "start": 135.5,
      "end": 138.58,
      "zh": "其实这些密实袋子比我们想的聪明多了。",
      "en": "Well, it turns out that those dense bags are much smarter than we thought.",
      "speaker": 0
    },
    {
      "start": 138.58,
      "end": 147.8,
      "zh": "它们自己没法思考，但通过刺激身体上特定位置的筋膜，有一条路径直接通向一个叫肾上腺髓质的器官。",
      "en": "They don't have a mind of their own, but by stimulating the fascia in a particular location on the body, there's a pathway leading out of that fascia directly to an organ called the adrenal medulla.",
      "speaker": 0
    },
    {
      "start": 147.84,
      "end": 150.14000000000001,
      "zh": "我来解释一下这是什么意思。",
      "en": "I'll explain what all this means.",
      "speaker": 0
    },
    {
      "start": 150.14000000000001,
      "end": 153.98000000000002,
      "zh": "\"这样可以释放出一些化学物质，能有效抗炎。\"",
      "en": "That could liberate particular chemicals that had a potent anti-inflammatory effect.",
      "speaker": 0
    },
    {
      "start": 153.98000000000002,
      "end": 164.74,
      "zh": "所以我们基本上是在说，神经系统就像身体各组织间的高速公路，调动免疫系统，释放出一些能减轻炎症、加速愈合的分子。",
      "en": "So what we're basically saying is that the nervous system acts as a set of highways between the different tissues of your body, calling into action the immune system, liberating particular molecules that can reduce inflammation and lead to faster healing.",
      "speaker": 0
    },
    {
      "start": 164.74,
      "end": 171.64000000000001,
      "zh": "\"我会解释这些是怎么运作的，还有一些不用针灸就能激活和增强免疫系统的方法。\"",
      "en": "And I will explain how all of that works as well as some other non-acupuncture methods for activating and enhancing the function of the immune system.",
      "speaker": 0
    },
    {
      "start": 171.64000000000001,
      "end": 177.8,
      "zh": "\"所以今天我们要聊聊如何用大脑治愈，完全没有神秘和抽象的成分。\"",
      "en": "So today we're going to be talking all about healing with the mind in a completely non-mystical, non-abstract sense.",
      "speaker": 0
    },
    {
      "start": 180.66,
      "end": 187.06,
      "zh": "在开始之前，我想强调一下，这个播客跟我在斯坦福的教学和研究工作没关系。",
      "en": "Before we begin, I'd like to emphasize that this podcast is separate from my teaching and research roles at Stanford.",
      "speaker": 0
    },
    {
      "start": 187.06,
      "end": 192.68,
      "zh": "其实这也是我想努力做到的，就是免费给大家科普科学和相关工具。",
      "en": "It is however, part of my desire and effort to bring zero cost to consumer information about science and science-related tools to the general public.",
      "speaker": 0
    },
    {
      "start": 192.68,
      "end": 200.36,
      "zh": "好，咱们聊聊免疫系统和神经系统，它们怎么互相作用，以及如何调节免疫系统让它更好地为你服务。",
      "en": "Okay, let's talk about the immune system and the nervous system and how the two interact and how you can control your immune system to serve you better.",
      "speaker": 0
    },
    {
      "start": 200.36,
      "end": 204.46,
      "zh": "我们会聊很多机制上的科学，还有一些细节。",
      "en": "We are going to talk a lot of mechanistic science, a little bit of detail.",
      "speaker": 0
    },
    {
      "start": 204.46,
      "end": 212.92,
      "zh": "你会学到一些关于免疫系统的新词汇，比如不同细胞类型的名字等等，但我保证不管你背景如何，我都会讲得很清楚。",
      "en": "You learned some new language around the immune system, names of the different cell types and so forth, but I promise to make it all very clear regardless of your background.",
      "speaker": 0
    },
    {
      "start": 212.92,
      "end": 214.95999999999998,
      "zh": "我们也会聊到很多实用工具。",
      "en": "We are also going to discuss a lot of tools.",
      "speaker": 0
    },
    {
      "start": 214.95999999999998,
      "end": 219.06,
      "zh": "我想很多人来这儿是想知道怎么增强免疫系统功能。",
      "en": "And I think many of you are probably here because you want to know what you can do in order to boost or enhance the function of your immune system.",
      "speaker": 0
    },
    {
      "start": 219.06,
      "end": 220.85999999999999,
      "zh": "这是个很合理的问题。",
      "en": "That's a very reasonable question to ask.",
      "speaker": 0
    },
    {
      "start": 220.85999999999999,
      "end": 225.98,
      "zh": "\"我想先说，如果你在网上搜这个问题，会得到很多答案。\"",
      "en": "I want to begin by just acknowledging that if one were to put that question into the internet, you would get back a lot of answers.",
      "speaker": 0
    },
    {
      "start": 225.98,
      "end": 230.06,
      "zh": "\"现在有一种通用的答案值得尊重，但我们今天不聊这个。\"",
      "en": "And there is now a sort of generic form of that answer that deserves our respect, but is not going to be the topic of conversation today.",
      "speaker": 0
    },
    {
      "start": 230.06,
      "end": 235.7,
      "zh": "我还是想提一下，列举几个我们知道能让身体更健康的方法。",
      "en": "I just want to tip my hat to it, however, and list off a few of the things that we know set us up to be healthier than we would be if we didn't do these things.",
      "speaker": 0
    },
    {
      "start": 235.7,
      "end": 243.9,
      "zh": "所以首先，当然是所有身心健康的基础，就是要有充足的睡眠，也就是要睡够你需要的深度睡眠。",
      "en": "So the first of course, is the foundation of all mental and physical health, which is to get adequate sleep, meaning enough sleep, whatever it is for you that you require to get deep sleep.",
      "speaker": 0
    },
    {
      "start": 243.9,
      "end": 252.08,
      "zh": "所以，睡眠质量要高，而且时间要对，不能今天白天睡，明天晚上睡，这样身体会受不了。",
      "en": "So it's got to be of high quality and to time that sleep correctly, meaning you can't sleep during the day one day and at night the next day and expect your system to function well.",
      "speaker": 0
    },
    {
      "start": 250.3,
      "end": 264.38,
      "zh": "之前我们在节目里也聊过这个，大部分时间要有相对固定的作息，最好能达到80%甚至90%。但生活中，咱们不可能总是按时睡觉起床，对吧？",
      "en": "Talked a lot about that before on this podcast, you need a relatively consistent sleep schedule most of the time, about 80% of the time, or even better would be 90% of the time, but the realities of life make it that we can't always go to bed at the same time and wake up at the exact same time, okay?",
      "speaker": 0
    },
    {
      "start": 265.14,
      "end": 266.94,
      "zh": "所以我们得好好睡觉。",
      "en": "So we need sleep.",
      "speaker": 0
    },
    {
      "start": 266.94,
      "end": 268.74,
      "zh": "阳光也是必须的。",
      "en": "We do need sunshine.",
      "speaker": 0
    },
    {
      "start": 268.74,
      "end": 270.52,
      "zh": "\"为什么我们需要阳光呢？\"",
      "en": "Why do we need sunshine?",
      "speaker": 0
    },
    {
      "start": 270.52,
      "end": 276.16,
      "zh": "因为阳光能帮我们调节生物钟，让细胞里的基因在正确的时间表达。",
      "en": "Because it sets our rhythm into a regular state where the genes in all of our cells can be expressed at the correct times.",
      "speaker": 0
    },
    {
      "start": 276.16,
      "end": 283.84,
      "zh": "我们就像一个细胞工厂，只有知道什么时候该启动，什么时候该休息，这个工厂才能正常运转。",
      "en": "We're sort of a factory of cells, if you will, and that factory can only run properly if it knows when certain things should be active and when certain cells should not be active.",
      "speaker": 0
    },
    {
      "start": 283.84,
      "end": 289.46,
      "zh": "\"最好的方法就是早晚都晒晒太阳，晚上别让眼睛接触太多亮光。\"",
      "en": "And the best way to coordinate all of those activities of all the cells is to get sunshine in your eyes in the morning and again, in the evening, and not to get too much bright light in your eyes in the middle of the night.",
      "speaker": 0
    },
    {
      "start": 289.46,
      "end": 290.5,
      "zh": "这就是基础。",
      "en": "That's just foundational.",
      "speaker": 0
    },
    {
      "start": 289.46,
      "end": 296.38,
      "zh": "然后网上的各种清单都会告诉你，要睡好觉，多晒太阳，多锻炼。",
      "en": "And then any lists that you'll find on any number of websites on the internet would say, okay, get good sleep, get sun, get exercise.",
      "speaker": 0
    },
    {
      "start": 296.38,
      "end": 297.92,
      "zh": "运动量要多少？",
      "en": "How much exercise?",
      "speaker": 0
    },
    {
      "start": 297.92,
      "end": 302.52,
      "zh": "我们每周应该做150到180分钟的二级有氧运动。",
      "en": "We should all be getting 150 to 180 minutes of zone two cardio.",
      "speaker": 0
    },
    {
      "start": 302.52,
      "end": 309.7,
      "zh": "那就是那种一周做150到180分钟，运动时还能勉强聊天的有氧运动。",
      "en": "That's cardiovascular exercise where we can just barely hold a conversation or maybe not per week.",
      "speaker": 0
    },
    {
      "start": 309.7,
      "end": 311.21999999999997,
      "zh": "我们应该吃得健康。",
      "en": "We should be eating well.",
      "speaker": 0
    },
    {
      "start": 311.21999999999997,
      "end": 314.04,
      "zh": "总是有人告诉我们要吃得健康。",
      "en": "We're always told we have to get good nutrition.",
      "speaker": 0
    },
    {
      "start": 314.04,
      "end": 322.5,
      "zh": "\"对你来说，健康饮食的意义可能跟别人不一样，但我们都知道，饮食摄入和食物质量，特别是少吃加工食品，这很重要。\"",
      "en": "What good nutrition means to you is going to be different than what it means to somebody else, but we acknowledge that food intake and quality of food in particular, avoiding processed foods, that's going to be important.",
      "speaker": 0
    },
    {
      "start": 323.78,
      "end": 325.56,
      "zh": "\"社交很重要。\"",
      "en": "Social connection is important.",
      "speaker": 0
    },
    {
      "start": 325.56,
      "end": 327.36,
      "zh": "\"多喝水也很重要。\"",
      "en": "Hydration is important.",
      "speaker": 0
    },
    {
      "start": 327.36,
      "end": 329.14,
      "zh": "\"你开始明白了吧。\"",
      "en": "You're starting to get the picture.",
      "speaker": 0
    },
    {
      "start": 329.14,
      "end": 332.98,
      "zh": "\"这些都是有用的，对身心健康很基础。\"",
      "en": "We can take all that, acknowledge it as useful and foundational for mental and physical health.",
      "speaker": 0
    },
    {
      "start": 332.98,
      "end": 339.9,
      "zh": "\"但还是有很多人经常生病，或者伤口、感染好得慢，还有的要长期应对慢性病。\"",
      "en": "But of course there are many people who still struggle with getting ill too often or with not being able to heal from physical injuries and wounds or from various bacterial and viral infections quickly enough or deal with chronic disease.",
      "speaker": 0
    },
    {
      "start": 339.9,
      "end": 345.28,
      "zh": "所以今天我们就聊聊怎么用好这些信息，认同并践行。",
      "en": "And so today's really about how you can take all of that information, acknowledge it and follow it.",
      "speaker": 0
    },
    {
      "start": 343.22,
      "end": 352.18,
      "zh": "\"不过，你还可以通过一些方法来调动神经系统，从而大大增强免疫系统的功能。\"",
      "en": "But in addition to that, there are things that you can do to leverage your nervous system in order to enhance the function of your immune system in very robust ways.",
      "speaker": 0
    },
    {
      "start": 352.18,
      "end": 355.0,
      "zh": "所以我想把话题转到这上面来。",
      "en": "So that's where I'd like to shift the conversation to.",
      "speaker": 0
    },
    {
      "start": 355.0,
      "end": 359.4,
      "zh": "首先我们得聊聊免疫系统是什么，它是怎么运作的。",
      "en": "The first topic we have to attack is the question of what is the immune system and how does it work?",
      "speaker": 0
    },
    {
      "start": 357.6,
      "end": 369.38,
      "zh": "\"我想很多人都听说过抗体、杀伤细胞，还有参与免疫系统的身体器官，比如骨髓、脾脏、胸腺和淋巴结。\"",
      "en": "I think many of you have heard of antibodies or killer cells or the various organs of the body that are involved in the immune system, like the bone marrow, the spleen, the thymus and the lymph nodes.",
      "speaker": 0
    },
    {
      "start": 369.38,
      "end": 372.72,
      "zh": "我想简单介绍一下免疫系统基础知识。",
      "en": "I'd like to just take a moment and do a sort of brief immune system 101.",
      "speaker": 0
    },
    {
      "start": 372.72,
      "end": 380.4,
      "zh": "简单说一下免疫系统的基本组成，这样大家就能明白免疫系统怎么运作，有哪些基本部分。",
      "en": "Really simple, cover the basic elements of the immune system so that everyone listening or watching this can get a clear sense of how the immune system functions and what its basic parts are.",
      "speaker": 0
    },
    {
      "start": 380.4,
      "end": 383.46,
      "zh": "\"对有些人来说，这可能太基础了。\"",
      "en": "For some of you, this might be too basic.",
      "speaker": 0
    },
    {
      "start": 383.46,
      "end": 385.52,
      "zh": "可能有些背景知识你已经知道了。",
      "en": "It might be a little bit of background that you already know.",
      "speaker": 0
    },
    {
      "start": 385.52,
      "end": 389.88,
      "zh": "我觉得对大多数人来说，这些信息可能是新的。",
      "en": "I think for most of you, this information will be new.",
      "speaker": 0
    },
    {
      "start": 389.88,
      "end": 393.71999999999997,
      "zh": "\"我保证，你不用生物或医学背景也能理解。\"",
      "en": "And I promise you, you don't need a biology or medicine background in order to understand this.",
      "speaker": 0
    },
    {
      "start": 393.71999999999997,
      "end": 397.29999999999995,
      "zh": "\"其实很简单，因为它的设计真的很巧妙。\"",
      "en": "It's actually really simple because it is truly elegant in design.",
      "speaker": 0
    },
    {
      "start": 397.29999999999995,
      "end": 400.12,
      "zh": "你身体有三道主要防线来保护健康。",
      "en": "You have three main layers of defense for your health.",
      "speaker": 0
    },
    {
      "start": 400.12,
      "end": 405.74,
      "zh": "\"这三道防线一直在帮你抵御细菌、病毒和寄生虫的入侵和疾病。\"",
      "en": "These are the three things that are constantly at work to protect you from invasion and illness, from bacteria, from viruses and from parasites.",
      "speaker": 0
    },
    {
      "start": 405.74,
      "end": 409.84,
      "zh": "第一道防线就是我们常说的皮肤，它是个物理屏障。",
      "en": "And the first of those three is a physical barrier that we call your skin.",
      "speaker": 0
    },
    {
      "start": 409.84,
      "end": 414.2,
      "zh": "这听起来可能显而易见，但你所有东西都被皮肤包着。",
      "en": "And that might seem kind of obvious, but everything about you is contained in this compartment that is boundaried by your skin.",
      "speaker": 0
    },
    {
      "start": 415.48,
      "end": 418.04,
      "zh": "而且皮肤是免疫系统的重要部分。",
      "en": "And your skin is a very important aspect of your immune system.",
      "speaker": 0
    },
    {
      "start": 418.04,
      "end": 421.88,
      "zh": "\"如果你受过伤，其实就是免疫系统的防线被破了。\"",
      "en": "If you've ever had a cut, you essentially have a breach of the boundary that is your immune system.",
      "speaker": 0
    },
    {
      "start": 421.88,
      "end": 424.70000000000005,
      "zh": "\"你会发现会有很多变化发生。\"",
      "en": "And you would notice a number of things would happen.",
      "speaker": 0
    },
    {
      "start": 424.70000000000005,
      "end": 427.52000000000004,
      "zh": "\"你可能会发现伤口周围有点肿。\"",
      "en": "You might get some swelling around that cut.",
      "speaker": 0
    },
    {
      "start": 427.52000000000004,
      "end": 429.04,
      "zh": "\"可能会结痂。\"",
      "en": "You might get a scab.",
      "speaker": 0
    },
    {
      "start": 429.04,
      "end": 431.6,
      "zh": "\"过段时间可能会结痂。\"",
      "en": "Likely you would get a scab over time.",
      "speaker": 0
    },
    {
      "start": 431.6,
      "end": 434.68,
      "zh": "\"如果弄脏了，可能有细菌进去了。\"",
      "en": "If it got dirty, there were some bacteria that got in there.",
      "speaker": 0
    },
    {
      "start": 434.68,
      "end": 438.52000000000004,
      "zh": "\"你可能会看到有些白细胞聚集，就是脓。\"",
      "en": "You might see some accumulation of white blood cells, what's called pus.",
      "speaker": 0
    },
    {
      "start": 437.24,
      "end": 441.6,
      "zh": "我知道有点恶心，但就是这么回事。",
      "en": "I know it's kind of gross, but that's what that is.",
      "speaker": 0
    },
    {
      "start": 441.6,
      "end": 444.66,
      "zh": "可能会变黄，因为有死细胞聚集。",
      "en": "It might take on a yellow tint because of the accumulation of some dead cells there.",
      "speaker": 0
    },
    {
      "start": 444.66,
      "end": 450.04,
      "zh": "但其实皮肤就是主要的防护墙，把外面的有害东西挡在外面。",
      "en": "But basically your skin is the primary barrier through which you keep things from the outside that could harm you from getting to the inside.",
      "speaker": 0
    },
    {
      "start": 450.04,
      "end": 454.4,
      "zh": "\"现在，还是在第一类，你的身体和外表面是有开口的，对吧？\"",
      "en": "Now, still in category one, your body and your external surface, you have openings to that surface, right?",
      "speaker": 0
    },
    {
      "start": 454.4,
      "end": 459.78,
      "zh": "\"你不只是一个圆形或身体形状，完全被皮肤包裹住。\"",
      "en": "You're not just a round or a body shaped, completely covered up with skin.",
      "speaker": 0
    },
    {
      "start": 459.78,
      "end": 461.06,
      "zh": "你有开口。",
      "en": "You have openings.",
      "speaker": 0
    },
    {
      "start": 461.06,
      "end": 462.6,
      "zh": "那些开口是啥？",
      "en": "What are those openings?",
      "speaker": 0
    },
    {
      "start": 462.6,
      "end": 464.9,
      "zh": "那我们从头开始往下说。",
      "en": "Well, let's start at the top and work our way down.",
      "speaker": 0
    },
    {
      "start": 464.9,
      "end": 467.2,
      "zh": "\"眼睛是感染的主要入口。\"",
      "en": "A primary site of potential infection are your eyes.",
      "speaker": 0
    },
    {
      "start": 467.2,
      "end": 470.52,
      "zh": "你有耳朵，有鼻孔，还有嘴巴，对吧？",
      "en": "You have your ears, you have your nostrils, you have your mouth, okay?",
      "speaker": 0
    },
    {
      "start": 470.52,
      "end": 474.36,
      "zh": "\"这些都是东西进入你身体的主要途径。\"",
      "en": "Those are going to be the primary sites by which things can get into your system.",
      "speaker": 0
    },
    {
      "start": 474.36,
      "end": 476.71999999999997,
      "zh": "你得让东西进入你的身体。",
      "en": "And you need to put things into your system.",
      "speaker": 0
    },
    {
      "start": 476.71999999999997,
      "end": 480.04,
      "zh": "你得吃喝，也得让光线进入身体。",
      "en": "You need to drink and eat, and you need to get light into your system.",
      "speaker": 0
    },
    {
      "start": 480.04,
      "end": 481.58,
      "zh": "所以才有这些开口。",
      "en": "That's why you have those openings.",
      "speaker": 0
    },
    {
      "start": 481.58,
      "end": 486.96,
      "zh": "但坏东西，也就是能伤害你的东西，也能通过这些入口进去。",
      "en": "But bad things, meaning things that can harm you, can get into those systems.",
      "speaker": 0
    },
    {
      "start": 486.96,
      "end": 496.68,
      "zh": "然后呢，从喉咙到胃，再到消化系统，经过肠子到肛门，其实就是一根管子。你基本上就是一串管子。",
      "en": "And then of course, along the back of your throat, all the way down to your stomach and your digestive system, and through your intestines and out your rectum, you have a tube that you are basically a series of tubes.",
      "speaker": 0
    },
    {
      "start": 496.68,
      "end": 501.8,
      "zh": "我之前在播客里也说过，这就是你从外界获取营养的管道之一。",
      "en": "I've said that before in this podcast, and this is one such tube by which you extract nutrients from the outside environment.",
      "speaker": 0
    },
    {
      "start": 501.8,
      "end": 505.4,
      "zh": "\"但这整根管子，包括你的鼻子和嘴巴，都是有黏液的。\"",
      "en": "But all along that tube, including your nose and your mouth, it's lined with mucus.",
      "speaker": 0
    },
    {
      "start": 506.94,
      "end": 513.34,
      "zh": "而且虽然有些人觉得黏液有点恶心，但你越了解它，就越觉得黏液真的很神奇。",
      "en": "And while mucus might seem kind of gross to some of you, the more you learn about mucus, the more you realize that mucus is really, really cool.",
      "speaker": 0
    },
    {
      "start": 513.34,
      "end": 517.18,
      "zh": "因为黏液就像过滤器，可以捕捉细菌和病毒。",
      "en": "Because mucus essentially acts as a filter, as a trap for bacteria and viruses.",
      "speaker": 0
    },
    {
      "start": 517.18,
      "end": 521.52,
      "zh": "而且它还有办法清除或杀死那些细菌和病毒。",
      "en": "And it has certain ways of scrubbing or killing those bacteria and viruses.",
      "speaker": 0
    },
    {
      "start": 521.52,
      "end": 524.6,
      "zh": "现在，这些黏液一直在更新。",
      "en": "Now, the mucus is constantly being turned over.",
      "speaker": 0
    },
    {
      "start": 521.52,
      "end": 535.36,
      "zh": "\"等会我们会聊到，黏液的化学成分很重要，能阻挡一些东西进入你的身体，同时让其他东西通过，这样你就能从中吸收营养。\"",
      "en": "As we'll talk about later, the chemistry of that mucus is really important in order to make sure that certain things don't make it into your system, and other things are allowed to move through your system, and you can extract nutrients from them.",
      "speaker": 0
    },
    {
      "start": 535.4,
      "end": 545.38,
      "zh": "\"我先讲免疫系统这第一道防线，是想让你想象自己是个独立的个体，你需要吸收对的东西，挡住或者消灭不对的东西。\"",
      "en": "So the reason I'm talking about this first category of barrier for immune system in such detail is I'd like you to envision yourself as a human, of course, but as a human that is a clear entity from everything else, and you have to bring in the right things, and you have to keep out the wrong things or kill them.",
      "speaker": 0
    },
    {
      "start": 545.38,
      "end": 549.48,
      "zh": "\"不过，细菌、病毒和寄生虫还是会进到我们身体里。\"",
      "en": "Now, inevitably, bacteria, viruses, and parasitic infections are going to make their way into our body.",
      "speaker": 0
    },
    {
      "start": 549.48,
      "end": 555.36,
      "zh": "\"但它们会不会被消灭，或是引发问题，就要看第二、第三层了。\"",
      "en": "But whether or not they are killed off, or whether or not they take over and cause us harm is going to be determined by layers two and three.",
      "speaker": 0
    },
    {
      "start": 555.36,
      "end": 560.74,
      "zh": "\"第二层和第三层就是所谓的先天免疫系统和适应性免疫系统。\"",
      "en": "So layers two and three are the so-called innate immune system and the adaptive immune system.",
      "speaker": 0
    },
    {
      "start": 560.74,
      "end": 565.36,
      "zh": "\"所以，先天免疫系统就是我说的第二道防线，反应很快。\"",
      "en": "So the innate immune system is what I would call the second layer of defense, it's very fast.",
      "speaker": 0
    },
    {
      "start": 564.3199999999999,
      "end": 578.72,
      "zh": "\"所以不管是细菌、病毒还是寄生虫，一旦进到你身体里，比如你吃下去了，或者通过眼睛进来的，或者你和带病的人握手后又揉了眼睛，接下来会发生什么呢？\"",
      "en": "So whether or not it's bacteria, virus, or parasite, what happens when you have something enter your body, maybe you swallowed it, maybe it got in through your eyes, maybe you shook somebody's hand who was carrying a particular kind of illness, and then you wiped your eyes.",
      "speaker": 0
    },
    {
      "start": 576.92,
      "end": 589.72,
      "zh": "我之前在这个播客里说过，其实我们见到别人后，通常在30秒内，大多数人就会不自觉地把对方的化学物质抹在自己脸上或者身体上。",
      "en": "And I've talked about on this podcast before, very soon after we meet another person, usually within 30 seconds, believe it or not, most people wipe that person's chemicals somewhere on their face or on their body surface.",
      "speaker": 0
    },
    {
      "start": 589.72,
      "end": 591.76,
      "zh": "\"这已经反复被证明了。\"",
      "en": "This has been demonstrated over and over again.",
      "speaker": 0
    },
    {
      "start": 591.76,
      "end": 597.1999999999999,
      "zh": "想了解更多的话，我们有一期专门讲化学信号的，你可以去听听。",
      "en": "If you want to learn more about that, we did an episode all about chemical signaling where you can learn about it.",
      "speaker": 0
    },
    {
      "start": 595.4,
      "end": 605.12,
      "zh": "\"我知道这听起来很奇怪，你可能会说我才不会这样，但事实上大多数时候大家都会这样做。\"",
      "en": "I know it sounds weird and you might say, I don't do that, but indeed you do most of the time, most everybody does.",
      "speaker": 0
    },
    {
      "start": 605.12,
      "end": 609.74,
      "zh": "好，那么这个先天免疫系统就是个快速反应系统。",
      "en": "Okay, so this innate immune system is this rapid response.",
      "speaker": 0
    },
    {
      "start": 609.74,
      "end": 618.6999999999999,
      "zh": "\"当有东西进入我们体内，身体不认识它，不是食物，不是干净空气，那可能就是细菌、病毒或者寄生虫。\"",
      "en": "When something enters our system and our body doesn't recognize it, it's not food, it's not clean air, it's something that's either a bacteria, virus, or parasite.",
      "speaker": 0
    },
    {
      "start": 618.6999999999999,
      "end": 625.36,
      "zh": "然后先天免疫系统会释放一些特定的细胞，这些细胞平时潜伏着，一旦有入侵者就准备好攻击。",
      "en": "And the innate immune system involves the release of particular cells that are waiting, dormant, ready to attack whatever this invader is.",
      "speaker": 0
    },
    {
      "start": 626.9,
      "end": 631.76,
      "zh": "你可能听说过这些细胞类型，其中最常见的就是所谓的白细胞。",
      "en": "And some of these cell types you've heard of before, the most typical one are the so-called white blood cells.",
      "speaker": 0
    },
    {
      "start": 631.76,
      "end": 636.62,
      "zh": "所以白细胞会主动去到入侵的地方，开始包围或者围住那个入侵者。",
      "en": "So the white blood cells will actively go to the site of invasion and will start to encapsulate or try and surround that given invader.",
      "speaker": 0
    },
    {
      "start": 636.62,
      "end": 645.08,
      "zh": "这些细胞还有其他名字，比如中性粒细胞、巨噬细胞、自然杀伤细胞，这只是众多免疫细胞中的一部分。",
      "en": "The other names of these different cell types are things like neutrophils, macrophages, natural killer cells, just a few of the many types of immune cells.",
      "speaker": 0
    },
    {
      "start": 645.08,
      "end": 651.72,
      "zh": "所以这有点像救护系统，不过不是像医护人员那样去治疗，而是去包围并消灭入侵者。",
      "en": "So this is kind of like an ambulance system, but rather than go and try and heal something like a paramedic would, they go there and they try and surround and kill whatever this invader is.",
      "speaker": 0
    },
    {
      "start": 651.72,
      "end": 656.0600000000001,
      "zh": "它们会和另外两种助攻一起合作，这些助攻叫做补体蛋白。",
      "en": "They work in concert with two other assistants and those assistants are called the complement proteins.",
      "speaker": 0
    },
    {
      "start": 656.0600000000001,
      "end": 658.3000000000001,
      "zh": "补体蛋白存在于血液中。",
      "en": "Complement proteins exist in the blood.",
      "speaker": 0
    },
    {
      "start": 658.3000000000001,
      "end": 663.48,
      "zh": "它们会跑到入侵的地方，把一些东西标记出来，然后被吞掉吃掉。",
      "en": "And what they do is they travel to sites where there's an invasion and they mark certain things for being engulfed and eaten.",
      "speaker": 0
    },
    {
      "start": 663.48,
      "end": 666.28,
      "zh": "\"它们就像贴了个‘吃掉我’的标签。\"",
      "en": "So they sort of put an eat me tag on it.",
      "speaker": 0
    },
    {
      "start": 666.28,
      "end": 677.22,
      "zh": "\"它们基本上是在入侵者上贴个化学标签，让白细胞、嗜中性粒细胞、巨噬细胞和自然杀伤细胞知道，嗯，我得包围消灭这个东西，然后处理掉。\"",
      "en": "They basically put a chemical tag onto invaders that then allows those white blood cells, neutrophils, macrophages, and natural killer cells to say, ah, I need to basically wrap, you'll kill this thing and then wrap it in a body bag and send it off.",
      "speaker": 0
    },
    {
      "start": 678.34,
      "end": 681.22,
      "zh": "\"消灭它，把它包起来送走。\"",
      "en": "Kill that thing, wrap it in a body bag and send it off.",
      "speaker": 0
    },
    {
      "start": 681.22,
      "end": 690.9,
      "zh": "\"我用了‘裹尸袋’这个比喻，其实挺合适的，因为这些细胞进来消灭东西，就是通过吞噬那些入侵的细菌、病毒或者寄生虫。\"",
      "en": "And I'm using the analogy of the body bag, but in the sense that it is one, it's the right one rather, because these cells that come in and kill things, the way they do that is actually to engulf the invading bacteria, virus, or parasite.",
      "speaker": 0
    },
    {
      "start": 690.9,
      "end": 693.34,
      "zh": "\"所以它们就把它包围起来。\"",
      "en": "So they actually surround it.",
      "speaker": 0
    },
    {
      "start": 693.9,
      "end": 694.98,
      "zh": "\"当你看到伤口化脓或者感染，比如皮肤上的伤口，或者长了倒刺的毛发里有细菌，那些脓和白色的部分，其实就是白细胞。我知道说起来有点恶心，但就是这样。\"",
      "en": "And when you see pus or you see infection in maybe a cut on the skin or something like that, or even in a ingrown hair that gets some bacteria in it, that pus and that the white part, I know it's kind of gross to talk about, but those are the white blood cells.",
      "speaker": 0
    },
    {
      "start": 693.9,
      "end": 696.4200000000001,
      "zh": "\"那些就是死掉的细胞，通常是死细胞。\"",
      "en": "And those are the dead, oftentimes it's dead cells.",
      "speaker": 0
    },
    {
      "start": 687.1800000000001,
      "end": 689.6,
      "zh": "\"那就是死掉的入侵者。\"",
      "en": "And that's the dead invader sitting there.",
      "speaker": 0
    },
    {
      "start": 690.9,
      "end": 693.34,
      "zh": "\"所以它就是想把它隔离在身体的那个部位。\"",
      "en": "So it's trying to create an isolated compartment because it wants to keep it in that part of the body.",
      "speaker": 0
    },
    {
      "start": 693.9,
      "end": 694.98,
      "zh": "\"好的，所以你有先天免疫系统。\"",
      "en": "Okay, so you've got the innate immune system.",
      "speaker": 0
    },
    {
      "start": 694.98,
      "end": 696.4200000000001,
      "zh": "\"补体通过血液起作用，它会给某些东西打上'吃掉我'的标记。\"",
      "en": "The compliment comes through blood and helps it by tagging certain things with an eat me signal.",
      "speaker": 0
    },
    {
      "start": 721.64,
      "end": 741.6600000000001,
      "zh": "\"然后就是那些因为受伤或寄生虫受损的细胞，或者因为细菌或病毒本身而受影响的细胞。\"",
      "en": "And then there are the cells that are either damaged from the injury or from the parasite, or are suffering because of the bacteria or the virus itself.",
      "speaker": 0
    },
    {
      "start": 744.9000000000001,
      "end": 747.24,
      "zh": "\"而你身体的细胞也会发出警报信号，不是'吃掉我'，而是'帮帮我'。\"",
      "en": "And the cells of your body will also release an alarm signal, which is not an eat me signal, but a help me signal.",
      "speaker": 0
    },
    {
      "start": 747.24,
      "end": 750.82,
      "zh": "\"这些'帮帮我'的信号就是我们说的细胞因子。\"",
      "en": "And those help me signals come in the form what we call cytokines.",
      "speaker": 0
    },
    {
      "start": 750.82,
      "end": 756.12,
      "zh": "\"这些细胞因子包括像白介素一、白介素六、肿瘤坏死因子等。\"",
      "en": "And the cytokines are things like interleukin one, interleukin six, tumor necrosis factor alpha.",
      "speaker": 0
    },
    {
      "start": 756.12,
      "end": 758.5600000000001,
      "zh": "\"你可能听说过这些东西。\"",
      "en": "You may have heard of these things.",
      "speaker": 0
    },
    {
      "start": 758.5600000000001,
      "end": 764.76,
      "zh": "\"如果你对健康领域有点好奇，尤其是最近几年，网上都在谈炎症这个词。\"",
      "en": "If you are at all curious about, or been learning about the health space, online health space, especially in the last few years, inflammation is all the buzzword now.",
      "speaker": 0
    },
    {
      "start": 764.76,
      "end": 768.32,
      "zh": "大家都在聊炎症，炎症，炎症。",
      "en": "Everyone's talking about inflammation, inflammation, inflammation.",
      "speaker": 0
    },
    {
      "start": 767.5600000000001,
      "end": 770.7,
      "zh": "我们说炎症到底是什么意思？",
      "en": "What do we mean when we say inflammation?",
      "speaker": 0
    },
    {
      "start": 770.7,
      "end": 774.82,
      "zh": "\"嗯，炎症是身体的反应，也是化学反应。\"",
      "en": "Well, inflammation is a physical response, but it's also a chemical response.",
      "speaker": 0
    },
    {
      "start": 775.32,
      "end": 783.94,
      "zh": "\"很多时候，人或动物模型中测量的炎症指标，比如白介素一、白介素六、肿瘤坏死因子α。\"",
      "en": "And many times the markers of inflammation that are measured in people or in animal models, excuse me, where this research is done are things like interleukin one, interleukin six, tumor necrosis factor alpha.",
      "speaker": 0
    },
    {
      "start": 783.94,
      "end": 789.0,
      "zh": "所以当这些在血液中升高时，就表示有细胞在喊，救命，救命。",
      "en": "So when those go up in the blood, it's a sign that somewhere there's a cell that's saying, help me, help me.",
      "speaker": 0
    },
    {
      "start": 789.0,
      "end": 797.7,
      "zh": "然后它就会分泌这些东西，把中性粒细胞、巨噬细胞、自然杀伤细胞和白细胞都召唤过来。",
      "en": "And it's secreting these things, which calls in those neutrophils, macrophages, natural killer cells and white blood cells.",
      "speaker": 0
    },
    {
      "start": 797.7,
      "end": 798.2600000000001,
      "zh": "好的。",
      "en": "Okay.",
      "speaker": 0
    },
    {
      "start": 797.7,
      "end": 803.7800000000001,
      "zh": "\"记住这些可能有帮助，但其实告诉大家白介素就是用来传递信息的，对吧？\"",
      "en": "And it might help to remember all this, but by just telling people that what interleukin means is to communicate, right?",
      "speaker": 0
    },
    {
      "start": 803.7800000000001,
      "end": 807.72,
      "zh": "所以白介素就在喊，救命啊。",
      "en": "So the interleukin is shouting out, help me.",
      "speaker": 0
    },
    {
      "start": 807.72,
      "end": 812.96,
      "zh": "补体蛋白过来就说，吃掉它，然后给入侵者打上吃掉我的标记。",
      "en": "The compliment proteins are coming in and saying, eat, eat this and tagging the invader with an eat me signal.",
      "speaker": 0
    },
    {
      "start": 812.96,
      "end": 817.96,
      "zh": "然后自然杀伤细胞和白细胞就开始干活，试图消灭那个东西。",
      "en": "And then the killer cells and the white blood cells are doing the job of trying to kill off that thing.",
      "speaker": 0
    },
    {
      "start": 817.96,
      "end": 819.9200000000001,
      "zh": "这就是先天免疫系统。",
      "en": "That's the innate immune system.",
      "speaker": 0
    },
    {
      "start": 819.9200000000001,
      "end": 827.96,
      "zh": "所以你的皮肤、黏膜加上先天免疫系统，就是对抗各种入侵者和感染的两层漂亮防线。",
      "en": "So that your skin and your mucus lining plus your innate immune system are a beautiful two layered set of defenses against various kinds of invaders and infections.",
      "speaker": 0
    },
    {
      "start": 827.96,
      "end": 831.44,
      "zh": "然后还有第三种，就是适应性免疫系统。",
      "en": "And then there's the third type, which is the adaptive immune system.",
      "speaker": 0
    },
    {
      "start": 831.44,
      "end": 834.8800000000001,
      "zh": "你会发现到现在为止，我都没提到抗体这个词。",
      "en": "And you'll notice that leading up until now, I haven't said the word antibody at all.",
      "speaker": 0
    },
    {
      "start": 834.88,
      "end": 848.68,
      "zh": "因为产生能识别特定入侵者的抗体，不是皮肤、黏膜、微生物群或先天免疫系统的工作，而是适应性免疫系统负责对抗细菌、病毒，甚至寄生虫和一些物理入侵者。",
      "en": "And that's because it is the job, not of the skin or the mucus or the microbiome or the innate immune system to produce antibodies that can recognize specific invaders, but rather it is the job of the adaptive immune system to create antibodies against bacteria, viruses, and even parasites and even physical intruders to your system.",
      "speaker": 0
    },
    {
      "start": 848.68,
      "end": 855.72,
      "zh": "所以适应性免疫系统有个很厉害的能力，就是能在入侵、感染或发炎的地方出现。",
      "en": "So the adaptive immune system has this incredible ability to show up at the site of invasion or infection or inflammation.",
      "speaker": 0
    },
    {
      "start": 855.72,
      "end": 860.56,
      "zh": "\"它是通过各种信号召唤过来的，包括我们之前提到的细胞因子。\"",
      "en": "It's called there by various cues, including the cytokines that we talked about earlier.",
      "speaker": 0
    },
    {
      "start": 860.56,
      "end": 864.86,
      "zh": "它会附着在入侵者上，并形成一个类似模子的结构。",
      "en": "And what it does is it actually attaches to and creates a sort of an imprint of the shape of whatever invader happens to be there.",
      "speaker": 0
    },
    {
      "start": 864.88,
      "end": 872.52,
      "zh": "所以如果那个入侵的细菌或病毒有波浪形、尖刺状或其他形状，就会在上面留下印记。",
      "en": "So if that particular invading bacteria or virus has a contour that's kind of rippled or kind of spiky or whatever shape it happens to have, it creates an imprint of that.",
      "speaker": 0
    },
    {
      "start": 872.52,
      "end": 880.54,
      "zh": "然后结合其他细胞，用这个印记产生特定的抗体，以便下次再遇到这个入侵者时能识别它。",
      "en": "And then using that imprint in concert with some other cells creates antibodies that are specific to recognize that invader, should the body ever have that invader inside of it again.",
      "speaker": 0
    },
    {
      "start": 880.54,
      "end": 883.4,
      "zh": "这就是为什么叫做适应性免疫系统。",
      "en": "Now, that's why it's called the adaptive immune system.",
      "speaker": 0
    },
    {
      "start": 883.4,
      "end": 890.98,
      "zh": "它其实就像是记住了之前的感染，这样下次同样的入侵者再来时，抗体就能立刻制造出来。",
      "en": "And in many ways, it creates a memory of a prior infection so that these antibodies can be made anytime that same invader comes back again.",
      "speaker": 0
    },
    {
      "start": 890.98,
      "end": 894.82,
      "zh": "\"所以这就是我们所说的免疫的基础。\"",
      "en": "All right, and so this is the basis of what we call immunity.",
      "speaker": 0
    },
    {
      "start": 894.88,
      "end": 898.14,
      "zh": "这就是我们说的增强抵抗某些感染能力的基础。",
      "en": "This is the basis of what we call an enhanced ability to combat certain types of infections.",
      "speaker": 0
    },
    {
      "start": 898.14,
      "end": 904.52,
      "zh": "\"这真是太神奇了，我都无法表达每个人的身体都有这种能力，真的很厉害，对吧？\"",
      "en": "And it's really a wonderful, and I mean, just I can't even state how incredible this really is that all of our bodies have this capacity, right?",
      "speaker": 0
    },
    {
      "start": 904.52,
      "end": 907.78,
      "zh": "我们有一种叫做白细胞的东西。",
      "en": "We have something called leukocytes.",
      "speaker": 0
    },
    {
      "start": 907.78,
      "end": 909.96,
      "zh": "\"这些其实就是白细胞。\"",
      "en": "These are essentially white blood cells.",
      "speaker": 0
    },
    {
      "start": 909.96,
      "end": 914.74,
      "zh": "我们有红细胞和白细胞，它们都来自同一种原始细胞。",
      "en": "We have red blood cells and white blood cells, and they both are derived from the same type of origin cell.",
      "speaker": 0
    },
    {
      "start": 914.74,
      "end": 916.28,
      "zh": "\"就是干细胞。\"",
      "en": "It's a stem cell.",
      "speaker": 0
    },
    {
      "start": 916.28,
      "end": 920.54,
      "zh": "听到干细胞，其实就是能变成多种细胞的一种细胞。",
      "en": "When you hear stem cell, a stem cell just means a cell that can become many different types of other cells.",
      "speaker": 0
    },
    {
      "start": 920.54,
      "end": 930.72,
      "zh": "\"我们有时候听说有人打干细胞针，或者干细胞的治疗潜力，但其实我们体内也有一些干细胞，可以变成很多不同的细胞类型。\"",
      "en": "We sometimes hear about stem cells in terms of people that are getting injections of stem cells or the potential therapeutic effects of or potential of stem cells, but we all harbor certain stem cells within us as well that can become lots of different cell types.",
      "speaker": 0
    },
    {
      "start": 930.72,
      "end": 936.34,
      "zh": "有一种特别的干细胞叫造血干细胞，它能变成红细胞和白细胞。",
      "en": "And there's one particular type of stem cell, which is the hemopoietic stem cell, which can give rise to red blood cells and white blood cells.",
      "speaker": 0
    },
    {
      "start": 936.34,
      "end": 941.0,
      "zh": "\"一般来说，这些干细胞在成年人的骨髓里。\"",
      "en": "And in general, these reside in the marrow, at least in adults.",
      "speaker": 0
    },
    {
      "start": 941.0,
      "end": 953.6,
      "zh": "所以在我们的骨髓里，有些细胞能被化学信号召唤到感染部位，生成抗体，然后在体内维持这些抗体，或者记住特定的感染，这样下次再感染时，我们就能马上消灭它。",
      "en": "So in our bone marrow, we have this ability to make certain cells that can go out when they are called out chemically, they're called out to sites of infection and create antibodies, and then maintain those antibodies in our system or have a memory of that particular infection so that if the infection comes back again, we can kill it off immediately.",
      "speaker": 0
    },
    {
      "start": 954.88,
      "end": 959.96,
      "zh": "\"这样就不用先经过先天反应，再等适应性反应慢慢来。\"",
      "en": "And it doesn't have to pass through these multiple stages of first the innate response, then the adaptive response taking some time.",
      "speaker": 0
    },
    {
      "start": 959.96,
      "end": 966.36,
      "zh": "\"其实，适应性免疫系统还有很多细节，不过我想强调几个相关的要点。\"",
      "en": "Now, there are a lot more details to the adaptive immune system, but I just want to emphasize a few points that might be relevant.",
      "speaker": 0
    },
    {
      "start": 966.36,
      "end": 971.26,
      "zh": "首先，抗体的名字有时候是IgM和IgG之类的。",
      "en": "First of all, the name of the antibodies that are created sometimes come in the form of IgM and IgG, things of that sort.",
      "speaker": 0
    },
    {
      "start": 971.26,
      "end": 976.22,
      "zh": "这不是详细的免疫学课程，Ig就是免疫球蛋白的意思，明白吗？",
      "en": "This isn't a full deep dive immunology class, but Ig stands for immunoglobulin, okay?",
      "speaker": 0
    },
    {
      "start": 975.42,
      "end": 980.88,
      "zh": "所以免疫球蛋白是适应性免疫反应的一部分，用来生成抗体。",
      "en": "So the immunoglobulins are part of the adaptive immune response in creating antibodies.",
      "speaker": 0
    },
    {
      "start": 980.88,
      "end": 987.18,
      "zh": "听到IgM，IgM就是适应性免疫反应中最先出现的，通常比较早出现。",
      "en": "If you hear IgM, the IgM is the first of the adaptive immune responses, and it tends to come on earlier.",
      "speaker": 0
    },
    {
      "start": 987.18,
      "end": 994.36,
      "zh": "所以，如果某人对某种病毒或细菌的IgM呈阳性，说明这是最近才感染的。",
      "en": "So if somebody is immunopositive for IgM for a particular type of viral or bacterial invader, that means that it was a fairly recent infection.",
      "speaker": 0
    },
    {
      "start": 994.36,
      "end": 1002.12,
      "zh": "\"之后，适应性免疫系统会生成IgG，这是一种更稳定的抗体，用来识别特定入侵者。\"",
      "en": "Later, one creates the adaptive immune system, I should say, creates an IgG, which is the more stable form of the specific antibody that's going to recognize a given invader.",
      "speaker": 0
    },
    {
      "start": 1002.12,
      "end": 1005.56,
      "zh": "\"IgG一般会稍微晚一点出现。\"",
      "en": "So IgG tends to come up a little bit later.",
      "speaker": 1
    },
    {
      "start": 1005.56,
      "end": 1010.9,
      "zh": "\"简单来说，就是东西通过眼睛、皮肤伤口或者嘴巴进入你身体。\"",
      "en": "So just to recap, something gets into your system through your eyes, through some hole in your skin, a cut through your mouth.",
      "speaker": 1
    },
    {
      "start": 1010.9,
      "end": 1014.2,
      "zh": "性病是通过生殖器的黏膜进入身体的。",
      "en": "Sexually transmitted diseases come in through the mucus membranes that are on the genitalia or in the genitalia.",
      "speaker": 1
    },
    {
      "start": 1014.88,
      "end": 1018.88,
      "zh": "性病、空气传播的病，都是通过黏膜进到血液里的。",
      "en": "Sexually transmitted disease, airborne disease, gets into the mucus, somehow gets into the bloodstream.",
      "speaker": 1
    },
    {
      "start": 1018.88,
      "end": 1024.86,
      "zh": "\"然后就是先天免疫反应，就是更广泛地去控制和对抗感染或入侵者。\"",
      "en": "Then there's the innate response, which is a more general response of trying to contain and combat the infection or invader.",
      "speaker": 1
    },
    {
      "start": 1024.86,
      "end": 1030.6,
      "zh": "然后就是适应性免疫反应，最先产生抗体的是IgM，接着是IgG。",
      "en": "And then the adaptive response is the one that generates the antibodies first, the IgM response, the immunoglobulin M response, and then the immunoglobulin G response, IgG response.",
      "speaker": 1
    },
    {
      "start": 1030.6,
      "end": 1032.14,
      "zh": "\"那我们怎么保持这三道防线或防御系统的活力呢？\"",
      "en": "So how do we keep these three barriers or these three defense systems to infection tuned up?",
      "speaker": 1
    },
    {
      "start": 1032.14,
      "end": 1034.74,
      "zh": "\"好吧，除了我之前提到的那些能增强免疫功能的，像睡眠、阳光和良好的营养这些保持健康的基本因素外。\"",
      "en": "Well, leaving aside the list of things that I mentioned before that generally enhances their function, things like sleep and sunlight and good nutrition, et cetera, the sort of generic things for good health.",
      "speaker": 1
    },
    {
      "start": 1034.74,
      "end": 1038.52,
      "zh": "\"我们可以做的关键之一就是保持黏膜的健康状态。\"",
      "en": "One of the key ways we can do that is to keep that mucus lining in really good shape.",
      "speaker": 1
    },
    {
      "start": 1049.0400000000002,
      "end": 1050.4,
      "zh": "\"这是什么意思呢？\"",
      "en": "And what does that mean?",
      "speaker": 1
    },
    {
      "start": 1050.4,
      "end": 1052.7,
      "zh": "\"嗯，黏膜要经常更新，要有正确的化学成分，才能挡住坏东西，还能让我们需要的营养物质通过。\"",
      "en": "Well, the mucus lining needs to turn over quite often, and it needs to be the correct chemistry to be a trap for the bad stuff and for it to be permeable to the good stuff, to the nutrients that we need.",
      "speaker": 1
    },
    {
      "start": 1052.7,
      "end": 1058.3000000000002,
      "zh": "\"现在已经很清楚了，成百上千的研究表明，最好的方法就是维持一个健康的所谓微生物群。\"",
      "en": "And it is now very clear from hundreds, if not thousands of studies, that the best way to do that is to maintain a healthy so-called microbiome.",
      "speaker": 1
    },
    {
      "start": 1058.3000000000002,
      "end": 1060.2600000000002,
      "zh": "\"微生物群就是那些对我们有益的小细菌，它们沿着我们的黏膜通道，甚至在眼睛里也有。\"",
      "en": "The microbiome being these little bacterial organisms that are good for us that live all along our mucus pathways and even in our eyes.",
      "speaker": 1
    },
    {
      "start": 1078.9,
      "end": 1081.38,
      "zh": "\"要说明白，不光是肠道的微生物群。\"",
      "en": "Now, just to be really clear, it's not just about the gut microbiome.",
      "speaker": 1
    },
    {
      "start": 1081.38,
      "end": 1084.72,
      "zh": "\"我们的眼睛里也有微生物群。\"",
      "en": "We actually have a microbiome in our eyes.",
      "speaker": 1
    },
    {
      "start": 1084.72,
      "end": 1088.38,
      "zh": "我们嘴巴里也有专属的微生物群。",
      "en": "We have one that's specific to our mouth.",
      "speaker": 1
    },
    {
      "start": 1088.38,
      "end": 1091.2800000000002,
      "zh": "我们的鼻子里也有专属的微生物群。",
      "en": "We have a nasal-specific microbiome.",
      "speaker": 1
    },
    {
      "start": 1091.2800000000002,
      "end": 1095.8200000000002,
      "zh": "\"整个消化道都有微生物群，从嘴巴、喉咙到胃、肠子，再到直肠，各个地方的微生物种类都不一样。\"",
      "en": "There's one all along the gut, and the species of microbiota that live all along the digestive tract differ from the mouth to the throat, to the stomach, intestines, and to the rectum.",
      "speaker": 1
    },
    {
      "start": 1095.8200000000002,
      "end": 1097.5200000000002,
      "zh": "\"很明确的是，这些健康的微生物群分布在整个消化道，而且每个地方的种类都不一样。\"",
      "en": "It's well-established that there are healthy microbiota that live all along that length and that they differ along that length.",
      "speaker": 1
    },
    {
      "start": 1097.5200000000002,
      "end": 1098.8000000000002,
      "zh": "还有尿道和阴道也有微生物群，能保持那里的健康。",
      "en": "There's also a urethral microbiota, and there's a vaginal microbiota that promotes health of that environment as well.",
      "speaker": 1
    },
    {
      "start": 1098.8000000000002,
      "end": 1101.5600000000002,
      "zh": "那怎么才能保持这些健康的微生物群，同时不让有害细菌滋生，或者让黏膜变得太透，导致外界坏东西进来呢？",
      "en": "So how is it that one can maintain the healthy microbiota and not favor growth of harmful bacteria or allow that mucus lining to become too permeable to the bad stuff that can come in from the environment?",
      "speaker": 1
    },
    {
      "start": 1101.5600000000002,
      "end": 1104.46,
      "zh": "\"我们知道有三个主要方法可以做到这一点。\"",
      "en": "Well, as far as we know, there are three main ways to do that.",
      "speaker": 1
    },
    {
      "start": 1104.46,
      "end": 1104.66,
      "zh": "\"前两个方法主要是结构和机械上的。\"",
      "en": "The first two are purely structural and mechanical.",
      "speaker": 1
    },
    {
      "start": 1104.66,
      "end": 1106.72,
      "zh": "现在很清楚的是，包括斯坦福在内的研究表明，鼻腔微生物群特别擅长清除细菌，预防某些感染。",
      "en": "It's very clear now from work, some of which was done at Stanford, but elsewhere as well, that the nasal microbiome is particularly good at scrubbing bacteria, at preventing certain types of infections.",
      "speaker": 1
    },
    {
      "start": 1131.0400000000002,
      "end": 1146.8000000000002,
      "zh": "\"所以提醒大家，能用鼻子呼吸就别用嘴巴，除非在吃东西或说话的时候。\"",
      "en": "So this is a reminder that whenever possible, unless eating or speaking, you want to be nasal breathing, not breathing through your mouth.",
      "speaker": 1
    },
    {
      "start": 1143.0800000000002,
      "end": 1145.48,
      "zh": "\"鼻子比嘴巴过滤病毒和细菌要好得多。\"",
      "en": "Your nose is a much better filter for viruses and bacteria than is your mouth.",
      "speaker": 1
    },
    {
      "start": 1145.48,
      "end": 1146.8000000000002,
      "zh": "嘴巴里也有些结构特征，甚至一些器官和细胞类型能抵抗感染，但有很多原因不建议用嘴呼吸。",
      "en": "The mouth contains certain structural features, even organs and cell types that can protect against incoming infection, but you don't want to be a mouth breather for a variety of reasons.",
      "speaker": 1
    },
    {
      "start": 1146.8000000000002,
      "end": 1148.52,
      "zh": "还有一本很棒的书叫《Jaws, A Hidden Epidemic》，是我斯坦福的同事Sandra Kahn和Paul Ehrlich写的，序是Jared Diamond和Robert Sapolsky写的。",
      "en": "And there's a terrific book called Jaws, A Hidden Epidemic, which was written by my colleagues, Sandra Kahn and Paul Ehrlich at Stanford and Stanford Medicine with a forward by Jared Diamond and Robert Sapolsky.",
      "speaker": 1
    },
    {
      "start": 1148.52,
      "end": 1151.98,
      "zh": "\"这本书有很多大咖参与，讲的是用嘴巴呼吸比用鼻子更容易感染。\"",
      "en": "So it's really a lot of heavy hitters on that book that talks about the increase in infection that one gets when breathing through the mouth as opposed to the nose.",
      "speaker": 1
    },
    {
      "start": 1151.98,
      "end": 1154.16,
      "zh": "\"当然啦，剧烈运动时用嘴巴呼吸也没什么不好。\"",
      "en": "Now, of course, during hard exercise, one breathes through the mouth, that's not necessarily bad.",
      "speaker": 1
    },
    {
      "start": 1154.16,
      "end": 1156.5800000000002,
      "zh": "吃东西或说话的时候用嘴呼吸也没啥问题。",
      "en": "When one is eating or speaking, that's not necessarily bad at all.",
      "speaker": 1
    },
    {
      "start": 1145.48,
      "end": 1146.8000000000002,
      "zh": "\"我想这要看你在说什么。\"",
      "en": "I guess it depends on what you're saying.",
      "speaker": 1
    },
    {
      "start": 1146.8000000000002,
      "end": 1148.52,
      "zh": "\"开个玩笑而已。\"",
      "en": "It was a joke.",
      "speaker": 1
    },
    {
      "start": 1143.0800000000002,
      "end": 1144.5400000000002,
      "zh": "不过一般来说，有条件的话还是用鼻子呼吸比较好。",
      "en": "But in general, when possible, you want to be breathing through your nose.",
      "speaker": 1
    },
    {
      "start": 1144.5400000000002,
      "end": 1145.48,
      "zh": "很多人鼻子呼吸有问题，因为鼻中隔偏曲或者长期鼻窦塌陷。",
      "en": "Many people have trouble breathing through their nose because of so-called deviated septums or chronically collapsed sinuses.",
      "speaker": 1
    },
    {
      "start": 1143.0800000000002,
      "end": 1144.5400000000002,
      "zh": "其实最好的办法就是用鼻子呼吸，把鼻窦打开。",
      "en": "The best way to dilate those sinuses is actually to breathe through your nose.",
      "speaker": 1
    },
    {
      "start": 1144.5400000000002,
      "end": 1145.48,
      "zh": "所以可能需要点时间，不过鼻窦还是有些可塑性的。",
      "en": "So it can take a little bit of time, but there is some plasticity to the sinuses.",
      "speaker": 1
    },
    {
      "start": 1143.0800000000002,
      "end": 1145.48,
      "zh": "所以还是用鼻子呼吸，别用嘴巴。",
      "en": "And so be a nose breather, not a mouth breather.",
      "speaker": 1
    },
    {
      "start": 1145.48,
      "end": 1146.8000000000002,
      "zh": "你会更好地抵抗经常遇到的感染。",
      "en": "You will combat more of the infections that you are constantly confronted with.",
      "speaker": 1
    },
    {
      "start": 1146.8000000000002,
      "end": 1148.52,
      "zh": "\"我得说，我们总是被各种细菌、病毒和寄生虫包围着。\"",
      "en": "I should mention that we are always bombarded with different types of bacteria, viruses, and parasites in our environment.",
      "speaker": 1
    },
    {
      "start": 1148.52,
      "end": 1151.98,
      "zh": "\"我们的目标就是增强免疫系统，这样就能抵御这些东西，不容易生病。\"",
      "en": "And the goal, of course, is to reinforce your immune system so you can keep these things at bay and not get sick.",
      "speaker": 1
    },
    {
      "start": 1151.98,
      "end": 1154.16,
      "zh": "有篇发表在Cell Report的文章提到，鼻腔的微生物群里有些特定的细菌特别擅长对抗感染。",
      "en": "There's actually a paper that was published in Cell Report, Cell Press Journal, excellent journal, that showed that the nasal microbiome, it has particular species of microbiota that are good at fighting off infection.",
      "speaker": 1
    },
    {
      "start": 1154.16,
      "end": 1156.5800000000002,
      "zh": "\"目前还没有直接证据表明鼻子呼吸方式和鼻腔微生物群有特定联系，但用鼻子呼吸给那里的环境供氧，对增强过滤功能挺重要的。\"",
      "en": "There has not been a direct link between particular patterns of nasal breathing and the nasal microbiome yet, but oxygenation of that environment by breathing through your nose turns out to be quite important overall for enhancing it as a filter.",
      "speaker": 1
    },
    {
      "start": 1156.5800000000002,
      "end": 1157.92,
      "zh": "\"所以别只把鼻子当成闻东西和吸空气用的。\"",
      "en": "So don't just think of your nose as something to smell foods and to bring in air.",
      "speaker": 1
    },
    {
      "start": 1157.92,
      "end": 1160.44,
      "zh": "\"它其实也是个防止入侵的活性过滤器。\"",
      "en": "It's also an active filter for things that could invade you.",
      "speaker": 1
    },
    {
      "start": 1160.44,
      "end": 1162.64,
      "zh": "\"还有一个避免生病的方法，就是听妈妈的话，别在接触别人或摸东西后去揉眼睛。\"",
      "en": "The other way to try and keep out bad things and to avoid getting sick is the advice that your mother, and certainly my mother, gave me, which is to not touch your eyes after touching other people or touching other surfaces.",
      "speaker": 1
    },
    {
      "start": 1162.64,
      "end": 1163.5600000000002,
      "zh": "\"就像我之前说的，这些动作我们常常下意识就做了。\"",
      "en": "And as I mentioned earlier, we tend to do this subconsciously.",
      "speaker": 1
    },
    {
      "start": 1163.5600000000002,
      "end": 1164.44,
      "zh": "\"不揉眼睛的原因是眼睛是细菌和病毒的主要入口。\"",
      "en": "But the reason to avoid doing that is the eyes are a primary entry point for a lot of bacteria and viruses.",
      "speaker": 1
    },
    {
      "start": 1164.44,
      "end": 1164.64,
      "zh": "\"你一直在用泪腺和眼泪这些东西润滑眼球表面。\"",
      "en": "You're constantly lubricating the surface of your eyes with the so-called lacrimal glands and tears and things of that sort.",
      "speaker": 1
    },
    {
      "start": 1164.64,
      "end": 1166.1000000000001,
      "zh": "\"你有没有注意到，早上醒来时眼角会有眼屎。\"",
      "en": "If you've ever noticed when you wake up in the morning, you have some sleep in your eyes.",
      "speaker": 1
    },
    {
      "start": 1166.1000000000001,
      "end": 1170.18,
      "zh": "\"就是你眼角或睫毛上的眼屎。\"",
      "en": "You're the kind of crusty stuff in the corners of your eyes or on your eyelashes.",
      "speaker": 1
    },
    {
      "start": 1170.18,
      "end": 1173.16,
      "zh": "\"那些眼屎其实是你晚上成功打败的死细菌。\"",
      "en": "That sleep, that crust are actually dead bacteria that you've successfully battled during the night.",
      "speaker": 1
    },
    {
      "start": 1173.16,
      "end": 1174.3200000000002,
      "zh": "\"就是这么回事。\"",
      "en": "That's what that is.",
      "speaker": 1
    },
    {
      "start": 1176.3000000000002,
      "end": 1178.38,
      "zh": "\"那不是健康组织的积累。\"",
      "en": "It's not the accumulation of some healthy tissue.",
      "speaker": 1
    },
    {
      "start": 1178.38,
      "end": 1181.64,
      "zh": "\"那其实是健康的黏膜、眼泪和其他东西在对抗细菌的结果。\"",
      "en": "It's the accumulation of your healthy mucus membranes and tears and other things that are specifically combating those bacteria.",
      "speaker": 1
    },
    {
      "start": 1182.4,
      "end": 1183.2,
      "zh": "\"听起来有点恶心，但就是这么回事。\"",
      "en": "So I know that sounds a little bit gross, but that's what that is.",
      "speaker": 1
    },
    {
      "start": 1183.2,
      "end": 1186.0600000000002,
      "zh": "\"所以你是在擦掉你晚上战斗的战利品。\"",
      "en": "So you're wiping away the casualties of a battle that you fought at night.",
      "speaker": 1
    },
    {
      "start": 1186.0600000000002,
      "end": 1190.1000000000001,
      "zh": "\"所以白天尽量别让病毒接触眼睛。\"",
      "en": "So during the daytime, you don't want to introduce viruses and things to your eyes as much as possible.",
      "speaker": 1
    },
    {
      "start": 1176.3000000000002,
      "end": 1178.38,
      "zh": "\"那是病毒主要入侵的地方。\"",
      "en": "It is a primary site of entry.",
      "speaker": 1
    },
    {
      "start": 1178.38,
      "end": 1181.64,
      "zh": "\"这就是为什么手术室的人要戴护目镜，尽量避免东西进眼睛。\"",
      "en": "This is why people wear goggles in surgical units and things of that sort to try and avoid getting things into their eyes.",
      "speaker": 1
    },
    {
      "start": 1182.4,
      "end": 1183.2,
      "zh": "\"真的很重要。\"",
      "en": "Very, very important.",
      "speaker": 1
    },
    {
      "start": 1183.2,
      "end": 1186.0600000000002,
      "zh": "\"第三个保持黏膜健康的方法就是促进肠道好菌的繁殖。\"",
      "en": "And then the third way to keep a healthy line of defense for your entire mucus tract is to enhance the proliferation of good gut microbiota.",
      "speaker": 1
    },
    {
      "start": 1186.0600000000002,
      "end": 1190.1000000000001,
      "zh": "\"每天吃两到四份低糖发酵食品，是提升肠道菌群和身体保护黏膜的最佳方法。\"",
      "en": "The best way to enhance the quality of your gut microbiome and the mucus lining that serves as this protective layer all along your body is to ingest two to four servings a day of fermented foods, low sugar fermented foods.",
      "speaker": 1
    },
    {
      "start": 1190.1000000000001,
      "end": 1192.66,
      "zh": "\"我之前在播客里讲过很多次，这是我同事Justin Sonnenberg在斯坦福医学院实验室的数据。\"",
      "en": "I've talked about this before a bunch of times on the podcast, but these are data from my colleague, Justin Sonnenberg's lab at Stanford Med.",
      "speaker": 1
    },
    {
      "start": 1192.7800000000002,
      "end": 1194.42,
      "zh": "\"然后我就擦了擦眼睛。\"",
      "en": "And there, I just wiped my eyes.",
      "speaker": 1
    },
    {
      "start": 1194.64,
      "end": 1197.14,
      "zh": "\"你猜对了。\"",
      "en": "Yep, you got me.",
      "speaker": 1
    },
    {
      "start": 1197.14,
      "end": 1199.64,
      "zh": "但是《Cell》期刊上有篇文章提到，每天吃两到四份发酵食品，能降低某些细胞因子的活跃度。",
      "en": "But a paper published in the journal Cell, which is a absolutely spectacular journal, really points to the fact that when people eat fermented foods, two to four servings per day, it helps reduce the activity of certain cytokines.",
      "speaker": 1
    },
    {
      "start": 1199.64,
      "end": 1201.74,
      "zh": "\"你知道那些是什么吧？\"",
      "en": "Now you know what those are, right?",
      "speaker": 1
    },
    {
      "start": 1201.74,
      "end": 1205.3600000000001,
      "zh": "\"细胞会产生细胞因子，就像在喊救命，减少细胞因子数量能降低所谓的炎症反应。\"",
      "en": "Cells make cytokines to call out, help me, help me, to reduce the amount of cytokines, the so-called inflammatome.",
      "speaker": 1
    },
    {
      "start": 1205.3600000000001,
      "end": 1207.14,
      "zh": "\"不过这并不会让那些细胞更脆弱。\"",
      "en": "Now that doesn't render those cells more vulnerable.",
      "speaker": 1
    },
    {
      "start": 1207.14,
      "end": 1208.72,
      "zh": "\"他们看到IL-6和IL-1这些细胞因子减少，是因为肠道菌群健康的时候，身体里的细胞被外部感染的几率就小了，细胞就不需要喊救命，因为它们状态挺好，不用受罪。\"",
      "en": "The reason they saw a reduction in IL-6 and IL-1 and some of these other cytokines is because when people have a healthy gut microbiome, there are fewer cells in the body being infected from outside infections and therefore less of a reason for cells to be crying out help because they are thriving, not suffering.",
      "speaker": 1
    },
    {
      "start": 1208.72,
      "end": 1211.7800000000002,
      "zh": "\"所以别揉眼睛，保持手干净。\"",
      "en": "So don't wipe your eyes, keep your hands clean.",
      "speaker": 1
    },
    {
      "start": 1211.7800000000002,
      "end": 1212.68,
      "zh": "\"大家都这么说，对吧？\"",
      "en": "Everyone tells you that, right?",
      "speaker": 1
    },
    {
      "start": 1212.68,
      "end": 1215.1000000000001,
      "zh": "\"手要保持干净。\"",
      "en": "But keep your hands clean.",
      "speaker": 1
    },
    {
      "start": 1215.1000000000001,
      "end": 1217.6000000000001,
      "zh": "\"别揉眼睛。\"",
      "en": "Don't wipe your eyes.",
      "speaker": 1
    },
    {
      "start": 1217.6000000000001,
      "end": 1221.8200000000002,
      "zh": "\"用鼻子呼吸，别用嘴巴，除非你在说话、运动或者吃东西。每天吃两到四份低糖的优质发酵食品，保持肠道菌群健康。\"",
      "en": "Be a nasal breather, not a mouth breather, unless you're speaking, exercising or eating and keep a healthy gut microbiome by eating two to four servings a day of quality low sugar fermented foods.",
      "speaker": 1
    },
    {
      "start": 1221.8200000000002,
      "end": 1224.24,
      "zh": "\"比如酸菜，还有纳豆，如果能买到的话。\"",
      "en": "Things like sauerkraut, things like natto, if you can access that.",
      "speaker": 1
    },
    {
      "start": 1224.42,
      "end": 1225.8000000000002,
      "zh": "\"我试过，还挺有意思的。\"",
      "en": "I've tried it before, it's interesting.",
      "speaker": 1
    },
    {
      "start": 1225.8000000000002,
      "end": 1228.48,
      "zh": "\"这个味道需要慢慢习惯。\"",
      "en": "It's sort of an acquired taste.",
      "speaker": 1
    },
    {
      "start": 1228.48,
      "end": 1233.98,
      "zh": "\"泡菜、腌菜，低糖的效果最好。\"",
      "en": "Kimchi, pickles, again, low sugar sources are going to be the sources that are going to be most effective for this.",
      "speaker": 1
    },
    {
      "start": 1233.98,
      "end": 1236.44,
      "zh": "\"现在你有了三种方法来增强免疫系统和对抗感染，我觉得这跟平常听到的那些建议不太一样，比如睡好、吃好、保持社交联系什么的。\"",
      "en": "So now you're armed with three ways to enhance the function of your immune system and combat infection that is, I like to think separate from the typical type of information that you get, such as get good sleep, good nutrition, good social connection, et cetera.",
      "speaker": 1
    },
    {
      "start": 1236.44,
      "end": 1239.3400000000001,
      "zh": "\"那些建议还是有用的，不过我觉得这三点能更明显地增强免疫系统。\"",
      "en": "All that stuff still holds true, but these three other points, I think can really make a substantial difference in terms of bolstering the immune system, your immune system.",
      "speaker": 1
    },
    {
      "start": 1239.3400000000001,
      "end": 1243.92,
      "zh": "\"我想提一下，这些名字之后会提到很多次，像IL-6和IL-1这样的白细胞介素会引发炎症，但其实它们是求助信号，召唤细胞来消灭入侵者。\"",
      "en": "I do want to mention, because these names are going to come up several times during this episode, that while interleukins like IL-6 and IL-1 encourage inflammation, they are these help me signals that call in cells to gobble up invaders.",
      "speaker": 1
    },
    {
      "start": 1243.92,
      "end": 1246.04,
      "zh": "有些白细胞介素是抗炎的。",
      "en": "There are some interleukins that are anti-inflammatory.",
      "speaker": 1
    },
    {
      "start": 1246.04,
      "end": 1247.0600000000002,
      "zh": "我特别想强调一下IL-10，因为待会儿还会提到。",
      "en": "And the one that I'd like to highlight in particular, because it will come up again in a little bit, is interleukin 10.",
      "speaker": 1
    },
    {
      "start": 1247.0600000000002,
      "end": 1249.66,
      "zh": "所以并不是所有的白细胞介素都是引发炎症的。",
      "en": "So not all of the IL, insert number, not all of the interleukins are inflammatory.",
      "speaker": 1
    },
    {
      "start": 1249.66,
      "end": 1251.88,
      "zh": "有些是抗炎的。",
      "en": "Some are anti-inflammatory.",
      "speaker": 1
    },
    {
      "start": 1251.88,
      "end": 1253.5800000000002,
      "zh": "所以接下来要记住这一点。",
      "en": "So that's an important point to keep in mind as we go forward.",
      "speaker": 1
    },
    {
      "start": 1253.5800000000002,
      "end": 1254.1200000000001,
      "zh": "接下来我想聊聊所谓的疾病行为。",
      "en": "Next, I'd like to talk about what's called sickness behavior.",
      "speaker": 1
    },
    {
      "start": 1251.88,
      "end": 1254.1200000000001,
      "zh": "确实，有一种叫疾病行为的东西，它可以告诉我们怎么避免生病。",
      "en": "And indeed, there is a category of behavior that we call sickness behavior that is very informative as to the things that we can do to avoid getting sick.",
      "speaker": 1
    },
    {
      "start": 1251.88,
      "end": 1253.5800000000002,
      "zh": "其实，疾病行为这个概念已经有好几十年了。",
      "en": "Now, this notion of sickness behavior goes back several decades or more.",
      "speaker": 1
    },
    {
      "start": 1253.5800000000002,
      "end": 1254.1200000000001,
      "zh": "\"这个看免疫系统功能的方式挺有趣的，因为它把我们从免疫系统，也就是T细胞、B细胞、细胞因子和白细胞这些东西，连接起来。\"",
      "en": "And it's a very interesting way of looking at the function of the immune system, because what it does is it bridges us from this thing that we're calling the immune system, where it's T-cells and B-cells and cytokines and leukocytes.",
      "speaker": 1
    },
    {
      "start": 1254.12,
      "end": 1256.28,
      "zh": "\"然后它开始涉及到神经系统，因为神经系统当然会影响我们的行为。\"",
      "en": "And it starts taking us into the realm of the nervous system, because of course the nervous system controls behavior.",
      "speaker": 1
    },
    {
      "start": 1256.28,
      "end": 1260.32,
      "zh": "所以，疾病行为就是我们生病时常有的一系列反应。",
      "en": "So sickness behavior is a suite of responses that we tend to all undergo when we are feeling sick.",
      "speaker": 1
    },
    {
      "start": 1260.32,
      "end": 1262.58,
      "zh": "\"所以每个人反应可能不同，但一般来说，我们受伤、生病或有感染时都会有一些共同的反应。\"",
      "en": "So this is going to vary from person to person, but there's some general categories of things that we all do and that happened to all of us after we are wounded or sick or dealing with an infection of any kind.",
      "speaker": 1
    },
    {
      "start": 1254.12,
      "end": 1256.28,
      "zh": "\"仔细研究疾病行为，可以帮我们找到恢复健康的方法。\"",
      "en": "And by examining sickness behavior in some detail, it can be really informative as to routes that we can take to health.",
      "speaker": 1
    },
    {
      "start": 1256.28,
      "end": 1260.32,
      "zh": "\"所以生病时的行为主要就是我们活动量会变少。\"",
      "en": "So the main thing about sickness behavior is that it tends to involve a slowing of our usual levels of activity.",
      "speaker": 1
    },
    {
      "start": 1260.32,
      "end": 1267.84,
      "zh": "\"人们会开始觉得没力气，或者原本轻松能做的事，现在变得很难，甚至有点承受不住。\"",
      "en": "People start to feel lethargic or they feel like the activities that previously they could do with relative ease are very difficult for them or somewhat overwhelming.",
      "speaker": 1
    },
    {
      "start": 1267.84,
      "end": 1272.3799999999999,
      "zh": "\"还有就是，人和动物都会不再打理自己。\"",
      "en": "The other thing you start to see is that people and animals, by the way, stop grooming.",
      "speaker": 1
    },
    {
      "start": 1272.3799999999999,
      "end": 1279.5,
      "zh": "\"他们不再打理自己，不一定是停止洗澡，虽然经常会这样，但他们会不再整理头发。\"",
      "en": "They stop taking care of themselves, not necessarily stop showering, although oftentimes that's the case, but they will stop doing their hair.",
      "speaker": 1
    },
    {
      "start": 1279.5,
      "end": 1281.4399999999998,
      "zh": "\"他们会不再化妆。\"",
      "en": "They'll stop putting on makeup.",
      "speaker": 1
    },
    {
      "start": 1283.82,
      "end": 1286.06,
      "zh": "\"你知道，如果他们以前有做这些，现在可能就不做了。\"",
      "en": "You know, depending on whether or not they did that before, they might stop.",
      "speaker": 1
    },
    {
      "start": 1286.06,
      "end": 1288.84,
      "zh": "\"动物会停止舔毛和梳理自己。\"",
      "en": "Animals will stop licking and grooming themselves.",
      "speaker": 1
    },
    {
      "start": 1288.84,
      "end": 1291.62,
      "zh": "\"人们会不再注重外表。\"",
      "en": "People will stop taking care of their cosmetic appearance.",
      "speaker": 1
    },
    {
      "start": 1291.62,
      "end": 1298.8999999999999,
      "zh": "\"其实不是因为生病了就不在乎外表，而是因为某些活动被压抑了，其他活动反而增强了。\"",
      "en": "Now, it's not just because they don't care how they look when they're sick, it's because there's this overall suppression of certain kinds of activities and an enhancement of other kinds of activities.",
      "speaker": 1
    },
    {
      "start": 1298.8999999999999,
      "end": 1300.52,
      "zh": "\"这点真的很重要。\"",
      "en": "And this is really important.",
      "speaker": 1
    },
    {
      "start": 1300.52,
      "end": 1303.4599999999998,
      "zh": "\"生病其实是一种有动机的状态。\"",
      "en": "Sickness behavior is actually a motivated state.",
      "speaker": 1
    },
    {
      "start": 1303.4599999999998,
      "end": 1307.0,
      "zh": "\"这其实是一种为了达到某些目的的状态。\"",
      "en": "It's a state that's designed to accomplish certain things.",
      "speaker": 1
    },
    {
      "start": 1307.0,
      "end": 1310.76,
      "zh": "\"生病时除了懒洋洋、不注意打理，还有就是没胃口，对吧？\"",
      "en": "One of the other features of sickness behavior, in addition to being lethargic, loss of grooming, will be a loss of appetite, right?",
      "speaker": 1
    },
    {
      "start": 1310.76,
      "end": 1315.5,
      "zh": "\"很多平时胃口很好的人，生病时就完全没食欲了。\"",
      "en": "Oftentimes people who have a great appetite normally just won't feel hungry at all.",
      "speaker": 1
    },
    {
      "start": 1315.5,
      "end": 1318.3,
      "zh": "\"关于为什么会这样，有好几种说法。\"",
      "en": "And there are several theories as to why this would be.",
      "speaker": 1
    },
    {
      "start": 1318.3,
      "end": 1322.4399999999998,
      "zh": "有种说法是这样可以防止呕吐和腹泻，因为这些会传染给别人。",
      "en": "One prominent idea in the literature is that it's to discourage vomiting and diarrhea, which of course can be infectious to other people.",
      "speaker": 1
    },
    {
      "start": 1322.4399999999998,
      "end": 1323.8799999999999,
      "zh": "所以这就是一种说法。",
      "en": "So that's a theory.",
      "speaker": 1
    },
    {
      "start": 1323.8799999999999,
      "end": 1328.5,
      "zh": "\"我不知道这个说法有没有被直接验证过，但这是个想法。\"",
      "en": "I don't know that that's ever been tested directly, but that's one idea.",
      "speaker": 1
    },
    {
      "start": 1328.5,
      "end": 1331.84,
      "zh": "另一种说法是这样可以集中资源来修复身体。",
      "en": "The other idea is that it's simply to harbor more resources for sake of repair.",
      "speaker": 1
    },
    {
      "start": 1331.84,
      "end": 1336.46,
      "zh": "\"我想聊聊这个，因为我们生病时总被告知要多睡觉多休息。\"",
      "en": "And I want to talk about that because we are all told to get extra sleep when we aren't feeling well or to rest.",
      "speaker": 1
    },
    {
      "start": 1336.46,
      "end": 1339.4199999999998,
      "zh": "但就像两三岁的小孩总是问，为什么，为什么？",
      "en": "But just like any good two or three-year-old constantly asks, why, why?",
      "speaker": 1
    },
    {
      "start": 1339.4199999999998,
      "end": 1346.8,
      "zh": "\"好的科学家，关心健康的人，总是在问，为什么，我为什么要多睡觉？\"",
      "en": "Good scientists, good people who are interested in health information should always be asking, why, why should I get more sleep?",
      "speaker": 1
    },
    {
      "start": 1346.8,
      "end": 1351.02,
      "zh": "\"我生病时睡觉能带来什么好处，为什么要多睡？\"",
      "en": "What happens in sleep that I should get more sleep when I'm sick?",
      "speaker": 1
    },
    {
      "start": 1351.02,
      "end": 1353.1799999999998,
      "zh": "\"为什么我不能硬撑过去呢？\"",
      "en": "Why shouldn't I just push through this?",
      "speaker": 1
    },
    {
      "start": 1353.1799999999998,
      "end": 1356.54,
      "zh": "\"其实文献里有几个原因已经说得很清楚了。\"",
      "en": "And there are a couple of reasons for this that have been established in the literature.",
      "speaker": 1
    },
    {
      "start": 1356.54,
      "end": 1360.5,
      "zh": "\"首先，生病时减缓循环似乎确实有点用处。\"",
      "en": "The first is that there does seem to be something useful about slowing circulation when we are ill.",
      "speaker": 1
    },
    {
      "start": 1359.08,
      "end": 1376.58,
      "zh": "有个说法有数据支持，就是当我们放慢血液循环，比如不跑来跑去，多休息，躺着，甚至只是静静待着时，淋巴系统可以更好地活跃起来，因为它负责运送很多免疫相关的细胞和液体。",
      "en": "One idea that has some data to support it is that when we slow our circulation, our blood circulation, so not running around so much or running at all, but rather lying down, getting extra rest, maybe sleeping, maybe even just remaining still, is that the lymphatic system, which carries a lot of the immune-related cells and fluids is able to ramp up its levels of activity.",
      "speaker": 1
    },
    {
      "start": 1376.58,
      "end": 1379.08,
      "zh": "\"所以这挺有意思的，对吧？\"",
      "en": "So this is interesting, right?",
      "speaker": 1
    },
    {
      "start": 1378.08,
      "end": 1383.5,
      "zh": "\"所以减少血液循环，但提高淋巴系统的循环。\"",
      "en": "So reducing circulation of the blood, but increasing circulation of the lymphatic system.",
      "speaker": 1
    },
    {
      "start": 1383.5,
      "end": 1385.6599999999999,
      "zh": "你们应该都听说过淋巴系统吧。",
      "en": "You've all probably been familiar with the lymphatic system.",
      "speaker": 1
    },
    {
      "start": 1385.6599999999999,
      "end": 1389.1599999999999,
      "zh": "\"当你对抗感染时，淋巴结可能会疼。\"",
      "en": "When you're combating an infection, your lymph nodes can get sore.",
      "speaker": 1
    },
    {
      "start": 1389.1599999999999,
      "end": 1397.74,
      "zh": "你的耳朵后面、腹股沟、腋下、喉咙附近、甲状腺附近、喉咙里都有淋巴结。",
      "en": "You've got lymph nodes behind your ears and your groin, your armpits, around your throat, near your thyroid, in your throat, et cetera.",
      "speaker": 1
    },
    {
      "start": 1397.74,
      "end": 1399.74,
      "zh": "\"这就是另一个原因。\"",
      "en": "So that's the other reason.",
      "speaker": 1
    },
    {
      "start": 1403.1999999999998,
      "end": 1405.1399999999999,
      "zh": "有些人生病时，心理上会变得很脆弱，特别希望别人照顾他们。",
      "en": "Now, some people, when they get sick, get psychologically go into a very vulnerable state where they really, really want people, other people to take care of them.",
      "speaker": 1
    },
    {
      "start": 1405.1399999999999,
      "end": 1408.78,
      "zh": "你可能也见过这种情况，或者自己也有这种感觉。",
      "en": "You've probably witnessed this, or you feel this way yourself.",
      "speaker": 1
    },
    {
      "start": 1408.78,
      "end": 1410.36,
      "zh": "大概有一半的人会这样。",
      "en": "About 50% of people have that response.",
      "speaker": 1
    },
    {
      "start": 1410.36,
      "end": 1412.28,
      "zh": "\"他们特别希望被照顾。\"",
      "en": "They really want to be taken care of.",
      "speaker": 1
    },
    {
      "start": 1412.28,
      "end": 1415.02,
      "zh": "\"从适应的角度想想，这挺合理的，对吧？\"",
      "en": "Now, when you think about it from an adaptive perspective, this makes sense, right?",
      "speaker": 1
    },
    {
      "start": 1413.86,
      "end": 1421.84,
      "zh": "\"我们这个物种里有人生病了，多多少少会以某种方式向其他人求助，希望得到照顾。\"",
      "en": "A member of our species is ill and they more or less will cry out for help in one form or another to the other members of their species to take care of them.",
      "speaker": 1
    },
    {
      "start": 1422.4399999999998,
      "end": 1427.1999999999998,
      "zh": "\"当然，这在那些太年轻或无力自理的人身上会特别明显。\"",
      "en": "And of course, this will be especially apparent in cases where people are young enough or incapacitated enough that they can't actually get resources on their own.",
      "speaker": 1
    },
    {
      "start": 1426.1,
      "end": 1431.9399999999998,
      "zh": "\"如果你生过重病，连去趟冰箱或者厕所都感觉像是个大工程。\"",
      "en": "If you've ever been really sick, just getting up and going to the fridge or to the restroom can feel like a monumental task.",
      "speaker": 1
    },
    {
      "start": 1432.34,
      "end": 1435.62,
      "zh": "\"大概有一半的人会说自己生病时会找人帮忙。\"",
      "en": "So about 50% of people report or describe seeking of help and support when they are sick.",
      "speaker": 1
    },
    {
      "start": 1435.62,
      "end": 1441.3,
      "zh": "\"但你也可以想象，这可能不是个好办法，因为容易把病传给照顾你的人。\"",
      "en": "But you could also imagine how this would be a very non-adaptive response because it increases the opportunity to spread infection to the caretaker.",
      "speaker": 1
    },
    {
      "start": 1441.3,
      "end": 1443.6599999999999,
      "zh": "\"这确实是个值得考虑的问题。\"",
      "en": "So that's an interesting consideration.",
      "speaker": 1
    },
    {
      "start": 1443.6599999999999,
      "end": 1447.5,
      "zh": "\"另外一半的人生病时好像反应正好相反。\"",
      "en": "Another 50% of people seem to have the opposite response when they're sick.",
      "speaker": 1
    },
    {
      "start": 1445.98,
      "end": 1458.12,
      "zh": "\"所以不管生病前是什么样子，大脑的神经回路触发的生病行为就是，别靠近我，我想一个人待着，不想被照顾，对吧？\"",
      "en": "So somehow, regardless of how they were prior to getting ill, the sickness behavior that's engaged by these neural circuits in the brain, they are indeed neural circuits in the brain, create a stay away from me, I don't want to be bothered, I want to be left alone, I don't want to be taken care of, right?",
      "speaker": 1
    },
    {
      "start": 1457.46,
      "end": 1464.36,
      "zh": "\"这不是固执，生病时就是对社交没兴趣，或者说不想和人接触。\"",
      "en": "It's not stubbornness, it's literally a lack of interest or a disinterest in social connection when one is sick.",
      "speaker": 1
    },
    {
      "start": 1464.36,
      "end": 1466.2,
      "zh": "\"动物也是这样的。\"",
      "en": "And you see this in animals too.",
      "speaker": 1
    },
    {
      "start": 1464.36,
      "end": 1478.72,
      "zh": "\"有些动物会去找同类，但也有些动物，比如我那只已经去世的斗牛犬Costello，每次生病的时候，我总能知道，因为他会跑到房子后面躲起来。\"",
      "en": "Some animals will seek out other members of their species, others, like my unfortunately now passed away bulldog, Costello, when he was sick, I always knew because he would go around the back of the house and he would just hide there.",
      "speaker": 1
    },
    {
      "start": 1478.72,
      "end": 1480.6,
      "zh": "\"他就会自己躲开所有人。\"",
      "en": "He would just take himself away from everybody else.",
      "speaker": 1
    },
    {
      "start": 1480.6,
      "end": 1482.52,
      "zh": "\"他就是不想被照顾。\"",
      "en": "He did not want to be taken care of.",
      "speaker": 1
    },
    {
      "start": 1482.52,
      "end": 1484.8999999999999,
      "zh": "\"这就是他本能的反应。\"",
      "en": "And it was just a natural response to him.",
      "speaker": 1
    },
    {
      "start": 1484.8999999999999,
      "end": 1487.98,
      "zh": "\"我觉得他不是故意不让我知道他得了什么病。\"",
      "en": "I don't think he was trying to prevent me from getting whatever it was that he had.",
      "speaker": 1
    },
    {
      "start": 1487.98,
      "end": 1498.7,
      "zh": "\"所以，有人不想被照顾，或者有人想被照顾的时候，要明白人和动物其实都有这两种反应，大概各占一半。\"",
      "en": "So if ever somebody doesn't want to be taken care of, or if they do want to be taken care of, realize that people tend to fall into these two bins, naturally and animals tend to fall into these bins, regardless of what species they are, it's about 50-50.",
      "speaker": 1
    },
    {
      "start": 1498.7,
      "end": 1502.08,
      "zh": "\"这种生病的反应其实是一种有动机的状态。\"",
      "en": "And again, this sickness behavior is a motivated state.",
      "speaker": 1
    },
    {
      "start": 1499.9399999999998,
      "end": 1512.32,
      "zh": "\"这种反应是为了减缓血液循环、增加淋巴循环和体内杀手细胞的流动，降低通过呕吐、腹泻甚至呼吸和接触传染给别人的几率。\"",
      "en": "It's designed to slow circulation of the blood, increased circulation of the lymph and the other killer cells in the body, reduce the probability of infecting others by reducing its thought diarrhea and vomit, but also breathing on others, interacting with others.",
      "speaker": 1
    },
    {
      "start": 1512.32,
      "end": 1519.08,
      "zh": "有时候，人一生病就会有种退回到童年的感觉，特别是成年人，会特别想被照顾。",
      "en": "And in some cases it will activate this, I don't want to call it a regressed state, but many people feel somewhat more, if they are adults, they feel more childlike when they are ill and they want to be taken care of very badly.",
      "speaker": 1
    },
    {
      "start": 1519.08,
      "end": 1524.32,
      "zh": "有些可能是后天学的，有些可能是天生的，我们也不太清楚。",
      "en": "Some of it might be learned, some of it might be innate, we don't know.",
      "speaker": 1
    },
    {
      "start": 1524.32,
      "end": 1528.32,
      "zh": "不过，生病时的反应有几个有趣的地方。",
      "en": "But the sickness behavior is very interesting for a couple of reasons.",
      "speaker": 1
    },
    {
      "start": 1528.32,
      "end": 1532.32,
      "zh": "\"首先，它很像神经科学文献里提到的重度抑郁状态。\"",
      "en": "First of all, it mimics another state that has been described in the neuroscience literature, which is major depression.",
      "speaker": 1
    },
    {
      "start": 1532.32,
      "end": 1542.32,
      "zh": "生病的人，不管是细菌病毒感染还是重度抑郁，体内的白介素-6和肿瘤坏死因子α水平都会明显升高。",
      "en": "And in both sick individuals, sick from bacterial viral infection, and in people with major depression, it's been shown that there are robust increases in the levels of interleukin-6 and tumor necrosis factor alpha.",
      "speaker": 1
    },
    {
      "start": 1542.32,
      "end": 1547.32,
      "zh": "所以现在有个说法是，抑郁可能和这些炎症因子活跃有关。",
      "en": "So there is an idea now circulating that depression involves these inflammatory cytokines being very active.",
      "speaker": 1
    },
    {
      "start": 1547.32,
      "end": 1551.32,
      "zh": "而且我们知道生病时这些炎症因子会特别活跃。",
      "en": "And we know that illness involves inflammatory cytokines being very active.",
      "speaker": 1
    },
    {
      "start": 1551.32,
      "end": 1561.32,
      "zh": "\"所以如果你想想，重度抑郁和生病的相似性，应该能指引我们找到一些方法，帮助我们预防或更快康复。\"",
      "en": "So if you think about it, the similarity between major depression and being sick ought to be able to point us in a direction of interventions that could help us either prevent illness or move through illness more quickly.",
      "speaker": 1
    },
    {
      "start": 1561.32,
      "end": 1569.32,
      "zh": "\"但在我们朝这个方向走的时候，我想强调一下，生病的表现其实是免疫系统和神经系统之间的桥梁。\"",
      "en": "But as we head in that direction, because indeed that's the case, I just want to emphasize that sickness behavior is what provides this bridge between the immune system and the nervous system.",
      "speaker": 1
    },
    {
      "start": 1569.32,
      "end": 1578.32,
      "zh": "\"而且我们很快会发现，健康的行为，比如能避免感染的行为，也能清楚地显示神经系统和免疫系统之间的联系。\"",
      "en": "And what we'll soon see also is that healthy behavior, behavior that allows us to avoid infection also points to a clear bridge between the nervous system and the immune system.",
      "speaker": 1
    },
    {
      "start": 1578.32,
      "end": 1582.32,
      "zh": "\"我们不只是有大脑、身体和器官，还有个免疫系统。\"",
      "en": "That it isn't just that we have a brain and body and our organs, and then we have an immune system.",
      "speaker": 1
    },
    {
      "start": 1582.32,
      "end": 1585.32,
      "zh": "\"没错，它们一直在互相作用。\"",
      "en": "That's true, but they're interacting all the time.",
      "speaker": 1
    },
    {
      "start": 1585.32,
      "end": 1593.32,
      "zh": "\"这会让我们明白，某些思维模式和行为选择能增强免疫系统功能，反之亦然，这一点也不意外。\"",
      "en": "And this is going to lead us to a place where it's going to be very clear and not at all surprising how certain patterns of thinking and certain behaviors that we can elect to take can help enhance our immune system function and vice versa.",
      "speaker": 1
    },
    {
      "start": 1593.32,
      "end": 1596.32,
      "zh": "\"其实生病时还有两个特点值得注意。\"",
      "en": "There are two other features of sickness behavior definitely worth pointing out.",
      "speaker": 1
    },
    {
      "start": 1596.32,
      "end": 1604.32,
      "zh": "“一个理论是，生病时食欲下降，特别是对高蛋白食物的食欲下降，可能是身体在潜意识中想减少铁的摄入。”",
      "en": "One is a theory, which is that the reduced appetite, in particular appetite for protein-rich foods when sick is thought to be an attempt, a subconscious attempt of the organism to reduce the amount of iron that it's taking in.",
      "speaker": 1
    },
    {
      "start": 1606.32,
      "end": 1609.32,
      "zh": "\"一般来说，建议男性每天摄入大约八毫克铁。\"",
      "en": "Now, typically the amount of iron intake that's recommended or more or less is for men, it's about eight milligrams per day.",
      "speaker": 1
    },
    {
      "start": 1614.32,
      "end": 1620.32,
      "zh": "\"女性的话，每天需要18到27毫克，看她们是否怀孕、哺乳或月经期等情况。\"",
      "en": "For women, it's anywhere from 18 to 27 milligrams per day, depending on whether or not they're pregnant, lactating or menstruating, et cetera.",
      "speaker": 1
    },
    {
      "start": 1620.32,
      "end": 1622.32,
      "zh": "\"这个范围可能会有变化。\"",
      "en": "The ranges can vary.",
      "speaker": 1
    },
    {
      "start": 1622.32,
      "end": 1629.32,
      "zh": "\"不过，如果血液中的铁含量太高，比如每天超过45毫克，对身体会很有害。\"",
      "en": "But, and indeed it's true that if iron levels in the blood go too high, like over 45 milligrams per day can be very toxic to the system.",
      "speaker": 1
    },
    {
      "start": 1628.32,
      "end": 1641.32,
      "zh": "但在生物学和健康领域，有个理论比较流行，说食欲下降其实是为了减少铁的摄入，因为很多细菌和感染在血液中铁含量高时更容易繁殖。",
      "en": "But the theory that's prominent in the biology literature and in the health literature is that the reduction in appetite is actually an attempt to reduce iron intake specifically because many bacteria and other forms of infection seem to thrive when levels of iron in the blood are high.",
      "speaker": 1
    },
    {
      "start": 1641.32,
      "end": 1646.72,
      "zh": "\"我可不希望有人因为这个就突然开始铁限制饮食来改善健康。\"",
      "en": "Now, I don't want to see anyone take this to extreme and suddenly do an iron deprivation diet in order to get well.",
      "speaker": 1
    },
    {
      "start": 1646.72,
      "end": 1651.96,
      "zh": "\"不过这个理论挺有意思的，我不提就太可惜了，因为听起来挺有道理的。\"",
      "en": "But it's an interesting theory that I'd be remiss if I didn't mention, because it makes good sense.",
      "speaker": 1
    },
    {
      "start": 1651.96,
      "end": 1655.8999999999999,
      "zh": "\"铁其实是跟血红蛋白和红细胞结合在血液中的。\"",
      "en": "Iron is actually attached to hemoglobin and red blood cells in the bloodstream.",
      "speaker": 1
    },
    {
      "start": 1655.8999999999999,
      "end": 1658.08,
      "zh": "\"这通常对我们帮助挺大的。\"",
      "en": "Normally that can help us quite a lot.",
      "speaker": 1
    },
    {
      "start": 1658.08,
      "end": 1661.82,
      "zh": "\"对了，铁也在肌肉里，我应该提一下。\"",
      "en": "It's also in muscle, I should mention that.",
      "speaker": 1
    },
    {
      "start": 1661.82,
      "end": 1663.84,
      "zh": "铁可以储存在肌肉里。",
      "en": "Iron can be sequestered into muscle.",
      "speaker": 1
    },
    {
      "start": 1663.84,
      "end": 1667.34,
      "zh": "铁对健康有很多好处，不过。",
      "en": "And iron serves a lot of important health promoting roles, but.",
      "speaker": 1
    },
    {
      "start": 1666.46,
      "end": 1676.1399999999999,
      "zh": "\"减少食欲，进而减少铁的摄入，这会降低某些东西的能力，比如感染在体内某些部位的传播。\"",
      "en": "But by reducing appetite and thereby reducing iron intake, it does reduce the capacity of certain things, including infections, to travel in certain compartments within the body.",
      "speaker": 0
    },
    {
      "start": 1676.1399999999999,
      "end": 1681.04,
      "zh": "所以这只是个理论，但我想很多人生病时可能都没胃口。",
      "en": "So again, that's just theory, but I think many of you are probably familiar with not having an appetite when you're sick.",
      "speaker": 0
    },
    {
      "start": 1681.04,
      "end": 1684.66,
      "zh": "而患有重度抑郁的人，常见的就是食欲不振。",
      "en": "The other thing that's very typical of people with major depression is loss of appetite.",
      "speaker": 0
    },
    {
      "start": 1684.66,
      "end": 1687.48,
      "zh": "\"不是总这样，但经常会没胃口。\"",
      "en": "Not always, but often loss of appetite.",
      "speaker": 0
    },
    {
      "start": 1687.48,
      "end": 1693.36,
      "zh": "所以这里又看到，生病时没胃口，重度抑郁时也没胃口。",
      "en": "So here again, we have loss of appetite in sickness behavior, loss of appetite in major depression.",
      "speaker": 0
    },
    {
      "start": 1691.3,
      "end": 1702.5,
      "zh": "而且不意外的是，生病行为和重度抑郁的一个主要症状就是失去兴趣，不仅对社交，对性和生育也没兴趣。",
      "en": "And perhaps not surprisingly, one of the major symptoms of sickness behavior and major depression that map more or less onto one another is loss of libido or interest, not just in social interactions, but in sex and reproduction.",
      "speaker": 0
    },
    {
      "start": 1702.5,
      "end": 1706.1599999999999,
      "zh": "所以你看，生病行为和抑郁症其实很像。",
      "en": "And so again, if you think about sickness behavior and depression, they are very, very similar.",
      "speaker": 0
    },
    {
      "start": 1706.1599999999999,
      "end": 1711.18,
      "zh": "所以，生病行为和重度抑郁有一些共同的核心特征。",
      "en": "Okay, so sickness behavior and major depression have certain core features in common.",
      "speaker": 0
    },
    {
      "start": 1711.18,
      "end": 1719.48,
      "zh": "所以我们得问自己，为什么生病会影响我们的思维和感知，还会影响食欲，以及我们想要被照顾多少。",
      "en": "We need to therefore ask ourselves, why and how does being sick influence the way that we think and perceive our environment and impact our appetite, whether or not we want to be cared for more or cared for less.",
      "speaker": 0
    },
    {
      "start": 1719.48,
      "end": 1722.32,
      "zh": "\"在这方面，人们往往分成两派。\"",
      "en": "Again, people tend to diverge into two different bins there.",
      "speaker": 0
    },
    {
      "start": 1722.32,
      "end": 1725.68,
      "zh": "\"你可能不信，但这条路径已经找到了。\"",
      "en": "And believe it or not, the pathway for this has been identified.",
      "speaker": 0
    },
    {
      "start": 1725.68,
      "end": 1734.56,
      "zh": "\"当我们身体某个地方感染，比如头部、鼻窦或者耳朵感染，甚至身体伤口或受伤也会触发这些机制。\"",
      "en": "When we have an infection someplace in our body, and it could be up in our head, it could be a sinus infection, it could be an ear infection, or I should also mention many of these same mechanisms can also be the consequence of a wound or an injury to the body.",
      "speaker": 0
    },
    {
      "start": 1734.56,
      "end": 1742.6599999999999,
      "zh": "\"你知道，像是背部受伤或者椎间盘滑脱，或者说椎间盘突出吧，大家常这么说。\"",
      "en": "You know, a back injury or a slip disc, or I guess it's called a herniated disc is the way that you hear it described.",
      "speaker": 0
    },
    {
      "start": 1742.6599999999999,
      "end": 1745.3799999999999,
      "zh": "\"这样一来，我们可能会有点烦躁。\"",
      "en": "When we have that, we can be kind of irritable.",
      "speaker": 0
    },
    {
      "start": 1745.3799999999999,
      "end": 1749.34,
      "zh": "\"我们不想做某些事情，只想一个人待着。\"",
      "en": "We don't want to do certain things and we just want to be left alone.",
      "speaker": 0
    },
    {
      "start": 1749.34,
      "end": 1753.1,
      "zh": "\"事情变得更难了，怎么回事，为什么呢？\"",
      "en": "Things are harder, how, why?",
      "speaker": 0
    },
    {
      "start": 1753.1,
      "end": 1763.12,
      "zh": "其实，这跟迷走神经有关，它连接身体和大脑，向大脑特定区域传递信号，触发我们说的这种\"生病行为\"的状态。",
      "en": "Well, there's a known pathway, which is the so-called vagus nerve that connects the body and the brain, signals to particular brain sites to engage this category of motivational state that we call sickness behavior.",
      "speaker": 0
    },
    {
      "start": 1763.12,
      "end": 1766.96,
      "zh": "很多人可能听过迷走神经，就是V-A-G-U-S，迷走神经。",
      "en": "Many of you have probably heard of the vagus, V-A-G-U-S, vagus.",
      "speaker": 0
    },
    {
      "start": 1766.96,
      "end": 1770.28,
      "zh": "迷走神经是一条很广泛的神经通路。",
      "en": "The vagus nerve is a very extensive nerve pathway.",
      "speaker": 0
    },
    {
      "start": 1770.28,
      "end": 1778.34,
      "zh": "这是第十对颅神经，从脑干后面出来，进到身体里，广泛分支连接很多器官，包括我们的肺、心脏、肠道等等。",
      "en": "It's the 10th cranial nerve, comes out of the back of the brainstem, heads into the body and branches out extensively to innervate or connect to many of our organs, including our lungs, our heart, our gut, et cetera.",
      "speaker": 0
    },
    {
      "start": 1780.36,
      "end": 1783.34,
      "zh": "这些器官也能把神经信号传回大脑。",
      "en": "And all of those organs are able also to send neural signals back up to the brain.",
      "speaker": 0
    },
    {
      "start": 1783.34,
      "end": 1787.7,
      "zh": "有时候我们听说迷走神经是让自己冷静下来的途径。",
      "en": "We sometimes hear the vagus as the route to calming ourselves down.",
      "speaker": 0
    },
    {
      "start": 1787.7,
      "end": 1792.2,
      "zh": "\"可惜，这基本上是个误传，我也不知道怎么传开的。\"",
      "en": "Unfortunately, that's more or less a myth that I don't know how it got propagated.",
      "speaker": 0
    },
    {
      "start": 1792.2,
      "end": 1795.02,
      "zh": "迷走神经里有很多不同的通路。",
      "en": "You have lots of different pathways in the vagus.",
      "speaker": 0
    },
    {
      "start": 1795.02,
      "end": 1802.96,
      "zh": "\"其实，刺激迷走神经通常会让人更兴奋、更警觉，不过它确实有很多不同的通路。\"",
      "en": "Usually vagal stimulation actually creates more arousal and alertness, although it does have multiple pathways.",
      "speaker": 0
    },
    {
      "start": 1802.96,
      "end": 1809.6200000000001,
      "zh": "不过现在已经有很多研究在不同情况下研究迷走神经，包括在生病时的表现。",
      "en": "But there have now been many studies of the vagus in various contexts, including in sickness behavior.",
      "speaker": 0
    },
    {
      "start": 1807.5600000000002,
      "end": 1818.8400000000001,
      "zh": "迷走神经是把身体感染快速传递给大脑的通路，特别是传到下丘脑这个地方，这里有很多不同类型的神经元。",
      "en": "And it's very clear that the vagus nerve is the fast pathway by which an infection in the body is signaled to the brain, to a particular location in the brain called the hypothalamus, which harbors a lot of different types of neurons.",
      "speaker": 0
    },
    {
      "start": 1818.8400000000001,
      "end": 1823.4399999999998,
      "zh": "比如说，前视区的神经元会让体温升高，引发发烧，对吧？",
      "en": "Neurons, for instance, in the preoptic area that increase body temperature and fever, right?",
      "speaker": 0
    },
    {
      "start": 1823.4399999999998,
      "end": 1830.36,
      "zh": "\"这就是为什么升高体温很重要，身体想通过发烧来消灭入侵者。\"",
      "en": "That's one of the most important things is to increase body temperature in order to, it's the body's attempt to kill off this invader.",
      "speaker": 0
    },
    {
      "start": 1830.36,
      "end": 1833.6799999999998,
      "zh": "\"因为很多病毒和细菌在高温下活不久。\"",
      "en": "Because many viruses and many bacteria don't survive well at elevated heat.",
      "speaker": 0
    },
    {
      "start": 1833.6799999999998,
      "end": 1835.48,
      "zh": "这就是发烧的作用。",
      "en": "That's the function of a fever.",
      "speaker": 0
    },
    {
      "start": 1835.48,
      "end": 1838.04,
      "zh": "\"发烧其实是有作用的。\"",
      "en": "A fever actually has a functional role.",
      "speaker": 0
    },
    {
      "start": 1838.04,
      "end": 1841.1,
      "zh": "所以生物学里，我们喜欢用复杂词。",
      "en": "So in biology, we like complicated words.",
      "speaker": 0
    },
    {
      "start": 1841.1,
      "end": 1845.9599999999998,
      "zh": "所以我们把任何能升高体温或引起发烧的东西叫做pyrogen。",
      "en": "So we call anything that increases body temperature or creates a fever, a pyrogen.",
      "speaker": 0
    },
    {
      "start": 1845.9599999999998,
      "end": 1853.6599999999999,
      "zh": "\"很多年前，我本科时研究过pyrogens，往肚子里注射一种叫脂多糖的东西，然后就会发烧。\"",
      "en": "Many years ago, in my undergraduate years, I was working on pyrogens, injecting something called lippy polysaccharide into the belly, which then gives you a fever.",
      "speaker": 0
    },
    {
      "start": 1853.6599999999999,
      "end": 1856.72,
      "zh": "\"LPS会在肠道引发炎症反应。\"",
      "en": "The way it does that is LPS causes an inflammation response in the gut.",
      "speaker": 0
    },
    {
      "start": 1856.72,
      "end": 1859.28,
      "zh": "\"肠道不知道发生了什么。\"",
      "en": "The gut doesn't know what is happening.",
      "speaker": 0
    },
    {
      "start": 1859.28,
      "end": 1862.1,
      "zh": "\"胃细胞也不知道发生了什么。\"",
      "en": "The stomach cells don't know what's happening.",
      "speaker": 0
    },
    {
      "start": 1862.1,
      "end": 1868.76,
      "zh": "\"所以它们就开始分泌IL-6、IL-1这些细胞因子，杀伤细胞也会跑到肠道里去。\"",
      "en": "So they just start secreting the IL-6, the IL-1, all those cytokines, the killer cells migrate into the gut.",
      "speaker": 0
    },
    {
      "start": 1868.76,
      "end": 1872.34,
      "zh": "\"所以有时候你感冒不舒服时，会肚子疼。\"",
      "en": "That's why you sometimes get a stomach ache when you don't feel well, you have a flu or something like it.",
      "speaker": 0
    },
    {
      "start": 1872.34,
      "end": 1875.9199999999998,
      "zh": "\"然后神经信号、电信号就传到下丘脑了。\"",
      "en": "A neural signal, electrical signals get sent up to the hypothalamus.",
      "speaker": 0
    },
    {
      "start": 1875.9199999999998,
      "end": 1881.3,
      "zh": "\"下丘脑就会想，我不知道外面怎么了，但有信号说明有事发生了。\"",
      "en": "The hypothalamus says, oh, I don't know what's going on out there, but there's a signal something's going on.",
      "speaker": 0
    },
    {
      "start": 1881.3,
      "end": 1883.6,
      "zh": "\"那就让身体发热吧。\"",
      "en": "Let's just heat up the body.",
      "speaker": 0
    },
    {
      "start": 1883.6,
      "end": 1886.16,
      "zh": "\"那就开始把外面的东西烧掉吧。\"",
      "en": "Let's just start cooking whatever it is out there.",
      "speaker": 0
    },
    {
      "start": 1886.16,
      "end": 1890.52,
      "zh": "\"当然，你不希望发烧太高，因为会伤脑细胞。\"",
      "en": "And of course, you don't want fever to go too high because you can kill brain cells.",
      "speaker": 0
    },
    {
      "start": 1890.52,
      "end": 1894.6200000000001,
      "zh": "\"但在一定范围内，发烧其实是身体的一个自我保护反应，懂吧？\"",
      "en": "But within a particular range, the fever is a functional and adaptive response, okay?",
      "speaker": 0
    },
    {
      "start": 1894.6200000000001,
      "end": 1904.08,
      "zh": "\"所以你吃药降温可能会让你感觉舒服点，但其实这限制了身体为了消灭入侵者而产生的反应。\"",
      "en": "So if you're taking drugs to try and lower the fever, that might make you feel more comfortable, but actually that's limiting the response that your body is creating in order to try and kill off that invader.",
      "speaker": 0
    },
    {
      "start": 1904.08,
      "end": 1907.16,
      "zh": "\"当然，你也不希望发烧太高。\"",
      "en": "And again, you don't want fever to go too high.",
      "speaker": 0
    },
    {
      "start": 1907.16,
      "end": 1908.44,
      "zh": "\"这跟年龄有关。\"",
      "en": "This is going to vary depending on age.",
      "speaker": 0
    },
    {
      "start": 1908.44,
      "end": 1911.52,
      "zh": "你可以上网查查发烧可以接受的范围。",
      "en": "You can look up online what the range tolerable ranges are for fever.",
      "speaker": 0
    },
    {
      "start": 1911.52,
      "end": 1919.96,
      "zh": "但如果你发烧了，想降体温，除非烧得太厉害，否则其实不该这么做，因为这样不利于杀死入侵者。",
      "en": "But when you're trying to lower body temperature, when you have a fever, unless you're heading into dangerous levels of heating up, that's actually the wrong way to take your system if you do indeed want to kill off that invader.",
      "speaker": 0
    },
    {
      "start": 1919.96,
      "end": 1922.78,
      "zh": "那迷走神经就是快速反应的关键。",
      "en": "Okay, so the vagus nerve is the quick response.",
      "speaker": 0
    },
    {
      "start": 1922.78,
      "end": 1927.1200000000001,
      "zh": "它还会把信号传到大脑，让你对外界的感知改变。",
      "en": "It also sends input to areas of the brain that change your perception of the outside world.",
      "speaker": 0
    },
    {
      "start": 1927.1200000000001,
      "end": 1929.44,
      "zh": "\"我一说你就懂，就是怕光，对吧？\"",
      "en": "One of the most obvious of these, obvious once I tell it to you, is photophobia, right?",
      "speaker": 0
    },
    {
      "start": 1929.44,
      "end": 1933.02,
      "zh": "我喜欢阳光明媚的天气。",
      "en": "I love bright sunshine.",
      "speaker": 0
    },
    {
      "start": 1933.02,
      "end": 1936.0800000000002,
      "zh": "我想保持清醒的时候就喜欢光线亮一点。",
      "en": "I love bright lights when I want to be alert.",
      "speaker": 0
    },
    {
      "start": 1936.0800000000002,
      "end": 1943.0,
      "zh": "我们每个人对光的敏感度都不一样，但大多数人生病或身体有炎症时，会觉得亮光有点刺眼。",
      "en": "We all have different levels of light sensitivity, but most people, when they are sick, when there's an inflammation response in the body, they feel like bright lights are kind of aversive.",
      "speaker": 0
    },
    {
      "start": 1943.0,
      "end": 1945.5600000000002,
      "zh": "他们会有典型的怕光反应。",
      "en": "They get a well-described kind of classical photophobia.",
      "speaker": 0
    },
    {
      "start": 1945.5600000000002,
      "end": 1949.92,
      "zh": "\"这其实是通过一个从眼睛到丘脑前核的通路来调节的。\"",
      "en": "And that's mediated by a pathway that goes from your eye to an area of your thalamus called the anterior nucleus of the thalamus.",
      "speaker": 0
    },
    {
      "start": 1949.92,
      "end": 1953.0600000000002,
      "zh": "\"这是哈佛医学院的Clifford Saper做的研究。\"",
      "en": "This is work that was done by Clifford Saper at Harvard Medical School.",
      "speaker": 0
    },
    {
      "start": 1953.0600000000002,
      "end": 1955.3000000000002,
      "zh": "\"这研究真挺精彩的。\"",
      "en": "It's really beautiful work.",
      "speaker": 0
    },
    {
      "start": 1955.3000000000002,
      "end": 1961.7800000000002,
      "zh": "然后从那里到大脑外层，就是脑膜，差不多就是大脑和其他一些结缔组织接触的地方。",
      "en": "And then from there up to the outer lining of the brain, which is the meninges, just sort of on the outside of the brain where the brain starts to interface with some of the other connective tissues.",
      "speaker": 0
    },
    {
      "start": 1961.7800000000002,
      "end": 1964.18,
      "zh": "\"我们等会儿再详细聊这个。\"",
      "en": "We'll talk more about these later.",
      "speaker": 0
    },
    {
      "start": 1964.18,
      "end": 1967.7,
      "zh": "生病时，这可能会引起畏光和头痛。",
      "en": "It can actually create a photophobia and a headache when one is ill.",
      "speaker": 0
    },
    {
      "start": 1968.4,
      "end": 1970.2,
      "zh": "\"那么，这就是路径。\"",
      "en": "So here's the pathway.",
      "speaker": 0
    },
    {
      "start": 1970.2,
      "end": 1974.5400000000002,
      "zh": "有东西通过擦眼睛或者从嘴巴进入你体内。",
      "en": "Some invader gets into your system because you wiped your eyes or got in through your mouth.",
      "speaker": 0
    },
    {
      "start": 1974.5400000000002,
      "end": 1978.1200000000001,
      "zh": "\"你没听你妈的话，结果从眼睛进来了。\"",
      "en": "You didn't listen to your mother and got in through your eyes.",
      "speaker": 0
    },
    {
      "start": 1978.1200000000001,
      "end": 1979.92,
      "zh": "你觉得不舒服。",
      "en": "You're feeling sick.",
      "speaker": 0
    },
    {
      "start": 1979.92,
      "end": 1981.2,
      "zh": "\"这有点不对劲。\"",
      "en": "Something's going on there.",
      "speaker": 0
    },
    {
      "start": 1981.2,
      "end": 1983.24,
      "zh": "你肚子疼是因为那儿发炎了。",
      "en": "You have a stomach ache because of all the inflammation there.",
      "speaker": 0
    },
    {
      "start": 1983.24,
      "end": 1986.0600000000002,
      "zh": "\"信号是通过迷走神经传上去的。\"",
      "en": "The signal goes up from your vagus nerve.",
      "speaker": 0
    },
    {
      "start": 1986.0600000000002,
      "end": 1987.0800000000002,
      "zh": "你发烧了。",
      "en": "You're heating up with a fever.",
      "speaker": 0
    },
    {
      "start": 1986.0600000000002,
      "end": 1993.24,
      "zh": "你怕光是因为这个通路激活了，原本能忍受的光现在刺激了丘脑前核。",
      "en": "You've got photophobia because you've activated this pathway by which what would normally be tolerable light is triggering this thalamic nucleus, the anterior thalamus.",
      "speaker": 0
    },
    {
      "start": 1993.24,
      "end": 1995.2800000000002,
      "zh": "\"这影响到了脑膜。\"",
      "en": "That's projecting up to the meninges.",
      "speaker": 0
    },
    {
      "start": 1995.2800000000002,
      "end": 1997.0800000000002,
      "zh": "你因为看光而头疼。",
      "en": "You've got a headache in response to looking at light.",
      "speaker": 0
    },
    {
      "start": 1997.0800000000002,
      "end": 2000.6599999999999,
      "zh": "\"这其实就是让你去个安静黑暗的地方休息。\"",
      "en": "It's basically triggering an overall pathway to get you to go into a quiet, dark place and rest.",
      "speaker": 0
    },
    {
      "start": 2000.6599999999999,
      "end": 2002.9599999999998,
      "zh": "最后我想说的就是休息。",
      "en": "And the last element I'd like to talk about is the rest.",
      "speaker": 0
    },
    {
      "start": 2002.9599999999998,
      "end": 2006.56,
      "zh": "\"身体到大脑再到下丘脑有个反应被触发了。\"",
      "en": "There's something that gets triggered from the body to the brain to the hypothalamus.",
      "speaker": 0
    },
    {
      "start": 2006.56,
      "end": 2010.1399999999999,
      "zh": "我们觉得知道是哪块下丘脑区域出了问题。",
      "en": "And we think we know which hypothalamic area it is.",
      "speaker": 0
    },
    {
      "start": 2010.1399999999999,
      "end": 2012.4399999999998,
      "zh": "应该是视上核出问题了。",
      "en": "It's the supraoptic nucleus, we think.",
      "speaker": 0
    },
    {
      "start": 2012.4399999999998,
      "end": 2016.28,
      "zh": "\"视上核是因为它就在你所谓的视交叉上面。\"",
      "en": "Supraoptic because it's right above your so-called optic chiasm.",
      "speaker": 0
    },
    {
      "start": 2016.28,
      "end": 2019.36,
      "zh": "想知道在哪儿的话，就在你上颚上方。",
      "en": "If you want to look up where that is, it's right above the roof of your mouth.",
      "speaker": 0
    },
    {
      "start": 2019.36,
      "end": 2025.5,
      "zh": "那儿有些核团会让你白天也想睡觉，正常情况下这可是你生物钟活跃的时候。",
      "en": "And there are nuclei there that promote the desire to sleep even during the daytime, what would normally be the active phase of your circadian cycle.",
      "speaker": 0
    },
    {
      "start": 2025.5,
      "end": 2033.7,
      "zh": "\"这就有意思了，因为这里有多条路径在告诉你，避光、减少活动，把让你生病的东西都加热起来。\"",
      "en": "Now, that is really interesting because what's happening here is you've got multiple pathways that are saying, avoid light, reduce your amount of behavior, heat up all the things that are making you sick.",
      "speaker": 0
    },
    {
      "start": 2033.7,
      "end": 2038.3,
      "zh": "\"这就是病态行为，从身体到大脑，让你做出正确反应。\"",
      "en": "This is sickness behavior, and it's going from your body to your mind to make you do the right thing.",
      "speaker": 0
    },
    {
      "start": 2038.3,
      "end": 2048.54,
      "zh": "现在还有一条慢路径，完全是通过血液传递的，就是所谓的体液因素。不是因为搞笑，体液因素指的是血液中的成分。",
      "en": "Now, there's also a slow pathway that's purely mediated by the blood, so-called humoral factors, not because they're funny, but humoral factors are factors of the blood.",
      "speaker": 0
    },
    {
      "start": 2048.54,
      "end": 2061.36,
      "zh": "\"当你感染好几个小时或几天后，IL-6、IL-1、肿瘤坏死因子和其他炎症因子的量开始增加，最后在你血液中的总量高到足以传递给大脑。\"",
      "en": "As you have an infection for many hours or days, the amount of IL-6 and IL-1 and tumor necrosis factor and other inflammatory cytokines is starting to increase such that the total amount in your circulation gets high enough and is communicated to the brain.",
      "speaker": 0
    },
    {
      "start": 2061.36,
      "end": 2067.5,
      "zh": "\"这些因子通常通过一种叫脉络丛的特殊组织进入大脑，这个很有意思。\"",
      "en": "And it tends to enter the brain through a particular type of tissue that's really interesting called choroid, C-H-O-R-O-I-D.",
      "speaker": 0
    },
    {
      "start": 2067.5,
      "end": 2069.8,
      "zh": "\"脉络丛真挺有意思的。\"",
      "en": "Choroid is really interesting.",
      "speaker": 0
    },
    {
      "start": 2069.8,
      "end": 2073.1200000000003,
      "zh": "\"它就是那种在你脑室里的松软组织。\"",
      "en": "It's kind of this fluffy tissue that sits in your ventricles.",
      "speaker": 0
    },
    {
      "start": 2073.1200000000003,
      "end": 2076.96,
      "zh": "\"脑室就是你大脑里的空腔，里面有脑脊液。\"",
      "en": "The ventricles are the spaces in your brain, and the spaces in your brain have what's called cerebral spinal fluid in them.",
      "speaker": 0
    },
    {
      "start": 2075.44,
      "end": 2089.5,
      "zh": "\"脑脊液里有很多重要成分，但是脉络丛开始释放和响应这些细胞因子、炎症因子，然后大脑就会开始经历各种炎症变化，影响到神经元。\"",
      "en": "Cerebral spinal fluid contains a number of important things, but the choroid starts releasing and responding to these cytokines, inflammatory cytokines, and then the brain actually starts to experience all sorts of changes in terms of inflammation to neurons.",
      "speaker": 0
    },
    {
      "start": 2089.5,
      "end": 2091.56,
      "zh": "\"你的记忆力会变差。\"",
      "en": "Your memory tends to get poor.",
      "speaker": 0
    },
    {
      "start": 2091.56,
      "end": 2093.86,
      "zh": "\"你的认知能力会变差。\"",
      "en": "Your cognition tends to get poor.",
      "speaker": 0
    },
    {
      "start": 2093.86,
      "end": 2096.16,
      "zh": "\"这些是暂时的情况。\"",
      "en": "These are transient things.",
      "speaker": 0
    },
    {
      "start": 2096.16,
      "end": 2103.08,
      "zh": "\"通常情况下，这些症状会慢慢消失，但这时候你已经病得很厉害，感觉很糟糕了。\"",
      "en": "Most often, eventually these things will pass, but this is deep into sickness when you're really feeling lousy.",
      "speaker": 0
    },
    {
      "start": 2103.08,
      "end": 2106.66,
      "zh": "\"你没法读书，看不了电影，什么都干不了。\"",
      "en": "You can't read, you can't watch a movie, you can't do anything.",
      "speaker": 0
    },
    {
      "start": 2106.66,
      "end": 2120.5,
      "zh": "所以如果你生病了，什么都不想做，可能是因为身体有了快速反应，还有个慢一点的反应，就是大脑里有些组织在发出炎症信号，现在整个大脑都在应对或者试图应对这个感染。",
      "en": "So if you ever get sick and you just can't be bothered by anything, it's probably because you've had that fast response from the body, and you've also had this slower response where you literally have a set of tissues in your brain that are sending out these inflammatory signals, and now your whole brain is starting to cope or is trying to cope with this infection.",
      "speaker": 0
    },
    {
      "start": 2120.5,
      "end": 2123.56,
      "zh": "所以你有快反应和慢反应两种机制。",
      "en": "So you've got a slow pathway and a fast pathway.",
      "speaker": 0
    },
    {
      "start": 2123.56,
      "end": 2125.36,
      "zh": "听起来真够糟的。",
      "en": "That all sounds really terrible.",
      "speaker": 0
    },
    {
      "start": 2123.56,
      "end": 2136.1,
      "zh": "所以现在我想聊聊怎么降低生病的概率，其实从一开始感觉不舒服到生病期间，有一些方法可以加快康复速度，把情况扭转过来。",
      "en": "So now I'd like to talk about what you can do to reduce the probability of getting sick, and there are actually things that one can do as you start to get sick, and once you're sick, to accelerate the healing process by flipping the equation.",
      "speaker": 0
    },
    {
      "start": 2134.32,
      "end": 2143.28,
      "zh": "到目前为止，我们一直在聊身体怎么激活大脑某些区域，导致类似抑郁的生病行为。",
      "en": "Up until now, we've been talking about how the body activates certain areas in the brain to create sickness behavior that's very much like depression.",
      "speaker": 0
    },
    {
      "start": 2143.28,
      "end": 2147.38,
      "zh": "\"你可能感冒、流感或者受伤时都经历过这种情况。\"",
      "en": "You're probably all familiar with this from any time you've had a cold or a flu or something really lousy or an injury.",
      "speaker": 0
    },
    {
      "start": 2147.38,
      "end": 2155.32,
      "zh": "现在我们换个角度想想，怎么利用神经系统提升免疫系统功能，让我们更快地从疾病和伤痛中康复呢？",
      "en": "Now let's flip the equation and ask, what can we do with our nervous system in order to enhance the function of our immune system in order to be able to heal and recover from illness and injury more quickly?",
      "speaker": 0
    },
    {
      "start": 2155.32,
      "end": 2161.98,
      "zh": "假设有天你醒来或者回家时，喉咙有些痒，或者呼吸时鼻子感觉不太对劲。",
      "en": "So let's say you are in that unfortunate circumstance of waking up one day or coming home and you've got that tickle in your throat, or when you breathe, your nasal passages don't feel the same way.",
      "speaker": 0
    },
    {
      "start": 2161.98,
      "end": 2163.5,
      "zh": "你有点头疼。",
      "en": "You've got a little bit of a headache.",
      "speaker": 0
    },
    {
      "start": 2163.5,
      "end": 2165.04,
      "zh": "你感觉有点不对劲。",
      "en": "You're feeling kind of off.",
      "speaker": 0
    },
    {
      "start": 2165.04,
      "end": 2166.58,
      "zh": "我们都知道该怎么做。",
      "en": "We all know what we should do.",
      "speaker": 0
    },
    {
      "start": 2166.58,
      "end": 2170.1600000000003,
      "zh": "大家要多喝水，然后好好睡一觉。",
      "en": "We should all hydrate, drink some water, and go to sleep.",
      "speaker": 0
    },
    {
      "start": 2170.1600000000003,
      "end": 2174.0,
      "zh": "\"对啊，这就是大家常说的。\"",
      "en": "Right, that's what we are all told.",
      "speaker": 0
    },
    {
      "start": 2174.0,
      "end": 2180.4,
      "zh": "\"但其实有些事你可以主动去做，帮助免疫系统在感染初期更好地反应。\"",
      "en": "But there are actually things that you can actively do in order to get your immune system to deploy a more robust response at that early phase of potential infection.",
      "speaker": 0
    },
    {
      "start": 2180.4,
      "end": 2182.7,
      "zh": "\"先聊聊休息这块吧。\"",
      "en": "Let's focus first on the rest component.",
      "speaker": 0
    },
    {
      "start": 2182.7,
      "end": 2187.32,
      "zh": "\"对啊，大家都说要洗个热水澡然后睡个九十个小时。\"",
      "en": "Yes, of course, we are all told that we should take a hot shower and go to sleep, you know, and get nine or 10 hours of sleep.",
      "speaker": 0
    },
    {
      "start": 2187.32,
      "end": 2191.92,
      "zh": "\"其实可以从增强免疫系统的角度来看睡眠，很有意思。\"",
      "en": "But there's an interesting way of looking at sleep specifically for its role in enhancing the immune system.",
      "speaker": 0
    },
    {
      "start": 2190.64,
      "end": 2198.84,
      "zh": "\"有篇很棒的综述，我会放在说明里，专门研究了睡眠对免疫系统支持的不同之处。\"",
      "en": "And there's a wonderful review, I'll put the review in the captions, that looked specifically at the literature surrounding sleep that is different because it occurs in support of the immune system.",
      "speaker": 0
    },
    {
      "start": 2198.84,
      "end": 2202.68,
      "zh": "\"通常我们晚上刚入睡时，主要是慢波睡眠。\"",
      "en": "So normally when we go to sleep, we have slow wave sleep predominantly in the early phase of the night.",
      "speaker": 0
    },
    {
      "start": 2202.68,
      "end": 2207.8,
      "zh": "然后随着睡得越来越久，我们会进入更多所谓的快速眼动睡眠。",
      "en": "And then over time, as we sleep longer and longer, we get more so-called REM, rapid eye movement sleep.",
      "speaker": 0
    },
    {
      "start": 2207.8,
      "end": 2210.6,
      "zh": "\"我们在关于睡眠的节目里聊过这些。\"",
      "en": "Talked all about this on the episodes on sleep.",
      "speaker": 0
    },
    {
      "start": 2210.6,
      "end": 2217.78,
      "zh": "当然，一整晚都有慢波睡眠和快速眼动睡眠，只是它们的比例会变，这两者功能不同。",
      "en": "Of course, you have slow wave sleep and REM sleep throughout the night always, but it's the fraction of slow wave sleep to REM sleep that shifts and they have different functions, et cetera.",
      "speaker": 0
    },
    {
      "start": 2215.98,
      "end": 2233.64,
      "zh": "有证据显示，感染时的睡眠，尤其是感染早期，和大脑中血清素水平升高有关。可能是适应机制或者其他原因，大脑里所谓的Raphae核的神经元开始释放更多血清素。",
      "en": "There is some evidence that the sleep associated with an infection, in particular early stage of infection, is associated with elevated levels of serotonin in the brain that either through an adaptive mechanism or for whatever reason, the neurons in the brain of the so-called Raphae nucleus start releasing more serotonin.",
      "speaker": 0
    },
    {
      "start": 2233.64,
      "end": 2239.58,
      "zh": "\"这些血清素和相关通路可能增强免疫系统功能，帮助对抗感染。\"",
      "en": "And that that serotonin and its related pathways can help enhance some of the immune system function that could combat the infection.",
      "speaker": 0
    },
    {
      "start": 2237.8,
      "end": 2252.12,
      "zh": "\"现在有一些初步的数据，我要强调是初步，因为相关研究还不多，看看补充像5-HTP这样的血清素前体，或者吃能自然增加血清素的食物，是否有效。\"",
      "en": "There is starting to be some data, and I emphasize starting because it's not a very robust literature yet, looking at whether or not supplementing precursors to serotonin like 5-HTP, which can be taken in supplement form, or consuming foods that increase serotonin naturally.",
      "speaker": 0
    },
    {
      "start": 2252.12,
      "end": 2254.68,
      "zh": "\"所以就是含有高色氨酸的食物。\"",
      "en": "So these would be any foods that contain high levels of tryptophan.",
      "speaker": 0
    },
    {
      "start": 2254.68,
      "end": 2256.74,
      "zh": "你可以查查这些食物是什么。",
      "en": "You can look up what those are.",
      "speaker": 0
    },
    {
      "start": 2256.74,
      "end": 2261.6,
      "zh": "比如白肉火鸡，还有一些复杂碳水也富含色氨酸。",
      "en": "So white meat turkey, for instance, certain complex carbohydrates can often be rich with tryptophan.",
      "speaker": 0
    },
    {
      "start": 2261.6,
      "end": 2270.04,
      "zh": "吃这些食物可以增加大脑和血液中的血清素，从而改善睡眠质量，促进更深层次的修复。",
      "en": "That consuming those foods can enhance the amount of serotonin that's available in the brain and blood, and thereby lead to the particular quality of sleep that allows for more deep healing.",
      "speaker": 0
    },
    {
      "start": 2270.04,
      "end": 2274.66,
      "zh": "\"我说的深层修复，其实就是为了更强的免疫反应。\"",
      "en": "Or for, when I say deep healing, I mean for a more robust immune response.",
      "speaker": 0
    },
    {
      "start": 2274.66,
      "end": 2277.48,
      "zh": "\"不过，这些数据还在不断更新。\"",
      "en": "Now, again, those are still emerging data.",
      "speaker": 0
    },
    {
      "start": 2277.48,
      "end": 2287.96,
      "zh": "不过，很明显的是，在睡觉时，尤其是在任何病毒或细菌感染的早期阶段，所谓的脑淋巴系统会比平时活跃得多。",
      "en": "What is very clear, however, is that during sleep, and in particular during sleep that's associated with the early stage of any kind of viral or bacterial infection, the so-called glymphatic system is much more active than it would be normally.",
      "speaker": 0
    },
    {
      "start": 2287.96,
      "end": 2290.28,
      "zh": "\"什么是脑淋巴系统？\"",
      "en": "What's the glymphatic system?",
      "speaker": 0
    },
    {
      "start": 2290.28,
      "end": 2293.6,
      "zh": "\"脑淋巴系统其实是最近才发现的。\"",
      "en": "The glymphatic system is actually a relatively recent discovery.",
      "speaker": 0
    },
    {
      "start": 2293.6,
      "end": 2295.4,
      "zh": "\"我刚才提到过淋巴和淋巴系统。\"",
      "en": "I mentioned lymph and the lymphatic system earlier.",
      "speaker": 0
    },
    {
      "start": 2295.44,
      "end": 2303.82,
      "zh": "\"脑淋巴系统是大脑里的一个系统，可以清除白天积累的垃圾，尤其是神经炎症和身体炎症时产生的垃圾。\"",
      "en": "The glymphatic system with a G is a system in the brain by which debris that accumulates throughout the day, but in particular, debris that accumulates under conditions of neuroinflammation and inflammation of the body is cleared out or is washed out of the brain.",
      "speaker": 0
    },
    {
      "start": 2303.82,
      "end": 2308.3,
      "zh": "\"脑淋巴系统的活跃对从各种感染中恢复非常重要。\"",
      "en": "And the activity of this glymphatic system is extremely important for the recovery from infection of any kind.",
      "speaker": 0
    },
    {
      "start": 2308.3,
      "end": 2316.68,
      "zh": "\"现在已经很清楚，脑淋巴系统对脑外伤恢复很重要，甚至可能对心理创伤的恢复也有帮助。\"",
      "en": "And it's now becoming clear is important for recovery from traumatic head injury and maybe even from psychological trauma.",
      "speaker": 0
    },
    {
      "start": 2316.68,
      "end": 2325.42,
      "zh": "\"所以，脑淋巴系统有点像管道系统，贯穿脑室，还主要在大脑和颅骨之间的那层膜，以及其他一些组织中运行。\"",
      "en": "So the glymphatic system can be thought of more or less as a plumbing system that runs through the ventricles, but also mainly through the lining that sits between the brain and the skull and some of the other tissues and things of that sort.",
      "speaker": 0
    },
    {
      "start": 2325.98,
      "end": 2328.3,
      "zh": "\"脉络丛也参与其中。\"",
      "en": "The choroid is involved as well.",
      "speaker": 0
    },
    {
      "start": 2328.3,
      "end": 2333.44,
      "zh": "\"脑成像显示，脑淋巴系统在深度睡眠时特别活跃。\"",
      "en": "Brain imaging reveals the glymphatic system is very active during deep sleep.",
      "speaker": 0
    },
    {
      "start": 2333.44,
      "end": 2336.7400000000002,
      "zh": "\"还有就是淋巴系统会有种清洗作用。\"",
      "en": "And there's this kind of washout of the lymphatic system.",
      "speaker": 0
    },
    {
      "start": 2336.7400000000002,
      "end": 2351.06,
      "zh": "我知道现在有些研究正在进行，通过补充色氨酸、5-HTP，甚至直接补充血清素来增强血清素系统，这些都是实验室研究，看看能否增加脑淋巴系统的循环量。",
      "en": "And I am aware of some studies that are ongoing now where augmenting the serotonin system through either supplementation of tryptophan or 5-HTP or even serotonin itself, these are laboratory studies, is being looked at for its capacity to increase the amount of circulation in the glymphatic system.",
      "speaker": 0
    },
    {
      "start": 2351.06,
      "end": 2358.2400000000002,
      "zh": "\"这个想法是，可能会加快受伤和疾病的恢复速度，也可能增强免疫系统的活跃程度。\"",
      "en": "And the idea is that it might, and I want to underscore might, potentially lead to more rapid recovery from injury and illness and potentially ramp up, if you will, the activity of the immune system.",
      "speaker": 0
    },
    {
      "start": 2358.2400000000002,
      "end": 2361.92,
      "zh": "所以这基本上就是在增强免疫系统的活跃度。",
      "en": "So it essentially is a ramping up of the activity of the immune system.",
      "speaker": 0
    },
    {
      "start": 2361.92,
      "end": 2371.28,
      "zh": "不管你睡前是不是打算补充5-HTP，我待会儿会聊聊这个，正常情况下也有办法提高脑淋巴系统的活跃度。",
      "en": "Now, regardless of whether or not you decide to, for instance, supplement with 5-HTP before sleep or not, I'll talk about what that might look like in a moment, there is a way that you can increase the activity of your glymphatic system under normal circumstances.",
      "speaker": 0
    },
    {
      "start": 2371.28,
      "end": 2385.4,
      "zh": "因为脑淋巴系统的运作机制，结果发现如果你睡觉时把脚抬高个12度左右，不一定非得是12度，可以在脚下垫个卷枕头或两个枕头，把头放在腿下，这样睡觉时好像能增加脑淋巴的清洗效果。",
      "en": "Because of the mechanics of the glymphatic system, it turns out that if you elevate your heels by about 12 degrees, it doesn't have to be exactly 12, as you sleep by putting maybe a rolled pillow or two pillows underneath your feet, by having the head below your legs, it seems that there's more glymphatic washout or clearance during sleep.",
      "speaker": 0
    },
    {
      "start": 2387.64,
      "end": 2391.44,
      "zh": "\"而且这不需要吃任何东西来调整血清素系统。\"",
      "en": "And this is without taking any compound to adjust the serotonin system.",
      "speaker": 0
    },
    {
      "start": 2391.44,
      "end": 2401.38,
      "zh": "所以我会说，如果你感觉不舒服，去洗个热水澡，然后上床睡觉，但记得抬高双脚，试试增加脑淋巴系统的活跃度。",
      "en": "So I would say, if you're not feeling well, yes, take the hot shower, yes, get into bed and go to sleep, but elevate your feet to try and increase the activity of the glymphatic system.",
      "speaker": 0
    },
    {
      "start": 2401.38,
      "end": 2406.7000000000003,
      "zh": "有些人甚至觉得，如果非得醒着，那可能也想让脚高于头。",
      "en": "Some might even consider that if you have to be awake, that you might want to be awake with your feet elevated above your head.",
      "speaker": 0
    },
    {
      "start": 2406.7000000000003,
      "end": 2413.42,
      "zh": "\"这可能不太适合在工作场合，但白天小憩一下或者类似情况倒是可以试试。\"",
      "en": "Now that might not be practical for the workplace, but it might be practical for a short nap during the day or something of that sort.",
      "speaker": 0
    },
    {
      "start": 2413.84,
      "end": 2419.38,
      "zh": "脑淋巴系统不仅在睡觉时活跃，在我们特别放松的时候醒着也会活跃。",
      "en": "The glymphatic system is not just active during sleep, it's also active during certain phases of waking in particular, when we are in a deep state of relaxation.",
      "speaker": 0
    },
    {
      "start": 2418.1,
      "end": 2426.34,
      "zh": "很多人可能知道，我挺推崇自我催眠的，因为有很多高质量的科学研究支持。",
      "en": "So as many of you probably know, I'm a big proponent of self-hypnosis because of the quality scientific literature on this.",
      "speaker": 0
    },
    {
      "start": 2426.34,
      "end": 2432.7000000000003,
      "zh": "如果你对自我催眠感兴趣，可以去Reveri，R-E-V-E-R-I.com看看。",
      "en": "If you're interested in self-hypnosis, you can go to Reveri, R-E-V-E-R-I.com.",
      "speaker": 0
    },
    {
      "start": 2432.7000000000003,
      "end": 2448.4,
      "zh": "Reveri 是个免费的苹果和安卓应用，由我在斯坦福医学院的同事 David Spiegel 和其他人开发，基于优质研究和同行评审的数据，显示深度放松状态可以帮助缓解疼痛、改善入睡时间和其他一些方面。",
      "en": "Reveri is a cost-free app for Apple and Android that was developed by my colleague, David Spiegel and others at the Stanford University School of Medicine based on quality studies and peer reviewed data, showing that deep states of relaxation can be used to improve pain management, improve transition time to sleep and a number of other things.",
      "speaker": 0
    },
    {
      "start": 2448.4,
      "end": 2451.1800000000003,
      "zh": "你可以用Reveri选择你想要的效果。",
      "en": "You can select the various sort of outcomes that you're seeking using Reveri.",
      "speaker": 0
    },
    {
      "start": 2451.1800000000003,
      "end": 2458.54,
      "zh": "对于那些觉得冥想有难度的人来说，这挺好的，因为只需要听着引导，就能进入深度放松状态。",
      "en": "It's a great thing that, especially for people that are challenged with meditation could use because you just listen to the script, involves deep relaxation.",
      "speaker": 0
    },
    {
      "start": 2458.54,
      "end": 2465.84,
      "zh": "我建议你用那个放松或睡眠的引导，但把脚抬高，能促进大脑清理废物的系统活动。",
      "en": "I would suggest using that script or the script for sleep, but with feet elevated to increase activity of the glymphatic system.",
      "speaker": 0
    },
    {
      "start": 2465.84,
      "end": 2470.2000000000003,
      "zh": "\"如果你想自己试试这个血清素假说，记得先问医生。\"",
      "en": "Now, if you do decide that you want to test out this serotonin hypothesis on your own, obviously check with a doctor.",
      "speaker": 0
    },
    {
      "start": 2470.2000000000003,
      "end": 2472.6800000000003,
      "zh": "“我不是医生，我是教授。”",
      "en": "I'm not a doctor, I'm a professor.",
      "speaker": 0
    },
    {
      "start": 2472.6800000000003,
      "end": 2475.4,
      "zh": "所以我是分享知识，不是给建议。",
      "en": "So I'm professing things, not suggesting things.",
      "speaker": 0
    },
    {
      "start": 2474.66,
      "end": 2491.62,
      "zh": "“但是5-HTP这个补充剂，我之前在播客里提过，我其实不建议大多数人用来改善睡眠，因为它可能会打乱正常的睡眠结构，导致晚上早期进入深度睡眠，然后突然醒来，很难再入睡。”",
      "en": "But 5-HTP is a supplement that I've talked about before on this podcast that I actually do not recommend for most people for sake of sleep because it can disrupt the normal architecture of sleep and create a deep sleep early in the night and then a spontaneous waking with some trouble to get back to sleep.",
      "speaker": 0
    },
    {
      "start": 2491.62,
      "end": 2495.7200000000003,
      "zh": "\"这是因为血清素系统和褪黑素系统的相互作用。\"",
      "en": "And that's because of the way that the serotonin system and the melatonin system interact.",
      "speaker": 0
    },
    {
      "start": 2495.7200000000003,
      "end": 2505.4,
      "zh": "不过，如果你觉得自己可能感染了或者刚生病，这种情况下，5-HTP可能有用，能帮助进入一些不太常见的睡眠状态。",
      "en": "However, under conditions where one is feeling like they might have an infection or an early stage of illness, in that case, 5-HTP might be a useful supplement in order to access these states of sleep that are not typical.",
      "speaker": 0
    },
    {
      "start": 2505.42,
      "end": 2508.98,
      "zh": "\"那不是你健康时能达到的正常深度睡眠。\"",
      "en": "They're not the typical deep sleep that you would achieve on when you're feeling healthy.",
      "speaker": 0
    },
    {
      "start": 2508.98,
      "end": 2513.04,
      "zh": "这些睡眠状态主要是为了修复免疫系统相关的炎症。",
      "en": "These are states of sleep that are specifically there in order to try and repair some of the immune system related inflammation that's occurring.",
      "speaker": 0
    },
    {
      "start": 2513.04,
      "end": 2523.38,
      "zh": "如果你想试试5-HTP，而且觉得适合自己，也跟医生聊过，那就可以在睡前30到60分钟服用300到500毫克。",
      "en": "If you'd like to explore the 5-HTP approach and you feel it's right and safe for you and you've talked to your doctor, it's 300 to 500 milligrams taken about 30 to 60 minutes before going to sleep for the night.",
      "speaker": 0
    },
    {
      "start": 2523.38,
      "end": 2525.42,
      "zh": "\"这就是一般的方法。\"",
      "en": "That's the typical protocol.",
      "speaker": 0
    },
    {
      "start": 2525.42,
      "end": 2530.96,
      "zh": "\"顺便说一下，提高血清素也是治疗重度抑郁症的常用方法。\"",
      "en": "Not incidentally, increasing serotonin is also one typical approach for the treatment of major depression.",
      "speaker": 0
    },
    {
      "start": 2530.96,
      "end": 2537.86,
      "zh": "这就是像Prozac和Zoloft这样的SSRI，也就是选择性血清素再摄取抑制剂的基础。",
      "en": "This is the basis for things like SSRIs, selective serotonin reuptake inhibitors, like Prozac and Zoloft and so forth.",
      "speaker": 0
    },
    {
      "start": 2537.86,
      "end": 2544.62,
      "zh": "\"当然，5-HT这种方法比处方药温和多了，但能促进血清素的合成和释放。\"",
      "en": "The 5-HT approach is a much milder approach than prescription drug, of course, but will allow more serotonin to be synthesized and or released.",
      "speaker": 0
    },
    {
      "start": 2544.62,
      "end": 2553.76,
      "zh": "对了，如果你对学习更多关于脑脊液系统感兴趣，这个系统挺有意思的。你可能想深入了解一下它的行为模式和已知信息。",
      "en": "Now, for those of you that are interested in learning more about the glymphatic system, it's a fascinating system and you might want to do a deep dive there in terms of the behavioral protocols and what's known about it.",
      "speaker": 0
    },
    {
      "start": 2553.76,
      "end": 2557.56,
      "zh": "有篇不错的文章叫《脑淋巴系统入门指南》。",
      "en": "There's a wonderful article called The Glymphatic System, A Beginner's Guide.",
      "speaker": 0
    },
    {
      "start": 2557.56,
      "end": 2559.5,
      "zh": "这是一篇科学文章。",
      "en": "This is a scientific article.",
      "speaker": 0
    },
    {
      "start": 2559.5,
      "end": 2561.08,
      "zh": "第一作者姓Jessen，J-E-S-S-E-N。",
      "en": "The first author is Jessen, is the last name, J-E-S-S-E-N.",
      "speaker": 0
    },
    {
      "start": 2561.76,
      "end": 2568.02,
      "zh": "你只要在网上搜Jessen，《脑淋巴系统入门指南》，就能轻松找到完整的文章。",
      "en": "If you put in Jessen, The Glymphatic System, A Beginner's Guide, you can access the full-length manuscript easily online.",
      "speaker": 0
    },
    {
      "start": 2568.02,
      "end": 2569.96,
      "zh": "一搜就能马上找到。",
      "en": "It'll show up immediately in your search.",
      "speaker": 0
    },
    {
      "start": 2569.96,
      "end": 2575.5,
      "zh": "而且很有意思的是，脑淋巴系统现在也和铁沉积系统有联系了。",
      "en": "And in a really interesting way, the glymphatic system has now also been tied to the iron deposition system.",
      "speaker": 0
    },
    {
      "start": 2575.5,
      "end": 2577.4,
      "zh": "之前我们聊到铁的问题。",
      "en": "Earlier, we were talking about iron and how.",
      "speaker": 0
    },
    {
      "start": 2577.4,
      "end": 2582.46,
      "zh": "铁摄入够当然重要，但如果铁含量太高，就有很多问题。",
      "en": "Of course, getting enough dietary iron is important, but if levels of iron are too high, it isn't good for a number of reasons.",
      "speaker": 0
    },
    {
      "start": 2582.46,
      "end": 2589.46,
      "zh": "有篇去年出的有趣文章，说大脑淋巴系统功能失调可能跟正常衰老时铁沉积有关。",
      "en": "There's a very interesting article that just came out last year called dysfunction of the glymphatic system might be related to iron deposition in the normal aging brain.",
      "speaker": 0
    },
    {
      "start": 2589.46,
      "end": 2601.28,
      "zh": "所以我们开始发现，铁含量过高、大脑淋巴系统不够活跃，这些可能导致生病行为、炎症，甚至可能跟衰老相关的神经元损伤。",
      "en": "So we're starting to see these links between iron levels being too high, the glymphatic system not being active enough, and so forth leading to sickness behavior, inflammation, and maybe even damage to neurons associated with aging.",
      "speaker": 0
    },
    {
      "start": 2601.28,
      "end": 2617.28,
      "zh": "我们可以反过来说，增加大脑淋巴系统的活跃度，比如深睡时抬高双脚，甚至在清醒时抬脚高过头部，或者每天小憩时做个冥想练习，这些都可能提高大脑淋巴系统的活跃度。",
      "en": "We can flip that on its head and say that increasing the activity of the glymphatic system, feet elevated during deep sleep, maybe even feet elevated above the head while awake, during a nap, or doing a reverie script once a day or something of that sort could increase the activity of the glymphatic system.",
      "speaker": 0
    },
    {
      "start": 2617.28,
      "end": 2624.14,
      "zh": "降低铁摄入到可能低于感染期的典型摄入量，可能会增强大脑淋巴系统的活跃度，反之亦然。",
      "en": "Lowering iron to a point that's probably below the typical intake during periods of infection, perhaps, perhaps, I should say, can enhance the glymphatic system and vice versa.",
      "speaker": 0
    },
    {
      "start": 2624.42,
      "end": 2634.78,
      "zh": "然后，有种跟生病行为相关的特殊睡眠，似乎有更高的血清素水平，可能通过摄入5-HTP来增强。",
      "en": "And then you've got this specialized sleep that's related to sickness behavior that seems to have heightened levels of serotonin that might be augmented by increasing, excuse me, that might be augmented by ingesting 5-HTP.",
      "speaker": 0
    },
    {
      "start": 2634.78,
      "end": 2637.1600000000003,
      "zh": "\"当然，这不是每天都要做的。\"",
      "en": "Again, not on a regular basis.",
      "speaker": 0
    },
    {
      "start": 2637.1600000000003,
      "end": 2651.2000000000003,
      "zh": "我不建议大家随便吃提升血清素的东西，除非是医生给你开的治抑郁症的药。平时不要经常补充色氨酸或5-HTP，只有在你感觉开始生病，或者感染的时候才考虑。",
      "en": "I don't suggest that people take compounds that increase serotonin unless it's prescribed to you for depression or something, but not doing it by supplement with tryptophan or 5-HTP on a regular basis, but only under conditions where, as I mentioned, you might be starting to feel sick or you're coming down with something or you're combating some sort of infection.",
      "speaker": 0
    },
    {
      "start": 2648.9,
      "end": 2663.2200000000003,
      "zh": "所以啊，当我们不舒服时，通常会被建议去洗个热水澡，然后躺床上睡觉。我们刚刚也聊了怎么通过大脑淋巴系统和血清素系统来提高睡眠效果。",
      "en": "So if we consider the advice that we typically get when we're not feeling well of take a hot shower, get into bed and go to sleep, and we've now touched on ways to potentially increase the efficacy of the sleep part through the glymphatic and the serotonin system.",
      "speaker": 0
    },
    {
      "start": 2663.2200000000003,
      "end": 2664.38,
      "zh": "“那洗热水澡呢？”",
      "en": "What about the take a hot shower part?",
      "speaker": 0
    },
    {
      "start": 2664.38,
      "end": 2666.2400000000002,
      "zh": "\"这样建议靠谱吗？\"",
      "en": "Is that good advice?",
      "speaker": 0
    },
    {
      "start": 2666.2400000000002,
      "end": 2670.08,
      "zh": "\"其实这是靠谱的，而且还有更好的方法。\"",
      "en": "Well, it turns out it is, and there's actually a way to do even better.",
      "speaker": 0
    },
    {
      "start": 2670.08,
      "end": 2672.6000000000004,
      "zh": "有个研究，挺有意思的。",
      "en": "There's a study, very interesting study.",
      "speaker": 0
    },
    {
      "start": 2672.6000000000004,
      "end": 2675.2400000000002,
      "zh": "\"我接下来想说的都在标题里了。\"",
      "en": "The title reveals where I'm going with this.",
      "speaker": 0
    },
    {
      "start": 2675.2400000000002,
      "end": 2679.44,
      "zh": "\"一次芬兰桑拿对白细胞和皮质醇水平的影响。\"",
      "en": "It's effect of a single finish sauna session on white blood cell profile and cortisol levels.",
      "speaker": 0
    },
    {
      "start": 2679.44,
      "end": 2683.98,
      "zh": "这次研究是针对运动员和非运动员做的，挺不错的。",
      "en": "In this case, it was done in athletes and non-athletes, which is kind of nice.",
      "speaker": 0
    },
    {
      "start": 2683.98,
      "end": 2686.98,
      "zh": "就是让运动员和非运动员去蒸桑拿。",
      "en": "This involves taking athletes and non-athletes and exposing them to sauna.",
      "speaker": 0
    },
    {
      "start": 2686.98,
      "end": 2687.96,
      "zh": "没那么热。",
      "en": "It wasn't particularly hot.",
      "speaker": 0
    },
    {
      "start": 2687.96,
      "end": 2691.04,
      "zh": "\"96度，不算凉，但也不算特别热。\"",
      "en": "It was 96 degrees, which isn't cool, but it's not really hot.",
      "speaker": 0
    },
    {
      "start": 2691.04,
      "end": 2694.18,
      "zh": "现在很多人都在蒸特别热的桑拿。",
      "en": "Nowadays you hear about people doing very, very hot sauna.",
      "speaker": 0
    },
    {
      "start": 2694.18,
      "end": 2697.16,
      "zh": "桑拿的湿度大概是15%左右。",
      "en": "The humidity of the sauna, if you want to know, is 15 plus or minus 3%.",
      "speaker": 0
    },
    {
      "start": 2697.16,
      "end": 2704.76,
      "zh": "\"他们发现，只要蒸15分钟桑拿，就能提高白细胞水平，还能调节皮质醇，有助于对抗感染。\"",
      "en": "But basically what they found was that just one 15 minute sauna session could really increase white blood cell profiles and could adjust cortisol levels in ways that were beneficial for combating infection.",
      "speaker": 0
    },
    {
      "start": 2704.76,
      "end": 2707.6,
      "zh": "\"现在还有很多类似的研究。\"",
      "en": "And now there are many other studies like this.",
      "speaker": 0
    },
    {
      "start": 2707.6,
      "end": 2711.7400000000002,
      "zh": "听完之前关于发烧的内容，这应该很好理解。",
      "en": "Now this should immediately make sense based on what we said before about fever.",
      "speaker": 0
    },
    {
      "start": 2711.7400000000002,
      "end": 2713.8,
      "zh": "\"升温其实能帮忙对抗感染。\"",
      "en": "Heating up can actually help combat infection.",
      "speaker": 0
    },
    {
      "start": 2713.98,
      "end": 2721.46,
      "zh": "\"不过听过温度那几期的朋友应该知道，进桑拿或任何热环境时，身体会努力给自己降温。\"",
      "en": "But for those of you that have listened to the episodes on temperature, what you probably know is that when you get into a sauna or any kind of hot environment, your body is also going to be actively pushing to cool itself off.",
      "speaker": 0
    },
    {
      "start": 2721.46,
      "end": 2723.7,
      "zh": "所以可能会有温度升高。",
      "en": "So there's probably an increase in heat.",
      "speaker": 0
    },
    {
      "start": 2723.7,
      "end": 2728.68,
      "zh": "\"温度上升后，身体会降温，甚至可能低于原来的水平。\"",
      "en": "There is an increase in heating, that then afterwards your body will cool off, maybe even with a dip below baseline.",
      "speaker": 0
    },
    {
      "start": 2728.68,
      "end": 2737.14,
      "zh": "\"要提醒一下，如果你已经发烧了，进桑拿可能会让体温升得太高，严重的话可能会损伤神经元。\"",
      "en": "I do want to provide a cautionary note that if you are already running a fever, getting into a sauna could take your body temperature into dangerously high levels, dangerously meaning you can kill neurons.",
      "speaker": 0
    },
    {
      "start": 2737.14,
      "end": 2740.48,
      "zh": "\"神经元一旦死了，就不会再生了。\"",
      "en": "And once you kill neurons, they do not come back.",
      "speaker": 0
    },
    {
      "start": 2740.48,
      "end": 2743.28,
      "zh": "所以千万别让你的神经元受损。",
      "en": "So please don't kill your neurons.",
      "speaker": 0
    },
    {
      "start": 2743.28,
      "end": 2746.98,
      "zh": "\"如果你已经发烧了，我不建议进桑拿。\"",
      "en": "I don't recommend getting into a sauna if you're already running a fever.",
      "speaker": 0
    },
    {
      "start": 2746.98,
      "end": 2751.32,
      "zh": "所以这个适合在感染初期或者感觉不太对劲的时候做。",
      "en": "So this would be something to do at the initial stage of an infection or if you're feeling a little bit off.",
      "speaker": 0
    },
    {
      "start": 2751.32,
      "end": 2756.54,
      "zh": "所以这有点像升级版的建议，除了泡个热水澡还要赶紧上床休息。",
      "en": "So this is kind of a ramping up or a super protocol of the typical advice of take a hot shower and get into bed.",
      "speaker": 0
    },
    {
      "start": 2756.54,
      "end": 2757.8,
      "zh": "这建议不错。",
      "en": "That is good advice.",
      "speaker": 0
    },
    {
      "start": 2756.54,
      "end": 2764.16,
      "zh": "现在我们聊的是蒸桑拿，冲个澡然后上床休息，可能还可以增加一点血清素。",
      "en": "Now we're talking about a hot sauna, probably showering off and then getting into bed, maybe augmenting serotonin.",
      "speaker": 0
    },
    {
      "start": 2764.16,
      "end": 2766.62,
      "zh": "\"我知道很多人没法用桑拿。\"",
      "en": "I know many people don't have access to sauna.",
      "speaker": 0
    },
    {
      "start": 2766.62,
      "end": 2775.42,
      "zh": "\"所以这种情况下，泡个热水澡或者冲个热水澡，别烫着自己，水温尽量热一点，差不多到你能忍受的极限就行。\"",
      "en": "So in that case, a very hot bath or shower, don't scald yourself of course, but as hot as you can comfortably tolerate or right at that edge of what you can tolerate would be a good idea.",
      "speaker": 0
    },
    {
      "start": 2775.42,
      "end": 2781.1000000000004,
      "zh": "\"我听说有些人在浴室里放热水制造很多蒸汽，变成简易桑拿。\"",
      "en": "Some people I've heard are creating saunas in their bathrooms by running hot water and creating a ton of steam.",
      "speaker": 0
    },
    {
      "start": 2781.1000000000004,
      "end": 2785.34,
      "zh": "\"任何能让你暖和起来但不过热的方法都有好处。\"",
      "en": "Anything that really heats you up, but not to dangerously high levels is going to be beneficial.",
      "speaker": 0
    },
    {
      "start": 2785.34,
      "end": 2788.48,
      "zh": "\"如果你能用桑拿，那就太好了。\"",
      "en": "If you have access to a sauna, terrific.",
      "speaker": 0
    },
    {
      "start": 2788.48,
      "end": 2790.2200000000003,
      "zh": "\"这也就15分钟。\"",
      "en": "This again was only 15 minutes.",
      "speaker": 0
    },
    {
      "start": 2790.2200000000003,
      "end": 2792.36,
      "zh": "\"他们有个冷却的时间。\"",
      "en": "They'd had a cool off session.",
      "speaker": 0
    },
    {
      "start": 2792.36,
      "end": 2794.5400000000004,
      "zh": "\"这样效果会更好吗？\"",
      "en": "Would you get more of an increase?",
      "speaker": 0
    },
    {
      "start": 2794.5400000000004,
      "end": 2798.88,
      "zh": "\"大家总想知道，如果做两次，效果会不会翻倍？\"",
      "en": "People always want to know if you did it twice as much, would you get twice the increase?",
      "speaker": 0
    },
    {
      "start": 2798.88,
      "end": 2800.82,
      "zh": "\"那些数据还没出来呢。\"",
      "en": "Those data don't really exist yet.",
      "speaker": 0
    },
    {
      "start": 2800.82,
      "end": 2805.5600000000004,
      "zh": "\"不过，如果你想最大化桑拿效果，冷却时间很重要。\"",
      "en": "However, if you are interested in maximizing the effects of sauna, it is clear that a cool off period is important.",
      "speaker": 0
    },
    {
      "start": 2805.5600000000004,
      "end": 2809.84,
      "zh": "\"所以不是说蒸15分钟好，蒸30分钟更好。\"",
      "en": "So it's not that a 15 minute sauna is good and a 30 minute sauna is better.",
      "speaker": 0
    },
    {
      "start": 2808.3,
      "end": 2817.6600000000003,
      "zh": "\"如果你想多尝试一下，15分钟加热，然后冷却5到10分钟，再回到蒸桑拿，可能会有好处。\"",
      "en": "If you are going to take that route of exploring more, it does seem that doing a 15 minute heating period followed by a five to 10 minute cooling period and then getting back into the heat can be beneficial.",
      "speaker": 0
    },
    {
      "start": 2817.6600000000003,
      "end": 2819.6000000000004,
      "zh": "\"这挺有意思的。\"",
      "en": "And this is interesting.",
      "speaker": 0
    },
    {
      "start": 2819.6000000000004,
      "end": 2822.6800000000003,
      "zh": "\"这涉及到下丘脑是怎么让身体升温的。\"",
      "en": "It gets to the mechanisms by which the hypothalamus, that areas, the areas of the hypothalamus, that is that generate increases in body heat.",
      "speaker": 0
    },
    {
      "start": 2822.6800000000003,
      "end": 2825.96,
      "zh": "\"当你升温时，那些神经元就会被激活。\"",
      "en": "The activation of those neurons occurs as you heat up.",
      "speaker": 0
    },
    {
      "start": 2825.96,
      "end": 2832.42,
      "zh": "\"如果你一直待在热环境里，那些神经元反而会关闭，换成其他神经元来负责了。\"",
      "en": "And then were you to just stay in that heated environment, they would actually shut off and some other neurons would be handling the job, so to speak.",
      "speaker": 0
    },
    {
      "start": 2833.16,
      "end": 2840.3599999999997,
      "zh": "\"但是通过进出热环境，你其实是让这个系统不断给身体发送降低皮质醇和刺激白细胞的信号。\"",
      "en": "But by getting in and out of the heated environment, you actually force that system to send repeated pulses of these cortisol lowering and white cell stimulating signals to the body.",
      "speaker": 0
    },
    {
      "start": 2840.3599999999997,
      "end": 2845.58,
      "zh": "\"有些人可能听过这句话，发烧要多吃，感冒要少吃。\"",
      "en": "Some of you have probably heard the phrase, feed a fever, starve a cold.",
      "speaker": 0
    },
    {
      "start": 2845.58,
      "end": 2848.06,
      "zh": "\"我也不知道是谁先说的。\"",
      "en": "I don't know who first said that.",
      "speaker": 0
    },
    {
      "start": 2848.06,
      "end": 2851.62,
      "zh": "\"我没找到出处，但我们都听过这个说法。\"",
      "en": "I couldn't find the citation, but we hear this.",
      "speaker": 0
    },
    {
      "start": 2851.62,
      "end": 2860.02,
      "zh": "\"我们可以猜测，这句话之所以流行，是因为发烧其实有适应功能，体温升高让病毒和细菌更难存活。\"",
      "en": "And we can speculate that the reason that phrase feed a fever, starve a cold came to be, is because of the adaptive function of fever that increases in body temperature, make it challenging for intruding viruses and bacteria to survive.",
      "speaker": 0
    },
    {
      "start": 2860.02,
      "end": 2863.14,
      "zh": "\"当然，体温太高对人是有危险的。\"",
      "en": "Even though of course, highly elevated body temperatures pose a danger to the host organism, to you.",
      "speaker": 0
    },
    {
      "start": 2863.16,
      "end": 2868.02,
      "zh": "吃东西确实会让体温升高，这就是食物的热效应。",
      "en": "Feeding, eating does cause an increase in body temperature through the so-called thermogenic effect of food.",
      "speaker": 0
    },
    {
      "start": 2868.02,
      "end": 2871.3999999999996,
      "zh": "所以我能理解“发烧要吃东西”的道理。",
      "en": "So I can understand the logic of feed a fever.",
      "speaker": 0
    },
    {
      "start": 2871.3999999999996,
      "end": 2875.74,
      "zh": "就是说，发烧时身体是想通过升温来消灭入侵的东西。",
      "en": "It would mean that when you have a fever, it's your body's natural attempt to heat up and kill some invading thing.",
      "speaker": 0
    },
    {
      "start": 2875.74,
      "end": 2878.42,
      "zh": "吃东西会让体温再升高。",
      "en": "And by eating, you would further increase your body temperature.",
      "speaker": 0
    },
    {
      "start": 2878.42,
      "end": 2882.18,
      "zh": "\"不过，为什么感冒要饿着，我就不太明白了。\"",
      "en": "Why you would want to starve a cold, I don't know, however.",
      "speaker": 0
    },
    {
      "start": 2882.18,
      "end": 2886.7,
      "zh": "\"可能是因为鼻子堵住了，吃东西不舒服之类的原因吧。\"",
      "en": "Maybe it's because when your nasal passages are congested, it's uncomfortable to eat or something of that sort.",
      "speaker": 0
    },
    {
      "start": 2886.7,
      "end": 2892.5,
      "zh": "“所以发烧要吃东西我能理解，但感冒要饿着我还是不太明白。”",
      "en": "So the feed a fever part makes sense to me, that the starve a cold part is still mysterious to me.",
      "speaker": 0
    },
    {
      "start": 2893.16,
      "end": 2894.8199999999997,
      "zh": "\"我找不到这样做有啥好处。\"",
      "en": "I couldn't find any logical reason why that would be good.",
      "speaker": 0
    },
    {
      "start": 2894.8199999999997,
      "end": 2898.1,
      "zh": "\"有些人觉得禁食能对抗某些感染。\"",
      "en": "There are communities out there that believe that fasting is a viable way to combat certain types of infection.",
      "speaker": 0
    },
    {
      "start": 2898.1,
      "end": 2903.1,
      "zh": "\"特别是长时间不吃东西，会增加大脑和身体里的肾上腺素。\"",
      "en": "Fasting, in particular, prolonged fast do increase the amount of adrenaline, also called epinephrine in the brain and body.",
      "speaker": 0
    },
    {
      "start": 2903.1,
      "end": 2910.24,
      "zh": "\"接下来我们会解释，肾上腺素对各种炎症因子和整个免疫系统确实有很大影响。\"",
      "en": "And as we'll next explain, epinephrine, adrenaline, does have a powerful effect on the various inflammatory cytokines and on the immune system in general.",
      "speaker": 0
    },
    {
      "start": 2910.24,
      "end": 2913.56,
      "zh": "\"那我们来聊聊一个大家都能用的行为方法。\"",
      "en": "So let's talk about a behavioral protocol that anyone can use.",
      "speaker": 0
    },
    {
      "start": 2913.56,
      "end": 2915.42,
      "zh": "\"这个不需要任何设备。\"",
      "en": "It doesn't involve any equipment.",
      "speaker": 0
    },
    {
      "start": 2915.42,
      "end": 2917.06,
      "zh": "\"你不用桑拿。\"",
      "en": "You don't need a sauna.",
      "speaker": 0
    },
    {
      "start": 2917.06,
      "end": 2925.2999999999997,
      "zh": "\"你完全不需要任何设备，已有优秀的研究证明，这可以显著增强免疫系统功能，帮助人们对抗感染。\"",
      "en": "You don't need anything at all that has been demonstrated in excellent peer-reviewed research to enhance the function of the immune system and actually allow people to combat infection in very dramatic ways.",
      "speaker": 0
    },
    {
      "start": 2923.7,
      "end": 2939.2999999999997,
      "zh": "\"接下来，我想深入分析一项很有名的研究，不仅在科学文献中，在网上也很火，因为它涉及到特定的呼吸方式如何影响免疫系统和对抗感染的能力。\"",
      "en": "Next, I'd like to do an in-depth analysis of a study that has achieved some prominence out there, not just in the scientific literature, but on the internet, because it relates to how particular types of breathing can impact the immune system and the ability to combat infection.",
      "speaker": 0
    },
    {
      "start": 2939.2999999999997,
      "end": 2945.24,
      "zh": "这篇论文的标题是《自愿激活交感神经系统和减弱人体先天免疫反应》。",
      "en": "The title of this paper is Voluntary Activation of the Sympathetic Nervous System and Attenuation of the Innate Immune Response in Humans.",
      "speaker": 0
    },
    {
      "start": 2945.24,
      "end": 2950.06,
      "zh": "\"这篇论文发表在PNAS，也就是美国国家科学院院刊。\"",
      "en": "This is a paper that was published in PNAS, which is the Proceedings of the National Academy of Sciences, USA.",
      "speaker": 0
    },
    {
      "start": 2950.06,
      "end": 2952.2999999999997,
      "zh": "这是本很有名的期刊。",
      "en": "It's a very prestigious journal.",
      "speaker": 0
    },
    {
      "start": 2952.2999999999997,
      "end": 2958.92,
      "zh": "如果你知道PNAS，你就会知道，以前有些论文在PNAS发表是没有经过同行评审的。",
      "en": "For those of you that know PNAS, you know that there are certain papers published in PNAS where there used to be that were not peer-reviewed.",
      "speaker": 0
    },
    {
      "start": 2958.92,
      "end": 2963.06,
      "zh": "最近几年，我觉得他们都改成同行评审的论文了。",
      "en": "In recent years, I think all of them have moved to peer-reviewed papers.",
      "speaker": 0
    },
    {
      "start": 2963.06,
      "end": 2966.6,
      "zh": "所以这是一项经过同行评审的高质量研究。",
      "en": "So this is a peer-reviewed, very high-quality study.",
      "speaker": 0
    },
    {
      "start": 2966.6,
      "end": 2969.8199999999997,
      "zh": "我想简单说一下这项研究的基本内容。",
      "en": "And I just want to describe the basic contour of the study.",
      "speaker": 0
    },
    {
      "start": 2969.8199999999997,
      "end": 2977.06,
      "zh": "我先说下研究结果，然后再深入聊聊这些结果背后的机制，还有我们能从中借鉴的流程。",
      "en": "I'll explain the findings, and then I want to go in-depth and explain the mechanistic basis for these findings and the protocol that we can all export from these findings.",
      "speaker": 0
    },
    {
      "start": 2977.06,
      "end": 2978.7799999999997,
      "zh": "\"那我们开始吧。\"",
      "en": "So here we go.",
      "speaker": 0
    },
    {
      "start": 2978.7799999999997,
      "end": 2983.0,
      "zh": "\"首先，先解释几个术语，大家有个共同的基础。\"",
      "en": "First of all, a couple of terms so that everybody is on the same page.",
      "speaker": 0
    },
    {
      "start": 2983.0,
      "end": 2987.14,
      "zh": "交感神经系统是我们神经系统的一部分。",
      "en": "The sympathetic nervous system is one division of our nervous system.",
      "speaker": 0
    },
    {
      "start": 2987.14,
      "end": 2992.86,
      "zh": "\"它是脊髓和大脑中间的一组神经元，通常会让我们更兴奋和警觉。\"",
      "en": "It's a set of neurons down the middle of our spinal cord and in our brain that generally lead to a heightened state of arousal and alertness.",
      "speaker": 0
    },
    {
      "start": 2992.86,
      "end": 2997.78,
      "zh": "和大脑释放肾上腺素有关，也和身体释放肾上腺素有关。",
      "en": "It's associated with epinephrine release in the brain and adrenaline release in the body.",
      "speaker": 0
    },
    {
      "start": 2997.78,
      "end": 3006.06,
      "zh": "就是说，当我们高度紧张时，它就是所谓的战斗或逃跑系统，但平时清醒时也是它在起作用。",
      "en": "It's the so-called fight-or-flight system when it's really active, but it's the system that's active when we are wide awake.",
      "speaker": 0
    },
    {
      "start": 3006.06,
      "end": 3008.9,
      "zh": "我们之前聊过先天免疫系统。",
      "en": "And we already talked about the innate immune system.",
      "speaker": 0
    },
    {
      "start": 3008.9,
      "end": 3014.92,
      "zh": "\"就是皮肤屏障之后的第一道防线，感染进来时，身体会迅速增加炎症来应对。\"",
      "en": "That's that first line of defense after the skin barrier, of course, whereby some infection comes into the body and there's this rapid response of increasing inflammation.",
      "speaker": 0
    },
    {
      "start": 3014.92,
      "end": 3017.76,
      "zh": "\"这也是你开始觉得不舒服的时候。\"",
      "en": "And that's also about the time that you first feel lousy.",
      "speaker": 0
    },
    {
      "start": 3017.76,
      "end": 3021.1600000000003,
      "zh": "\"所以当你开始觉得，哎，我好像生病了。\"",
      "en": "So when you start to feel like, oh, I think I've got something.",
      "speaker": 0
    },
    {
      "start": 3021.1600000000003,
      "end": 3023.1200000000003,
      "zh": "\"我感觉不太对劲。\"",
      "en": "I don't feel right.",
      "speaker": 0
    },
    {
      "start": 3023.1200000000003,
      "end": 3024.32,
      "zh": "我头疼。",
      "en": "I have a headache.",
      "speaker": 0
    },
    {
      "start": 3024.32,
      "end": 3025.6800000000003,
      "zh": "我感觉恶心。",
      "en": "I feel nauseous.",
      "speaker": 0
    },
    {
      "start": 3025.6800000000003,
      "end": 3026.82,
      "zh": "我发烧了。",
      "en": "I'm heating up.",
      "speaker": 0
    },
    {
      "start": 3026.82,
      "end": 3027.84,
      "zh": "我不舒服。",
      "en": "I don't feel good.",
      "speaker": 0
    },
    {
      "start": 3027.84,
      "end": 3030.08,
      "zh": "\"这是免疫系统在起作用。\"",
      "en": "That's the innate immune system kicking in.",
      "speaker": 0
    },
    {
      "start": 3030.08,
      "end": 3036.84,
      "zh": "\"他们在这个研究中做了什么呢，哦对了，第一作者是Cox，最后一个作者是Pickers。\"",
      "en": "So what they did in this study, and by the way, I should say they, this is the first author is Cox, K-O-X, last author, last name Pickers, P-I-C-K-K-E-R-S.",
      "speaker": 0
    },
    {
      "start": 3036.84,
      "end": 3039.34,
      "zh": "他们让受试者接触内毒素。",
      "en": "What they did was they exposed human subjects to an endotoxin.",
      "speaker": 0
    },
    {
      "start": 3039.34,
      "end": 3044.46,
      "zh": "他们就是给人注射了大肠杆菌，这种细菌让所有人都感觉很糟。",
      "en": "By, in other words, they injected people with E. coli, there's a bacteria, which makes people, all people feel terrible.",
      "speaker": 0
    },
    {
      "start": 3044.46,
      "end": 3048.98,
      "zh": "\"就是恶心、发烧、呕吐、腹泻，特别难受，对吧？\"",
      "en": "So nauseous, fever, vomiting, diarrhea, it's very unpleasant, okay?",
      "speaker": 0
    },
    {
      "start": 3048.98,
      "end": 3052.52,
      "zh": "这些人是自愿参加这个研究的。",
      "en": "These people voluntarily signed up for this study.",
      "speaker": 0
    },
    {
      "start": 3052.52,
      "end": 3058.06,
      "zh": "不过，有些受试者做了一个行为实验，可以说就是反复过度换气。",
      "en": "However, some of the subjects in this study performed a behavioral protocol that can best be described as cyclic hyperventilation.",
      "speaker": 0
    },
    {
      "start": 3058.06,
      "end": 3060.9,
      "zh": "\"我们实验室研究这类呼吸方法。\"",
      "en": "My lab works on these types of breathing protocols.",
      "speaker": 0
    },
    {
      "start": 3060.9,
      "end": 3069.54,
      "zh": "\"这不是我们实验室做的，但基本上受试者会先过度换气，然后屏住呼吸，我会具体说说他们怎么做的。\"",
      "en": "This is not work that my lab did, but basically subjects hyperventilate, followed by breath retention, by breath holds, and I'll explain exactly what they did.",
      "speaker": 0
    },
    {
      "start": 3069.54,
      "end": 3073.28,
      "zh": "他们也研究了其他行为方案，但咱们先聊这个。",
      "en": "They also looked at other forms of behavioral protocols, but let's focus on that one.",
      "speaker": 0
    },
    {
      "start": 3073.28,
      "end": 3078.88,
      "zh": "\"他们把做基础冥想的人和做这种剧烈呼吸后屏息的人进行比较。\"",
      "en": "So they're comparing controls that do just sort of a basic meditation versus people that do this intense breathing, followed by some breath holds.",
      "speaker": 0
    },
    {
      "start": 3078.88,
      "end": 3080.7200000000003,
      "zh": "我只是大概说一下。",
      "en": "I'm just paraphrasing here.",
      "speaker": 0
    },
    {
      "start": 3078.88,
      "end": 3091.6600000000003,
      "zh": "在呼吸组干预中，注射内毒素后，抗炎细胞因子IL-10的血浆水平上升，这主要是因为肾上腺素和去甲肾上腺素的增加引起的。",
      "en": "In the intervention group, the breathing group, plasma levels of anti-inflammatory cytokine IL-10, so this is a cytokine that lowers inflammation, increased after endotoxin administration, and that was triggered by an increase in epinephrine and adrenaline.",
      "speaker": 0
    },
    {
      "start": 3091.6600000000003,
      "end": 3099.6400000000003,
      "zh": "换句话说，这种特定的呼吸方式能激活抗炎细胞因子，而没做这种呼吸的人则没有这种效果。",
      "en": "So in other words, doing a particular pattern of breathing allowed an anti-inflammatory cytokine to be turned on, whereas that was not the case in the subjects that did not do this particular breathing protocol.",
      "speaker": 0
    },
    {
      "start": 3099.6400000000003,
      "end": 3108.6000000000004,
      "zh": "他们发现，干预组的促炎因子TNF-alpha、IL-6和IL-8水平较低，而抗炎的IL-10水平上升。",
      "en": "And they discovered that levels of pro-inflammatory TNF-alpha, tumor necrosis factor alpha, IL-6, interleukin-6, and interleukin-8, which you should all be familiar with now, as pro-inflammatory cytokines were lower in the intervention group, whereas these IL-10 levels that are anti-inflammatory went up.",
      "speaker": 0
    },
    {
      "start": 3108.6000000000004,
      "end": 3112.1600000000003,
      "zh": "最后，干预组的流感样症状更轻。",
      "en": "Finally, flu-like symptoms were lower in the intervention group.",
      "speaker": 0
    },
    {
      "start": 3112.1600000000003,
      "end": 3115.1200000000003,
      "zh": "\"所以这发现挺惊人的，对吧？\"",
      "en": "So this is an amazing finding, right?",
      "speaker": 0
    },
    {
      "start": 3115.1200000000003,
      "end": 3117.6000000000004,
      "zh": "\"这些都是人类受试者。\"",
      "en": "These are human subjects.",
      "speaker": 0
    },
    {
      "start": 3117.6000000000004,
      "end": 3120.6400000000003,
      "zh": "有一组受试者在做这种呼吸练习。",
      "en": "One group of subjects is doing this breathing protocol.",
      "speaker": 0
    },
    {
      "start": 3120.6400000000003,
      "end": 3122.92,
      "zh": "另一组受试者只是在冥想。",
      "en": "The other group of subjects is just meditating.",
      "speaker": 0
    },
    {
      "start": 3122.92,
      "end": 3125.54,
      "zh": "两组受试者都被注射了大肠杆菌。",
      "en": "They both, both sets of subjects have been injected with E. coli.",
      "speaker": 0
    },
    {
      "start": 3125.54,
      "end": 3128.6800000000003,
      "zh": "\"所以大家体内注射的量是一样的。\"",
      "en": "So you know everyone's getting the same amount placed into their system.",
      "speaker": 0
    },
    {
      "start": 3128.6800000000003,
      "end": 3129.6600000000003,
      "zh": "\"这挺有意思的。\"",
      "en": "This is very, very interesting.",
      "speaker": 0
    },
    {
      "start": 3129.6600000000003,
      "end": 3134.04,
      "zh": "\"这就引出了一个问题，任何好奇的人都会问，为什么？\"",
      "en": "And it leads to the question that every good scientist, two-year-old, or health information seeker asks, which is why?",
      "speaker": 0
    },
    {
      "start": 3134.04,
      "end": 3135.76,
      "zh": "\"怎么做到的？\"",
      "en": "How?",
      "speaker": 0
    },
    {
      "start": 3135.76,
      "end": 3137.96,
      "zh": "\"这到底是怎么回事？\"",
      "en": "How in the world does this work?",
      "speaker": 0
    },
    {
      "start": 3137.96,
      "end": 3139.96,
      "zh": "\"这为什么有效呢？\"",
      "en": "Why does this work?",
      "speaker": 0
    },
    {
      "start": 3135.76,
      "end": 3156.84,
      "zh": "\"简单说吧，因为我要详细讲，这个有效是因为交感神经系统，也就是我们通常说的压力系统，其实不完全是这样，但就是触发轻度到重度压力，甚至到恐慌的那个系统，会让大脑和身体释放肾上腺素。\"",
      "en": "Well, to make a long story short-ish, because I am going to go into depth here, the reason it works is because the sympathetic nervous system, the so-called stress part of our nervous system, it's not really called that, but the part of our nervous system that triggers stress from mild stress to severe stress, even to panic, causes the release of adrenaline and epinephrine in the brain and body.",
      "speaker": 0
    },
    {
      "start": 3156.84,
      "end": 3162.82,
      "zh": "\"正常情况下，当我们有感染入侵时，身体会通过激活压力反应来抵抗它。\"",
      "en": "And under normal circumstances, when we have some sort of invading infection, our body is able to push back on that, to resist it by engaging the stress response.",
      "speaker": 0
    },
    {
      "start": 3160.4,
      "end": 3178.54,
      "zh": "\"所以这里发生的就是，有个行为方案涉及到神经系统，因为所有行为都是神经系统生成的嘛，大家故意用这个行为方案来激活交感神经系统，这样就能激活增强免疫系统功能的正常路径，对吧？\"",
      "en": "So what's happening here is there's a behavioral protocol involving the nervous system, because all behaviors are generated from the nervous system, of course, a behavioral protocol that people are deliberately employing that allows them to activate the sympathetic nervous system, which in turn allows them to activate the normal pathways by which immune system function is enhanced, okay?",
      "speaker": 0
    },
    {
      "start": 3178.54,
      "end": 3186.02,
      "zh": "\"我特别强调这一点，是因为很多人误解这研究是阻止正常免疫反应，但其实不是这样。\"",
      "en": "Now, the reason I'm underscoring this is that the common interpretation of this study is that somehow it blocks the normal immune response, but that's not really what's happening here.",
      "speaker": 0
    },
    {
      "start": 3186.02,
      "end": 3192.82,
      "zh": "\"对，炎症细胞因子减少了，抗炎细胞因子增加了，但这跟阻止免疫反应不是一回事。\"",
      "en": "Yes, there's a reduction in inflammatory cytokines, and there's an increase in anti-inflammatory cytokines, but that's not really the same thing as blocking the immune response.",
      "speaker": 0
    },
    {
      "start": 3194.02,
      "end": 3199.1400000000003,
      "zh": "这其实可以看作是增强免疫反应来对抗入侵者，比如大肠杆菌。",
      "en": "This could just as easily be viewed as enhancing the immune response and combating the intruder, in this case, E. coli.",
      "speaker": 0
    },
    {
      "start": 3199.1400000000003,
      "end": 3201.96,
      "zh": "\"咱们再仔细看看这项研究吧。\"",
      "en": "So let's parse this study a little bit more closely.",
      "speaker": 0
    },
    {
      "start": 3201.96,
      "end": 3205.2000000000003,
      "zh": "\"首先，这个神奇的呼吸模式是什么？\"",
      "en": "First of all, what is this magical pattern of breathing?",
      "speaker": 0
    },
    {
      "start": 3205.2000000000003,
      "end": 3209.38,
      "zh": "有些人可能知道这就是所谓的Wim Hof呼吸法。",
      "en": "Some of you may recognize this as so-called Wim Hof breathing.",
      "speaker": 0
    },
    {
      "start": 3209.38,
      "end": 3215.0,
      "zh": "温姆，荷兰人，网上他以前的职业被标为\"冒险家\"，信不信由你。",
      "en": "Wim, of course, the Dutchman, I think his occupation online used to be listed as daredevil, believe it or not.",
      "speaker": 0
    },
    {
      "start": 3215.0,
      "end": 3218.2000000000003,
      "zh": "\"在维基百科上，这个职业挺酷的。\"",
      "en": "On Wikipedia, that's a pretty cool occupation.",
      "speaker": 0
    },
    {
      "start": 3218.2000000000003,
      "end": 3221.48,
      "zh": "温姆最出名的是他在冷暴露方面的活动。",
      "en": "Wim is best known for his activities with cold exposure.",
      "speaker": 0
    },
    {
      "start": 3221.48,
      "end": 3234.84,
      "zh": "他在这方面有多个世界纪录，比如在冰山下游泳，还有其他一些你最好别轻易尝试的壮举，除非你像他一样特别厉害，知道自己在干嘛。他也因为呼吸法而出名。",
      "en": "He holds multiple world records for that, swimming under icebergs and other incredible feats that you definitely don't want to try unless you're extremely skilled and really know what you're doing, as he does, but also for the use of breathwork.",
      "speaker": 0
    },
    {
      "start": 3232.94,
      "end": 3250.7200000000003,
      "zh": "所谓的Wim Hof呼吸法，其实跟tumo呼吸很像，虽然不完全一样。在科学界和生理学界，大家一直这么描述。在我的大学实验室里，我们叫它循环过度换气，就是反复深呼吸，然后屏住呼吸。",
      "en": "The breathing that is so-called Wim Hof breathing is very similar, not exactly the same, but very similar to tumo breathing, as it's been described historically in the science and physiology community and in my laboratory, because I run a university laboratory, we refer to it as cyclic hyperventilation, which just means repeated deep breaths in and out, and then there are these retentions.",
      "speaker": 0
    },
    {
      "start": 3249.36,
      "end": 3255.58,
      "zh": "\"既然我都在这里了，不如给你演示一下，这样你就知道是什么样的了。\"",
      "en": "So because I'm here in the hot seat anyway, I might as well demonstrate it for you so you know what this looks like.",
      "speaker": 0
    },
    {
      "start": 3255.58,
      "end": 3257.7,
      "zh": "\"其实还有不同的版本。\"",
      "en": "There are variations on this.",
      "speaker": 0
    },
    {
      "start": 3257.7,
      "end": 3264.22,
      "zh": "所以关于温姆、tumo练习者，还有那些循环过度换气的人，这就是其中的一个大概念。",
      "en": "So with respect to Wim, with respect to tumo practitioners, with respect to the cyclic hyperventilators everywhere, this is one general theme of it.",
      "speaker": 0
    },
    {
      "start": 3262.3,
      "end": 3281.52,
      "zh": "\"这个方法就是先做20到30次深呼吸，嘴巴呼气，然后把气全部呼出后屏住呼吸，这就是所谓的停留。过了15到60秒，再重复25或30次呼吸，然后再屏住呼吸，肺里没有空气。\"",
      "en": "It involves 20 to 30 deep inhales and then exhales through the mouth, followed by a exhale of all one's air and a breath hold, that's the retention, and then at some point, 15 to 60 seconds later, repeating the 25 or 30 breaths, and then again, a breath hold with lungs empty.",
      "speaker": 0
    },
    {
      "start": 3282.52,
      "end": 3286.06,
      "zh": "在我们实验室和这项研究中，这个方法大概是这样的。",
      "en": "There are variations on this, but in our laboratory and in this particular study, it looks something like this.",
      "speaker": 0
    },
    {
      "start": 3286.06,
      "end": 3290.62,
      "zh": "\"好吧，我现在不打算全做一遍，大概就是这样。\"",
      "en": "Okay, I'm not going to do the whole thing right now, but it goes something like this.",
      "speaker": 0
    },
    {
      "start": 3290.62,
      "end": 3299.78,
      "zh": "\"好，那就假设我做了30次呼吸。\"",
      "en": "Okay, so let's assume I did that for 30 breaths.",
      "speaker": 0
    },
    {
      "start": 3299.78,
      "end": 3302.32,
      "zh": "\"我已经感觉有点出汗了。\"",
      "en": "I can already feel myself perspiring a little bit.",
      "speaker": 0
    },
    {
      "start": 3302.32,
      "end": 3306.18,
      "zh": "\"你热起来了，这是肾上腺素在释放。\"",
      "en": "You're heating up, that's the release of adrenaline.",
      "speaker": 0
    },
    {
      "start": 3326.08,
      "end": 3339.02,
      "zh": "有些人会在最后深吸一口气，然后屏住呼吸，发现自己能憋气比平时更久，因为通常是血液中的二氧化碳增加才会让我们想呼吸。",
      "en": "Now, some people will also introduce a big inhale and breath hold at the end and find that indeed they can hold their breath much longer than they normally would be able to because the trigger to breathe is normally activated by increases in carbon dioxide in our blood.",
      "speaker": 0
    },
    {
      "start": 3339.02,
      "end": 3349.14,
      "zh": "我们大脑里有些神经元，会对二氧化碳过高做出反应，触发呼吸反射。但当我们深呼出时，会排出很多二氧化碳，所以不会那么快有想呼吸的冲动。",
      "en": "We have neurons in our brainstem and in our various regions of our brain, actually, that respond to when carbon dioxide is too high and trigger the reflex to breathe, but when we exhale deeply, we blow off a lot of carbon dioxide so we don't feel that impulse to breathe come quite as soon.",
      "speaker": 0
    },
    {
      "start": 3349.14,
      "end": 3352.14,
      "zh": "这个研究就是看大家怎么做这种循环过度换气，然后屏住呼吸，25到30次呼吸，再屏住，重复几轮。",
      "en": "Basically, this study looked at people doing these cyclic hyperventilation with retention, 25 or 30 breaths, then the retention, 25 or 30 breaths, then retention, 25, 30 breaths, then the retention.",
      "speaker": 0
    },
    {
      "start": 3352.14,
      "end": 3358.14,
      "zh": "\"所以一般是三轮，每轮25到30次呼吸，然后呼气憋住，时间大概是15到60秒。\"",
      "en": "So three rounds of 25 to 30 breaths followed by exhale hold in between of various duration, but in general, 15 to 60 seconds is typical.",
      "speaker": 0
    },
    {
      "start": 3358.14,
      "end": 3359.14,
      "zh": "\"那身体上发生了什么变化呢？\"",
      "en": "What happened physiologically?",
      "speaker": 0
    },
    {
      "start": 3364.14,
      "end": 3366.14,
      "zh": "\"我喜欢这个研究的原因之一就是这个。\"",
      "en": "This is one of the reasons I like this study.",
      "speaker": 0
    },
    {
      "start": 3366.14,
      "end": 3367.14,
      "zh": "\"身体上有什么变化呢？\"",
      "en": "What happened physiologically?",
      "speaker": 0
    },
    {
      "start": 3368.14,
      "end": 3369.14,
      "zh": "\"嗯，有几点变化。\"",
      "en": "Well, a couple of things.",
      "speaker": 0
    },
    {
      "start": 3370.14,
      "end": 3371.14,
      "zh": "\"当然，血氧会下降。\"",
      "en": "Of course, blood oxygenation drops.",
      "speaker": 0
    },
    {
      "start": 3372.14,
      "end": 3375.14,
      "zh": "\"因为过度换气，尤其是呼出太多二氧化碳，血氧会下降。\"",
      "en": "You would expect that based on hyperventilation and especially based on the exhale of so much carbon dioxide.",
      "speaker": 0
    },
    {
      "start": 3377.14,
      "end": 3378.14,
      "zh": "\"这可以解释为什么血氧水平会下降。\"",
      "en": "We could explain why that is, but blood levels of oxygen drop.",
      "speaker": 0
    },
    {
      "start": 3379.14,
      "end": 3381.14,
      "zh": "\"身体的pH值，也就是碱性会上升。\"",
      "en": "The pH, the alkalinity of the body goes way up.",
      "speaker": 0
    },
    {
      "start": 3387.14,
      "end": 3388.14,
      "zh": "\"这挺有意思的。\"",
      "en": "This is very interesting.",
      "speaker": 0
    },
    {
      "start": 3390.14,
      "end": 3393.14,
      "zh": "\"你查一下这篇论文，看看图一的C图，pH值上升很多。\"",
      "en": "If you look up this paper, you can look at figure one, panel C, the pH goes way up.",
      "speaker": 0
    },
    {
      "start": 3394.14,
      "end": 3395.14,
      "zh": "\"人会变得碱性。\"",
      "en": "People become alkaline.",
      "speaker": 0
    },
    {
      "start": 3396.14,
      "end": 3397.14,
      "zh": "\"你之前听说过碱性水吧。\"",
      "en": "You've heard before of alkaline water.",
      "speaker": 0
    },
    {
      "start": 3399.14,
      "end": 3400.14,
      "zh": "\"我真不想这么说。\"",
      "en": "I hate to say this.",
      "speaker": 0
    },
    {
      "start": 3403.14,
      "end": 3405.14,
      "zh": "\"我可能会因此失去一些朋友，但别花钱去买碱性水喝。\"",
      "en": "I probably lose some friends for this, but don't waste your money on drinking alkaline water.",
      "speaker": 0
    },
    {
      "start": 3412.2599999999998,
      "end": 3415.1,
      "zh": "“你其实没法改变身体的碱性。”",
      "en": "You can't really shift the alkalinity of your body.",
      "speaker": 0
    },
    {
      "start": 3415.1,
      "end": 3419.56,
      "zh": "\"有些情况下，身体的某些部位需要比其他地方更碱性。\"",
      "en": "There are cases where some compartment in your body needs to be more alkaline than the rest.",
      "speaker": 0
    },
    {
      "start": 3419.56,
      "end": 3426.5,
      "zh": "\"你肠道的碱性和身体其他地方不一样，但喝高碱性水并不会改变整体酸碱度。\"",
      "en": "Your gut is a different alkalinity than other areas of your body, et cetera, but ingesting high alkaline water isn't going to shift your overall alkalinity.",
      "speaker": 0
    },
    {
      "start": 3426.5,
      "end": 3431.72,
      "zh": "\"如果有人能给我看有力的证据证明不一样，我会很乐意改口。\"",
      "en": "If someone can send me a quality reference that shows different, then I'm happy to revise that statement.",
      "speaker": 0
    },
    {
      "start": 3431.72,
      "end": 3438.18,
      "zh": "不过，不管怎样，按照我刚才说的那种呼吸方式，确实能大大提高pH值。",
      "en": "But in any case, doing that pattern of breathing that I just described greatly increases a pH.",
      "speaker": 0
    },
    {
      "start": 3438.18,
      "end": 3442.48,
      "zh": "\"不过，我得说，这不会让pH值达到危险水平。\"",
      "en": "Greatly, I should say, it doesn't send it off into dangerous levels.",
      "speaker": 0
    },
    {
      "start": 3442.48,
      "end": 3448.54,
      "zh": "\"它能把pH值从7.4提高到7.6，碱性确实增加不少。\"",
      "en": "It takes it from 7.4 to 7.6, which is a significant increase in alkalinity.",
      "speaker": 0
    },
    {
      "start": 3448.54,
      "end": 3454.28,
      "zh": "\"所以，记得高中或者大学化学课的朋友都知道，pH值数字越低，酸性就越强。\"",
      "en": "So as pH levels, for those of you who remember high school or college chemistry, as the numbers on the pH go down, you're becoming more acidic.",
      "speaker": 0
    },
    {
      "start": 3455.48,
      "end": 3460.66,
      "zh": "\"数值越高，你就越碱性，对吧，或者说更偏碱。\"",
      "en": "As they go up, you're becoming more alkaline, okay, or more basic.",
      "speaker": 0
    },
    {
      "start": 3461.28,
      "end": 3464.0,
      "zh": "\"所以他们的pH值从7.4升到了7.6。\"",
      "en": "So you go from seven, these subjects went from 7.4 to 7.6.",
      "speaker": 0
    },
    {
      "start": 3464.0,
      "end": 3469.12,
      "zh": "\"呼吸过程中pH值升高，之后又恢复正常。\"",
      "en": "During the breathing, and then afterwards it returned to normal.",
      "speaker": 0
    },
    {
      "start": 3469.12,
      "end": 3472.46,
      "zh": "\"但这种碱性变化被认为很重要。\"",
      "en": "But that shift in alkalinity is thought to be important here.",
      "speaker": 0
    },
    {
      "start": 3472.46,
      "end": 3474.94,
      "zh": "\"所以这里到底发生了什么呢？\"",
      "en": "So what's going on here?",
      "speaker": 0
    },
    {
      "start": 3474.94,
      "end": 3479.62,
      "zh": "\"呼吸怎么会导致炎症因子减少，而抗炎因子增加呢？\"",
      "en": "How is the breathing leading to these shifts in, or I should say reduction in inflammatory cytokines and an increase in the liberation of these anti-inflammatory cytokines?",
      "speaker": 0
    },
    {
      "start": 3477.34,
      "end": 3489.22,
      "zh": "\"其实，作者们认为关键不在于pH值的变化，也不是血液中二氧化碳水平的变化，而是肾上腺素的释放。\"",
      "en": "Well, the authors make some good arguments as to why it's not the shift in pH per se, or the shift in carbon dioxide levels in the blood, but rather it's the release of epinephrine.",
      "speaker": 0
    },
    {
      "start": 3489.22,
      "end": 3491.78,
      "zh": "\"有充分理由相信就是这样。\"",
      "en": "There's some good reason to believe why that's the case.",
      "speaker": 0
    },
    {
      "start": 3491.78,
      "end": 3499.6400000000003,
      "zh": "这超出我们讨论范围，但其实是肾上腺素，也就是肾上腺素的释放，导致了炎症的减少。",
      "en": "It's beyond the scope of this discussion, but that it's actually the release of epinephrine, aka adrenaline, that's causing this reduction in inflammation.",
      "speaker": 0
    },
    {
      "start": 3499.6400000000003,
      "end": 3506.36,
      "zh": "\"这其实跟你可能经历过的情况有关，比如拼命工作、照顾别人或者准备考试。\"",
      "en": "And that's actually supported by something that you've probably experienced before, which is if you've ever worked, worked, worked, worked really hard, or you've been a caretaker for somebody else or studying for exams.",
      "speaker": 0
    },
    {
      "start": 3503.92,
      "end": 3517.88,
      "zh": "\"身边的人都生病了，你硬撑着没事儿，但一旦你停下来，交了最后的考试，或者不再照顾别人，终于休息或者去度假时，结果自己倒生病了。\"",
      "en": "and people around you are getting sick and you're just powering through it and you're not getting sick, but then you stop, you turn in your final exam, you stop taking care of somebody else or you finally stop and rest or you go on vacation and then you get sick.",
      "speaker": 1
    },
    {
      "start": 3517.88,
      "end": 3523.76,
      "zh": "\"嗯，你这就是肾上腺素通过神经系统激活免疫系统，让你继续抗感染的效果。\"",
      "en": "Well, you've just experienced the effect that adrenaline epinephrine can have in activating your immune system by way of the nervous system in order to keep fighting and combating infection.",
      "speaker": 1
    },
    {
      "start": 3523.76,
      "end": 3531.6600000000003,
      "zh": "\"这就说到一个更大的主题，其实应对感染或者伤口的压力系统，和应对心理压力的是同一个系统。\"",
      "en": "And that brings us to a larger theme, which is that stress and combating infection or a wound is not one unique system, it's the same stress system that you use to combat psychological stress.",
      "speaker": 1
    },
    {
      "start": 3531.6600000000003,
      "end": 3541.0600000000004,
      "zh": "\"所以当你压力很大的时候，至少在短期内，因为肾上腺素分泌很多，你其实更能抵抗感染，减少炎症，感觉也不会那么糟，对吧？\"",
      "en": "So when you're very, very stressed, at least in the short term, because you release so much adrenaline and epinephrine, you're actually better able to combat infections and you reduce inflammation and the whole feeling lousy response, right?",
      "speaker": 1
    },
    {
      "start": 3541.0600000000004,
      "end": 3544.96,
      "zh": "\"记住，这时候流感症状会减轻。\"",
      "en": "Remember, reduced flu-like symptoms here.",
      "speaker": 1
    },
    {
      "start": 3544.96,
      "end": 3548.7200000000003,
      "zh": "\"所以这种呼吸方式其实是个很有用的工具。\"",
      "en": "So this pattern of breathing is actually a very useful tool.",
      "speaker": 1
    },
    {
      "start": 3548.7200000000003,
      "end": 3553.28,
      "zh": "\"说实话，我一有点感冒的苗头就用这种呼吸法。\"",
      "en": "And I confess, I use this pattern of breathing anytime I am at the initial stages of getting some sort of bug.",
      "speaker": 1
    },
    {
      "start": 3552.1400000000003,
      "end": 3561.6800000000003,
      "zh": "\"如果我觉得自己累坏了，或者嗓子有点痒、鼻子不舒服，像是要感冒了，我就会用这种呼吸法。\"",
      "en": "If I feel like I've been running myself ragged or if I somehow, for whatever reason, have a tickle in my throat or I have that kind of sensation in my nose, like I might have caught a bug of some sort, I will do this pattern of breathing.",
      "speaker": 1
    },
    {
      "start": 3561.6800000000003,
      "end": 3565.0400000000004,
      "zh": "\"天啊，我这四年多一直在用这个方法。\"",
      "en": "I've been doing it consistently, gosh, for the last four years or more.",
      "speaker": 1
    },
    {
      "start": 3563.84,
      "end": 3572.84,
      "zh": "\"这个只是我的个人经验，但我发现这样做确实能让早期症状消失，或者让我能撑得更久一点。\"",
      "en": "You know, now this is just anecdotal reports, but I find that it allows me indeed to either have those early symptoms disappear or it allows me to just kind of push through and harder longer.",
      "speaker": 1
    },
    {
      "start": 3572.84,
      "end": 3576.0600000000004,
      "zh": "\"我不建议大家硬扛着继续接触感染。\"",
      "en": "I don't suggest people continue to push through exposure to infections.",
      "speaker": 1
    },
    {
      "start": 3576.0600000000004,
      "end": 3582.02,
      "zh": "\"显然你不想传染给别人，也不想因为不做这个呼吸法而突然病倒。\"",
      "en": "Obviously you don't want to infect other people, nor do you want to crash and suddenly get a massive illness of some sort because you stopped doing this breathing.",
      "speaker": 1
    },
    {
      "start": 3582.02,
      "end": 3584.9,
      "zh": "\"但我觉得这还是挺有用的。\"",
      "en": "But I do think it's a useful tool.",
      "speaker": 1
    },
    {
      "start": 3584.9,
      "end": 3588.8,
      "zh": "\"这就是个纯粹的行为干预，效果已经证明了。\"",
      "en": "It's a purely behavioral intervention that has been shown here.",
      "speaker": 1
    },
    {
      "start": 3588.8,
      "end": 3595.0400000000004,
      "zh": "\"现在还有新的研究在进行，目的是增强免疫系统功能和减少炎症。\"",
      "en": "And now there are additional studies on the way to enhance the function of your immune system and to reduce inflammation.",
      "speaker": 1
    },
    {
      "start": 3593.42,
      "end": 3606.02,
      "zh": "\"对我来说，这是个零成本工具的最佳例子，通过呼吸激活神经系统，释放肾上腺素，从而减轻像大肠杆菌感染这种情况带来的不适感。\"",
      "en": "And this is to me, one of the most concrete examples of a zero cost tool that bridges the activation of the nervous system through breathing with the immune system by way of releasing adrenaline and thereby reducing the terrible effects or feelings of lousiness from a, in this case, an E. coli infection.",
      "speaker": 1
    },
    {
      "start": 3606.02,
      "end": 3613.0400000000004,
      "zh": "\"现在，我想强调几点很重要但不常被讨论的，就是过度换气和屏息都很重要。\"",
      "en": "Now, I'd like to focus on a couple of important points that I haven't heard discussed broadly elsewhere, which is that the hyperventilation and the breath retention are both important.",
      "speaker": 1
    },
    {
      "start": 3613.28,
      "end": 3620.2200000000003,
      "zh": "\"所以你不能光靠过度换气就达到释放肾上腺素和减少炎症因子的效果。\"",
      "en": "So you can't simply hyperventilate to get this effect at the level of epinephrine release and reduction in inflammatory cytokines.",
      "speaker": 1
    },
    {
      "start": 3620.2200000000003,
      "end": 3626.84,
      "zh": "\"研究表明，过度换气和屏息导致的低氧结合起来可以提高肾上腺素水平。\"",
      "en": "It's been shown before that the hyperventilation phase and the hypoxia, which is a low oxygen saturation due to the breath retention, they both combine to increase epinephrine adrenaline levels.",
      "speaker": 1
    },
    {
      "start": 3626.84,
      "end": 3635.4,
      "zh": "\"所以你得做25到30次呼吸，然后屏息，也就是呼气后屏住呼吸，才能达到最佳效果。\"",
      "en": "So you have to do the 25 or 30 breaths and then the retention 25 or 30 breaths, then the retention, meaning that the exhale with the breath hold in order to get the full effect.",
      "speaker": 1
    },
    {
      "start": 3635.4,
      "end": 3638.46,
      "zh": "\"我还想提醒大家一个很重要的注意事项。\"",
      "en": "I also want to provide a critical cautionary note.",
      "speaker": 1
    },
    {
      "start": 3638.46,
      "end": 3642.1000000000004,
      "zh": "\"别在水边或者开车的时候做这个。\"",
      "en": "Don't do this anywhere near water or while driving a car.",
      "speaker": 1
    },
    {
      "start": 3643.28,
      "end": 3646.42,
      "zh": "\"这些事看起来挺简单，但万一你晕过去，那就麻烦了。\"",
      "en": "These things might seem kind of obvious, but obviously in the off chance that you black out or something like that, it could be disastrous.",
      "speaker": 1
    },
    {
      "start": 3646.42,
      "end": 3648.0800000000004,
      "zh": "\"所以一定要小心。\"",
      "en": "So please be careful.",
      "speaker": 1
    },
    {
      "start": 3648.0800000000004,
      "end": 3651.1200000000003,
      "zh": "\"还有，不要勉强屏住呼吸。\"",
      "en": "And again, don't try and push the breath hold.",
      "speaker": 1
    },
    {
      "start": 3651.1200000000003,
      "end": 3654.2400000000002,
      "zh": "\"一有想呼吸的冲动，就赶紧呼吸。\"",
      "en": "The moment you feel the impulse to breathe, just breathe.",
      "speaker": 1
    },
    {
      "start": 3653.26,
      "end": 3661.6800000000003,
      "zh": "\"三轮25到30次呼吸，中间加上屏住呼吸，感觉是最理想的做法。\"",
      "en": "And it did seem that the three rounds of 25 to 30 breaths with interventions, excuse me, with breath hold retentions in between was the ideal protocol.",
      "speaker": 1
    },
    {
      "start": 3661.6800000000003,
      "end": 3665.7000000000003,
      "zh": "\"我还想特别强调一下，这个研究里有个很有趣的点。\"",
      "en": "There's one last very interesting feature of this study that I want to emphasize.",
      "speaker": 1
    },
    {
      "start": 3665.7000000000003,
      "end": 3668.6600000000003,
      "zh": "\"他们还测量了所谓的儿茶酚胺浓度。\"",
      "en": "And that was that they actually measured the so-called catecholamine concentrations.",
      "speaker": 1
    },
    {
      "start": 3668.6600000000003,
      "end": 3674.34,
      "zh": "\"儿茶酚胺就是像多巴胺、肾上腺素、去甲肾上腺素这样的东西。\"",
      "en": "Catecholamines are things like dopamine, epinephrine, norepinephrine.",
      "speaker": 1
    },
    {
      "start": 3673.28,
      "end": 3678.76,
      "zh": "\"这些化学物质能让你的神经系统和身体保持警觉状态。\"",
      "en": "These are chemicals in your nervous system and body that promote states of alertness.",
      "speaker": 1
    },
    {
      "start": 3678.76,
      "end": 3682.1000000000004,
      "zh": "\"多巴胺当然是奖励和动力系统的一部分。\"",
      "en": "Dopamine, of course, part of the reward and motivation pathways.",
      "speaker": 1
    },
    {
      "start": 3682.1000000000004,
      "end": 3687.34,
      "zh": "\"他们研究了在呼吸训练中和之后，这些分子在血液和血浆中的水平。\"",
      "en": "They explored the levels of these molecules in blood, in plasma, during and after this breathing protocol.",
      "speaker": 1
    },
    {
      "start": 3687.34,
      "end": 3692.7400000000002,
      "zh": "\"就像我之前提到的，肾上腺素相比对照组有明显增加。\"",
      "en": "And as interesting, as I mentioned before, epinephrine showed robust increases compared to the control group.",
      "speaker": 1
    },
    {
      "start": 3691.48,
      "end": 3700.1400000000003,
      "zh": "\"去甲肾上腺素在呼吸组明显增加，尤其是在循环过度换气和屏息组，不过没那么多。\"",
      "en": "Norepinephrine, significant increases occurred in the breathing group, but in the cyclic hyperventilation retention breathing group, of course, but less so.",
      "speaker": 1
    },
    {
      "start": 3700.1400000000003,
      "end": 3702.6600000000003,
      "zh": "\"多巴胺水平其实有点下降了。\"",
      "en": "And dopamine levels actually dropped somewhat.",
      "speaker": 1
    },
    {
      "start": 3703.28,
      "end": 3707.34,
      "zh": "\"这很有意思，因为以色列ISA Roll实验室有一些新研究。\"",
      "en": "But this is very interesting because there's a new and emerging literature, largely from ISA, A-Y-S-A, Roll's lab in Israel.",
      "speaker": 1
    },
    {
      "start": 3706.38,
      "end": 3717.6400000000003,
      "zh": "她的实验室发现，动机状态和心态对免疫系统的影响很大，而这些原本被认为和大脑、思维无关。",
      "en": "What her laboratory has shown is that motivational state and mindset has a powerful impact on various aspects of the immune system that were thought to be independent of the brain and mind and thinking.",
      "speaker": 1
    },
    {
      "start": 3715.76,
      "end": 3724.92,
      "zh": "\"这就让我们回到了节目一开始聊到的，那就是二三十年前，靠意念治病被认为是胡扯。\"",
      "en": "So this brings us back to something that we discussed at the very beginning of this episode, which is that 20, 30 years ago, the idea that you could heal the body with the mind was considered kind of quackery.",
      "speaker": 1
    },
    {
      "start": 3724.92,
      "end": 3730.5800000000004,
      "zh": "\"我觉得这段时间，人们可能会说，压力大肯定会让情况更糟。\"",
      "en": "I think that there was an intervening period up until now where people might've said, sure, if you're stressed out, it's going to make things worse.",
      "speaker": 1
    },
    {
      "start": 3730.5800000000004,
      "end": 3732.92,
      "zh": "\"我想大家都同意，压力会让事情更糟。\"",
      "en": "I mean, I think everyone agrees that stress makes everything worse at some level.",
      "speaker": 1
    },
    {
      "start": 3732.92,
      "end": 3737.86,
      "zh": "\"不管是神经退化还是身体和精神表现，都会受影响。\"",
      "en": "Outcomes to neurodegeneration, performance in physical endeavors and mental endeavors.",
      "speaker": 1
    },
    {
      "start": 3736.6,
      "end": 3744.86,
      "zh": "\"如果压力太大太久，人们就会面临各种问题，基本上每种主要精神障碍都会受到影响。\"",
      "en": "If stress is too high for too long, people experience different challenges and essentially every major psychiatric disorder, everything suffers.",
      "speaker": 1
    },
    {
      "start": 3744.86,
      "end": 3750.08,
      "zh": "\"但短期内，压力其实也有好处，就像我们刚才说的那样。\"",
      "en": "But in the short term, stress can actually be beneficial in the ways that we just described.",
      "speaker": 1
    },
    {
      "start": 3750.08,
      "end": 3753.64,
      "zh": "\"其实，压力本质上就是一种神经化学状态，对吧？\"",
      "en": "And stress, if we break it down, is really a neurochemical state, right?",
      "speaker": 1
    },
    {
      "start": 3754.1800000000003,
      "end": 3756.96,
      "zh": "\"就是这些儿茶酚胺的释放。\"",
      "en": "It's the release of these catecholamines.",
      "speaker": 1
    },
    {
      "start": 3756.96,
      "end": 3770.24,
      "zh": "伊萨·罗尔斯的实验室发现，当所谓的多巴胺系统被激活时，比如涉及到中脑边缘奖励通路的部分，像伏隔核这些区域，你会看到一些惊人的效果，比如癌症肿瘤的尺寸显著缩小。",
      "en": "And what Issa Rolls's laboratory has shown is that when the so-called dopamine system, and at several episodes I described, there are multiple dopamine systems, but the so-called mesolimbic reward pathway involving areas like the nucleus accumbens, et cetera, when the reward system that's associated with dopamine and norepinephrine is activated, you see incredible effects, including for instance, highly significant reduction in tumor size in cancers.",
      "speaker": 1
    },
    {
      "start": 3770.24,
      "end": 3772.1,
      "zh": "\"那为什么会这样呢？\"",
      "en": "Now, why would that be?",
      "speaker": 1
    },
    {
      "start": 3772.1,
      "end": 3775.94,
      "zh": "\"为什么心态、多巴胺和肿瘤的生长会有联系呢？\"",
      "en": "How is it that mindset dopamine and tumors and tumor growth are somehow linked?",
      "speaker": 1
    },
    {
      "start": 3775.14,
      "end": 3780.8399999999997,
      "zh": "\"我们现在知道这是怎么回事，主要是因为伊萨·罗尔斯和其他人的出色研究。\"",
      "en": "We now know how this occurs, largely through the incredible work of Issa Rolls and others.",
      "speaker": 1
    },
    {
      "start": 3780.18,
      "end": 3789.64,
      "zh": "\"现在我想聊聊具体哪些心态会影响免疫系统，我们可以指出具体的生物通路和相关的心态调整方法。\"",
      "en": "So now I'd like to turn our focus to how it is specifically that certain mindsets impact the immune system in ways that we can actually point to specific biological pathways and also specific protocols related to mindset.",
      "speaker": 1
    },
    {
      "start": 3789.64,
      "end": 3794.52,
      "zh": "\"其实简单来说，就是大家都知道，担心得多了会生病。\"",
      "en": "I guess a simple way to frame all this would be to say that most of us are aware that, yes, indeed, you can worry yourself sick.",
      "speaker": 1
    },
    {
      "start": 3794.52,
      "end": 3796.04,
      "zh": "我们都听说过这个。",
      "en": "We've been told that.",
      "speaker": 1
    },
    {
      "start": 3796.04,
      "end": 3797.64,
      "zh": "你会担心得生病。",
      "en": "You're going to worry yourself sick.",
      "speaker": 1
    },
    {
      "start": 3796.04,
      "end": 3804.0,
      "zh": "其实有篇论文发表在《Science》上，这是顶级的三大期刊之一，另外两个是《Nature》和《Cell》。",
      "en": "And actually there was a paper published in Science, again, one of the top three journals out there, the top three really being Nature Science and Cell.",
      "speaker": 1
    },
    {
      "start": 3804.0,
      "end": 3814.48,
      "zh": "当然，还有其他很棒的期刊，但这篇论文是去年发表在《Science》上的，第一作者是Kataoka，讲的是心理应激和发烧的关系。",
      "en": "And then other, of course, excellent journals exist, but this was a paper that came out in Science, last year, first author is Kataoka, K-A-T-A-O-K-A, describing psychogenic stress and fever.",
      "speaker": 1
    },
    {
      "start": 3814.48,
      "end": 3821.12,
      "zh": "\"所以他们在研究大脑里有没有区域真的支持这个观点，就是我们会因为担心而生病。\"",
      "en": "So this was looking or asking the question, are there areas of the brain that actually underlie this notion that we can worry ourselves sick?",
      "speaker": 1
    },
    {
      "start": 3821.12,
      "end": 3827.92,
      "zh": "\"他们发现了一条新通路，可以在不担心和不紧张的情况下激活它，看到生病的情况发生。\"",
      "en": "And they discovered a new pathway and they were able to both activate this pathway independent of worry and stress and see illness occur.",
      "speaker": 1
    },
    {
      "start": 3825.84,
      "end": 3836.04,
      "zh": "他们成功抑制了这条通路，阻止了这个神经通路的活动，从而防止了心理性发烧和因为担心而生病的情况。",
      "en": "And they were able to inhibit this pathway, block activity in this neural pathway and prevent psychogenic fever and the worrying of oneself sick.",
      "speaker": 1
    },
    {
      "start": 3836.04,
      "end": 3838.72,
      "zh": "\"所以他们能很有控制地做到这一点。\"",
      "en": "So they were able to do this in a very controlled way.",
      "speaker": 1
    },
    {
      "start": 3838.72,
      "end": 3841.84,
      "zh": "\"我提一下这条通路，如果你想详细了解的话。\"",
      "en": "I'll just mention the pathway in case you want to look it up in more detail.",
      "speaker": 1
    },
    {
      "start": 3841.84,
      "end": 3844.2,
      "zh": "\"这是一条皮层边缘通路。\"",
      "en": "This is a corticolimbic pathway.",
      "speaker": 1
    },
    {
      "start": 3844.2,
      "end": 3847.48,
      "zh": "所以简单说，皮层就是大脑的外壳部分。",
      "en": "So for just to orient us, the cortex is more or less the outer shell of the brain.",
      "speaker": 1
    },
    {
      "start": 3847.48,
      "end": 3851.88,
      "zh": "\"它负责思考、感觉、感知、学习，还有存储很多记忆。\"",
      "en": "It's involved in thinking and sensation and perceptions and learning and maintenance of a lot of memories are stored there.",
      "speaker": 1
    },
    {
      "start": 3852.0,
      "end": 3858.48,
      "zh": "\"我们都听说过，你是在海马体学习和记忆的，那是学习和记忆最初发生的地方。\"",
      "en": "We all hear that you learn and remember in the hippocampus, that's the initial site of learning and memory.",
      "speaker": 1
    },
    {
      "start": 3858.48,
      "end": 3864.56,
      "zh": "\"但你可能不知道，这些信息会传到皮层，就像存进长期硬盘一样保存起来。\"",
      "en": "But then that information, believe it or not, is passed off to the cortex where it's stored in kind of a long-term hard drive type storage.",
      "speaker": 1
    },
    {
      "start": 3864.56,
      "end": 3872.42,
      "zh": "所以皮层边缘通路就是一种方式，你的想法和过去的经验可以直接影响大脑控制基本功能的区域，比如调节体温。",
      "en": "So the corticolimbic pathway is one in which your thoughts, your prior experiences can literally in a structural way, feed down onto the areas of the brain that control very basal processes, including temperature regulation.",
      "speaker": 1
    },
    {
      "start": 3873.8,
      "end": 3876.9,
      "zh": "\"所以这就是皮层边缘下丘脑通路。\"",
      "en": "So this is a corticolimbic hypothalamic pathway.",
      "speaker": 1
    },
    {
      "start": 3876.9,
      "end": 3882.9,
      "zh": "\"我们之前说过，下丘脑负责调节体温，还有很多跟生病有关的行为，对吧？\"",
      "en": "We talked earlier about the hypothalamus as controlling temperature and a lot of sickness-related behavior, right?",
      "speaker": 1
    },
    {
      "start": 3882.9,
      "end": 3888.78,
      "zh": "\"记得Vegas到下丘脑，还有多睡、食欲减退、发烧，对吧？\"",
      "en": "Remember Vegas up to the hypothalamus and all the sleep more, less appetite, fever, okay?",
      "speaker": 1
    },
    {
      "start": 3889.7200000000003,
      "end": 3891.6,
      "zh": "这些都在下丘脑里。",
      "en": "That's all in the hypothalamus.",
      "speaker": 1
    },
    {
      "start": 3891.6,
      "end": 3896.9,
      "zh": "\"这就是一个自上而下的皮层边缘下丘脑通路，名字挺高级的。\"",
      "en": "This is a top-down corticolimbic hypothalamic pathway and it has a fancy name.",
      "speaker": 1
    },
    {
      "start": 3896.9,
      "end": 3900.18,
      "zh": "就是背侧脚皮层和背侧线条盖。",
      "en": "It's the dorsal peduncular cortex, dorsal tinea tecta.",
      "speaker": 1
    },
    {
      "start": 3900.18,
      "end": 3901.96,
      "zh": "简单来说就是DPDTT。",
      "en": "The short of that is the DPDTT.",
      "speaker": 1
    },
    {
      "start": 3901.96,
      "end": 3906.08,
      "zh": "那我们就叫它DPDTT到背内侧下丘脑吧。",
      "en": "So let's just call it the DPDTT to the dorsomedial hypothalamus.",
      "speaker": 1
    },
    {
      "start": 3906.08,
      "end": 3906.94,
      "zh": "\"D不多。\"",
      "en": "Not a lot of Ds.",
      "speaker": 1
    },
    {
      "start": 3906.94,
      "end": 3908.38,
      "zh": "\"这没啥特别意思。\"",
      "en": "It shouldn't mean anything.",
      "speaker": 1
    },
    {
      "start": 3906.94,
      "end": 3921.42,
      "zh": "\"叫什么不重要，重要的是这个通路概念上是从和思考、情感和过往经历相关的大脑区域开始，直接连到负责基本生理和潜意识控制的大脑区域。\"",
      "en": "Doesn't really matter what we call it, but what's important is conceptually, it's a pathway that originates in sites of the brain that are associated with thinking, with emotion and with prior history and feeds directly into an area of the brain that's involved in basic physiological, subconsciously controlled processes.",
      "speaker": 1
    },
    {
      "start": 3921.42,
      "end": 3924.06,
      "zh": "\"这太不可思议了，对吧？\"",
      "en": "So that's incredible, right?",
      "speaker": 1
    },
    {
      "start": 3923.02,
      "end": 3929.84,
      "zh": "\"这说明我们怎么想一件事，能通过一个实际通路改变我们的生理核心。\"",
      "en": "And it points to a physical pathway by which the way we think about something changes something core about our physiology.",
      "speaker": 1
    },
    {
      "start": 3929.84,
      "end": 3932.36,
      "zh": "\"其实有些方面这也没啥可惊讶的，对吧？\"",
      "en": "Now, in some ways that shouldn't be surprising, right?",
      "speaker": 1
    },
    {
      "start": 3933.16,
      "end": 3937.34,
      "zh": "\"你想想让你兴奋的事，心跳就会加快。\"",
      "en": "If you think about something that excites you, your heart rate can increase.",
      "speaker": 1
    },
    {
      "start": 3937.34,
      "end": 3940.36,
      "zh": "\"你想到让你害怕的事，心跳也会加快。\"",
      "en": "You think about something that terrifies you, your heart rate can increase.",
      "speaker": 1
    },
    {
      "start": 3938.88,
      "end": 3950.3,
      "zh": "所以说，思维能影响我们的生理状态并不是什么新鲜事，但人类一直对\"我们能通过思维让自己生病\"这个想法感到困惑。",
      "en": "So the idea that thinking controls our physiology is not a new concept at all, but somehow human beings, we have been challenged with the idea that we could actually think ourselves into being sick.",
      "speaker": 1
    },
    {
      "start": 3950.3,
      "end": 3956.86,
      "zh": "\"不过，Kataoka的研究表明，如果让人承受心理压力，真的能激活这个通路，引发发烧。\"",
      "en": "But this paper from Kataoka shows that if you expose somebody to a psychological stress, you can actually activate this pathway and create a fever.",
      "speaker": 1
    },
    {
      "start": 3958.34,
      "end": 3959.98,
      "zh": "\"他们是怎么做到的？\"",
      "en": "And how do they do that?",
      "speaker": 1
    },
    {
      "start": 3958.34,
      "end": 3967.02,
      "zh": "\"你可以通过让受试者经历一个非常紧张的真实事件，然后通过联想学习来引导这个过程。\"",
      "en": "Well, you can do this by exposing subjects to a very stressful real event and you cue it through associative learning.",
      "speaker": 1
    },
    {
      "start": 3967.02,
      "end": 3983.14,
      "zh": "\"所以说，可能就像我特别喜欢的Pilot V5笔，如果我在专注于这支笔时经历了什么可怕的事情，然后再把那个糟糕的经历拿掉，只给我这支笔，我可能就会开始感受到那些和那次糟糕事件相关的症状。\"",
      "en": "So maybe, you know, like my pilot V5s, which I love so much, you know, we could traumatize me to the pilot V5 if I had some horrible experience happen to me while I'm looking at and concentrating on the pilot V5, then you take away the horrible experience, you give me the pilot V5, and I start to experience a lot of the symptoms associated with that terrible event.",
      "speaker": 1
    },
    {
      "start": 3983.14,
      "end": 3986.62,
      "zh": "\"他们是用一些能让人生病的刺激物做到的。\"",
      "en": "They were able to do this using sickness-inducing stimuli and so forth.",
      "speaker": 1
    },
    {
      "start": 3986.62,
      "end": 3995.2999999999997,
      "zh": "他们做了各种实验，发现这个通路一旦被激活，即使没有那些糟糕的事件，也能引发发烧和类似生病的反应。",
      "en": "They did all the various derivations and identified this pathway that when activated, even in the absence of some horrible event, could create fever and illness-like behavior and so forth.",
      "speaker": 1
    },
    {
      "start": 3995.2999999999997,
      "end": 4000.48,
      "zh": "\"如果他们阻断了这个神经通路上的某些节点，就能阻止这种效果。\"",
      "en": "And if they blocked certain stations along this neural pathway, they could block that effect.",
      "speaker": 1
    },
    {
      "start": 4001.08,
      "end": 4007.34,
      "zh": "\"所以这确实是个很具体的证据，说明哺乳动物的大脑里有专门的通路，可以让想法变成生病的感觉。\"",
      "en": "So this is really concrete evidence, proof, if you will, that there are dedicated pathways in the mammalian brain, your brain and mine, that allow us to turn thoughts into illness.",
      "speaker": 1
    },
    {
      "start": 4007.34,
      "end": 4009.7799999999997,
      "zh": "\"这想法挺让人沮丧的。\"",
      "en": "That's kind of a depressing idea.",
      "speaker": 1
    },
    {
      "start": 4009.7799999999997,
      "end": 4011.02,
      "zh": "那反过来呢？",
      "en": "What about the inverse?",
      "speaker": 1
    },
    {
      "start": 4011.02,
      "end": 4013.1,
      "zh": "那想法变健康呢？",
      "en": "What about turning thoughts into health?",
      "speaker": 1
    },
    {
      "start": 4013.1,
      "end": 4015.22,
      "zh": "\"这个就是ISA Rolls的研究。\"",
      "en": "Well, that's the work of ISA Rolls.",
      "speaker": 1
    },
    {
      "start": 4015.22,
      "end": 4024.88,
      "zh": "\"他们研究了一个很有名的心理现象，就是癌症病人、重病患者或者受重伤的人，如果他们有希望，康复速度会快很多，对吧？\"",
      "en": "They explored the well-established psychological phenomenon that when cancer patients or very ill people or people who are suffering from very debilitating injuries, when people had or reported a sense of hope, their rates of recovery were much higher, right?",
      "speaker": 1
    },
    {
      "start": 4025.5,
      "end": 4027.48,
      "zh": "\"听起来挺主观的。\"",
      "en": "Sounds very subjective.",
      "speaker": 1
    },
    {
      "start": 4027.48,
      "end": 4029.12,
      "zh": "那什么是希望感呢？",
      "en": "But what is a sense of hope?",
      "speaker": 1
    },
    {
      "start": 4029.7999999999997,
      "end": 4031.7799999999997,
      "zh": "\"希望感就是对未来的感觉。\"",
      "en": "A sense of hope is a sense of the future.",
      "speaker": 1
    },
    {
      "start": 4031.7799999999997,
      "end": 4034.92,
      "zh": "“对未来的感觉跟多巴胺系统关系很大。”",
      "en": "A sense of the future is tightly associated with the dopamine system.",
      "speaker": 1
    },
    {
      "start": 4034.92,
      "end": 4041.42,
      "zh": "“多巴胺就是奖励、动力和行动的分子，但行动和动力其实是关于我们皮肤之外的事，跟未来有关。”",
      "en": "Dopamine, again, being this molecule of reward and motivation and movement, but movement and motivation are about things that are beyond the confines of our skin and are about the future.",
      "speaker": 1
    },
    {
      "start": 4041.42,
      "end": 4060.14,
      "zh": "他们发现，通过其他团队的研究也发现，刺激多巴胺通路，简单来说，就是想想未来，最好是美好的未来，能激活所谓的中脑边缘奖励通路，还可能缩小肿瘤，加速伤口愈合，大大加快从生病到健康的过程。",
      "en": "And so what they've discovered and through other studies from other groups have discovered is that stimulation of the dopamine pathway, either simply by thinking about a future, ideally a positive future, but thinking about a positive future leads to activation of this so-called mesolimbic reward pathway and could reduce the size of tumors, could accelerate wound healing, could greatly accelerate the passage from a state of illness to a state of health and wellbeing.",
      "speaker": 1
    },
    {
      "start": 4061.82,
      "end": 4064.7,
      "zh": "所以现在有很多研究开始围绕这个展开。",
      "en": "So there are many, many studies now starting to wick out related to this.",
      "speaker": 1
    },
    {
      "start": 4064.7,
      "end": 4068.54,
      "zh": "还有一种说法是增强多巴胺系统能加速愈合。",
      "en": "There's also the idea that augmenting the dopamine system can increase the rate of healing.",
      "speaker": 1
    },
    {
      "start": 4068.54,
      "end": 4072.14,
      "zh": "所以有些人会选择吃能增加多巴胺的东西。",
      "en": "And so there are individuals out there who opt, for instance, to take things that increase dopamine.",
      "speaker": 1
    },
    {
      "start": 4072.14,
      "end": 4080.94,
      "zh": "\"当然，滥用药物在这种情况下不是好主意，虽然它们能增加多巴胺，但会导致严重的崩溃，还容易上瘾什么的。\"",
      "en": "Now, obviously drugs of abuse would not be a good idea in this context, even though they increase dopamine, they lead to big crashes, they have addictive properties, et cetera.",
      "speaker": 1
    },
    {
      "start": 4080.94,
      "end": 4095.42,
      "zh": "我之前在这个播客里提到过L-酪氨酸，吃500到750毫克可以增加多巴胺，因为酪氨酸是多巴胺的前体。当然，还有像天门冬豆这种含有L-DOPA的东西，它是多巴胺的直接前体。",
      "en": "I've talked before on this podcast about things like L-tyrosine, take it anywhere from 500 to 750 milligrams can increase dopamine because tyrosine is a dopamine precursor, of course, things like mucunipurines, which are L-DOPA, the immediate precursor to dopamine.",
      "speaker": 1
    },
    {
      "start": 4095.42,
      "end": 4099.22,
      "zh": "\"有些人吃了会有点崩溃，但有些人能适应得好一点。\"",
      "en": "Some of these will lead to somewhat of a crash in certain individuals, other people tolerate them a little bit better.",
      "speaker": 1
    },
    {
      "start": 4099.22,
      "end": 4102.7,
      "zh": "\"所以一定要跟医生聊聊，看看什么适合你。\"",
      "en": "Again, you have to talk to your doctor, you have to figure out what's right for you.",
      "speaker": 1
    },
    {
      "start": 4102.7,
      "end": 4108.18,
      "zh": "如果你有双相情感障碍、躁狂或精神分裂，这些东西我完全不推荐。",
      "en": "If you have bipolar or mania or schizophrenia, these things are, I would not recommend them at all.",
      "speaker": 1
    },
    {
      "start": 4108.18,
      "end": 4113.18,
      "zh": "我不是推荐这些，只是说如果对你安全合适，可以考虑一下。",
      "en": "I'm not recommending them all, I'm just mentioning them for potential exploration if it's safe and right for you.",
      "speaker": 1
    },
    {
      "start": 4113.18,
      "end": 4118.26,
      "zh": "关键是，多巴胺系统激活后能加速愈合，能加快各种伤病的恢复。",
      "en": "But the point is this, the dopamine system when activated can accelerate healing, it can accelerate the recovery from injury of all kinds.",
      "speaker": 1
    },
    {
      "start": 4118.38,
      "end": 4137.78,
      "zh": "这不应该让我们觉得神秘或惊讶，因为这个奖励通路跟未来感有关，它能激活身体系统，让炎症因子下降，抗炎因子上升。就像PNAS那篇研究展示的，通过循环过度换气提高肾上腺素和去甲肾上腺素，从而增强儿茶酚胺系统。",
      "en": "And that shouldn't come as a mystery or a surprise result to us, it's because this reward pathway and the fact that it's related to a sense of the future seems to liberate entire systems within the body that make inflammatory cytokines go down and anti-inflammatory cytokines go up, exactly as was demonstrated in the beautiful PNAS study where breathing, cyclic hyperventilation was used to increase epinephrine, increase norepinephrine and to augment the catecholamine system.",
      "speaker": 1
    },
    {
      "start": 4137.78,
      "end": 4140.9800000000005,
      "zh": "\"所以我觉得这些研究之间的联系真的很重要。\"",
      "en": "So I think that the bridges between these studies are really relevant.",
      "speaker": 1
    },
    {
      "start": 4139.66,
      "end": 4145.9,
      "zh": "\"有一种情况，我是在说可能通过非处方药增加多巴胺来加速愈合。\"",
      "en": "In one case, I'm talking about potentially taking an over-the-counter compound to increase dopamine to accelerate healing.",
      "speaker": 1
    },
    {
      "start": 4145.9,
      "end": 4149.38,
      "zh": "\"还有一种情况，我们说的是通过呼吸来加速愈合。\"",
      "en": "In another case, we're talking about using breathing.",
      "speaker": 1
    },
    {
      "start": 4149.74,
      "end": 4152.38,
      "zh": "\"还有用冷水浴来增加多巴胺。\"",
      "en": "There's also the use of cold water exposure to increase dopamine.",
      "speaker": 1
    },
    {
      "start": 4152.38,
      "end": 4157.26,
      "zh": "\"我之前几期节目提过，浸泡到脖子左右的冷水，水温多低呢？\"",
      "en": "I talked about this several episodes ago, but it's been shown that immersing oneself in cold water up to the neck or so, how cold?",
      "speaker": 1
    },
    {
      "start": 4154.26,
      "end": 4174.02,
      "zh": "\"嗯，这要看你能承受的温度，得是让你觉得冷得不舒服，但又不能冷到低体温。虽然进去有点难受，但如果你能待三到十分钟，研究表明多巴胺和肾上腺素水平能翻倍，效果能持续好几个小时呢。\"",
      "en": "Well, it depends on what you can tolerate, but uncomfortably cold, but not so cold that you become hypothermic, but it's challenging to get in, but you can stay there for three to 10 minutes or so has been shown to lead to very significant doubling or more of baseline dopamine levels and epinephrine levels that go on for several hours.",
      "speaker": 1
    },
    {
      "start": 4174.02,
      "end": 4178.06,
      "zh": "\"这可能就是为什么有人先洗冷水澡或冰浴，然后再进桑拿。\"",
      "en": "This may be the basis for why people will do cold showers or ice baths and then get into a sauna.",
      "speaker": 1
    },
    {
      "start": 4178.06,
      "end": 4182.7,
      "zh": "\"这就是所谓的冷热对比疗法，用来增强这些神经递质。\"",
      "en": "So what's called cold heat contrast therapy as a way to augment these neurotransmitters.",
      "speaker": 1
    },
    {
      "start": 4182.7,
      "end": 4187.28,
      "zh": "今天我们聊的是这些神经递质怎么能增强免疫系统功能。",
      "en": "Today, we've been talking about how these neurotransmitters can be used to enhance the function of the immune system.",
      "speaker": 1
    },
    {
      "start": 4187.28,
      "end": 4200.88,
      "zh": "所以记住，想提高神经递质水平，可以通过补充剂，也可以通过行为，比如冷水刺激，或者简单地通过特定的呼吸方式，比如循环过度换气后屏气。",
      "en": "And so just keep in mind that anytime you're talking about increasing neurotransmitter levels, that can be done pharmacologically through supplementation or it can be done behaviorally through exposure to cold water, for instance, or it can be done even just simply by breathing in a particular way, cyclic hyperventilation followed by retention.",
      "speaker": 1
    },
    {
      "start": 4200.88,
      "end": 4209.16,
      "zh": "\"儿茶酚胺、去甲肾上腺素、多巴胺和去甲肾上腺素是激活免疫系统和神经系统的桥梁。\"",
      "en": "The catecholamines, noradrenaline, dopamine, and norepinephrine are the bridge of activation for the immune system and the nervous system.",
      "speaker": 1
    },
    {
      "start": 4209.26,
      "end": 4213.74,
      "zh": "\"它们就是神经系统在告诉免疫系统，嘿，我们有问题，需要解决。\"",
      "en": "They are the way that the nervous system calls out to the immune system, aha, we have a problem, we need to counter this.",
      "speaker": 1
    },
    {
      "start": 4212.06,
      "end": 4223.26,
      "zh": "所以你可以把多巴胺、肾上腺素和去甲肾上腺素想象成能调动更多免疫细胞的东西，就是我们开头提到的那些免疫细胞。",
      "en": "So you can think of them, them meaning dopamine, epinephrine, and norepinephrine as being able to deploy larger amounts of immune cells, all the types of immune cells that we talked about at the beginning of the episode.",
      "speaker": 1
    },
    {
      "start": 4223.26,
      "end": 4229.74,
      "zh": "好，我们刚才聊的是怎么预防生病，或者一旦感觉不舒服，怎么通过增强免疫系统来缩短感染时间。",
      "en": "Okay, so thus far, we've been discussing how one can prevent getting sick or when one starts to feel ill, how one might be able to shorten the course of that infection by ramping up the activity of the immune system.",
      "speaker": 1
    },
    {
      "start": 4230.900000000001,
      "end": 4236.1,
      "zh": "\"那如果你已经有症状了，比如流鼻涕、鼻子堵、头疼这些，怎么办呢？\"",
      "en": "But what about when you're already experiencing symptoms, the runny nose, stuffed up nose, congestion, headache, et cetera?",
      "speaker": 1
    },
    {
      "start": 4238.26,
      "end": 4241.0199999999995,
      "zh": "\"嗯，有很多方法可以缓解这些症状。\"",
      "en": "Well, there are many ways to address that at the symptom level.",
      "speaker": 1
    },
    {
      "start": 4241.0199999999995,
      "end": 4245.68,
      "zh": "你可能知道很多非处方药，它们主要针对肾上腺素系统。",
      "en": "You're probably aware of all the over-the-counter medications many of which focus on the epinephrine system.",
      "speaker": 1
    },
    {
      "start": 4245.68,
      "end": 4252.5599999999995,
      "zh": "\"你知道，像伪麻黄碱这类的东西能缓解鼻塞，因为它们会促使肾上腺素释放。\"",
      "en": "You know, things that are of the pseudofed variety prevent or reduce congestion because of the way that they cause release of epinephrine.",
      "speaker": 1
    },
    {
      "start": 4252.5599999999995,
      "end": 4255.4,
      "zh": "\"这些东西还能扩张支气管和鼻腔。\"",
      "en": "And some of the effects on dilating the bronchioles and dilating the nasal passages and so forth.",
      "speaker": 1
    },
    {
      "start": 4255.4,
      "end": 4257.76,
      "zh": "\"我就不评价这些药好不好了。\"",
      "en": "I'm not going to speak to whether or not those are good or bad choices.",
      "speaker": 1
    },
    {
      "start": 4257.76,
      "end": 4262.14,
      "zh": "\"不过它们有些副作用，比如可能导致脱水，这对治本没啥好处。\"",
      "en": "They do have a couple of effects that are not so great for the course of treating the underlying cause, which are, first of all, they can cause dehydration.",
      "speaker": 1
    },
    {
      "start": 4262.14,
      "end": 4265.94,
      "zh": "\"所以你得保证补充足够的水分和电解质。\"",
      "en": "So you have to make sure that you're hydrating well, both fluids and electrolytes.",
      "speaker": 1
    },
    {
      "start": 4265.94,
      "end": 4277.08,
      "zh": "\"而且这些药也会影响睡眠，因为我之前在讲睡眠的节目里提到，深度睡眠，尤其是REM睡眠时，肾上腺素水平是低的。\"",
      "en": "And they also can interfere with sleep because as I've talked about in the episodes on sleep, one of the hallmarks of deep sleep and in particular REM sleep is that epinephrine adrenaline levels are low.",
      "speaker": 1
    },
    {
      "start": 4277.08,
      "end": 4283.54,
      "zh": "\"这就是为什么你在REM睡眠时能做很激烈、情感丰富的梦，但不会真的去行动。\"",
      "en": "This is what allows you to have intense, often very emotionally laden dreams during REM sleep and not act those out.",
      "speaker": 1
    },
    {
      "start": 4282.0599999999995,
      "end": 4292.5599999999995,
      "zh": "\"而REM睡眠时肾上腺素低，其实就是REM睡眠的一个神经化学标志，对情绪和身体恢复很重要。\"",
      "en": "And low adrenaline epinephrine during REM sleep is basically a signature, a neurochemical signature of the REM sleep state, which is so vital for emotional and physical repair and so forth.",
      "speaker": 1
    },
    {
      "start": 4292.5599999999995,
      "end": 4299.0599999999995,
      "zh": "\"所以这些药会影响睡眠、导致脱水，还可能让人头晕心慌，这对很多人来说不是个好选择。\"",
      "en": "So the fact that they can inhibit sleep, the fact that they can cause dehydration, the fact that they can make people feel kind of lightheaded and jittery makes them not terrific choices for a number of people.",
      "speaker": 1
    },
    {
      "start": 4300.68,
      "end": 4302.8,
      "zh": "\"还有个挺有意思的替代选择。\"",
      "en": "There is an interesting alternative choice.",
      "speaker": 1
    },
    {
      "start": 4302.8,
      "end": 4305.08,
      "zh": "\"我说的替代方案，真的是个替代。\"",
      "en": "And when I say alternative, I do mean alternative.",
      "speaker": 1
    },
    {
      "start": 4305.08,
      "end": 4309.2,
      "zh": "\"我说的替代方案是螺旋藻，其实就是一种藻类。\"",
      "en": "The choice that I'm referring to is spirulina, which is actually a form of algae.",
      "speaker": 1
    },
    {
      "start": 4309.2,
      "end": 4317.24,
      "zh": "\"好多年前，我第一次听说螺旋藻的时候，感觉像是七八十年代那种健康食品店里的东西，挺神秘也挺怪的。\"",
      "en": "Years ago, I think when I first heard about spirulina, it sounded very much of the kind of 1970s, 80s health food store variety, seemed really kind of mystical and wacky.",
      "speaker": 1
    },
    {
      "start": 4317.24,
      "end": 4325.5599999999995,
      "zh": "\"但其实现在有些不错的研究和数据，说明螺旋藻能有效缓解鼻炎，就是鼻子堵和发炎。\"",
      "en": "But actually now there are some really nice studies and some data and also an understanding of the mechanism by which spirulina can have potent effects in reducing what's called rhinitis, which is a fancy word for congestion of the nose and inflammation of the nose.",
      "speaker": 1
    },
    {
      "start": 4325.5599999999995,
      "end": 4334.38,
      "zh": "\"基本上，只要你听到带有itis的词，至少在医学或健康方面，通常就是指某种组织发炎。\"",
      "en": "Basically, anytime you hear a word that includes itis, at least if it's in the medical or health context, it generally means inflammation of some tissue.",
      "speaker": 1
    },
    {
      "start": 4334.38,
      "end": 4340.08,
      "zh": "\"所以鼻炎就是鼻腔发炎，但这是各种感染里最难受的症状之一。\"",
      "en": "So rhinitis just being inflammation of the nasal passages, but that's one of the most uncomfortable symptoms of any kind of infection.",
      "speaker": 1
    },
    {
      "start": 4340.08,
      "end": 4342.16,
      "zh": "\"我想快速说说两个研究。\"",
      "en": "So there are two studies I'd like to highlight just very quickly.",
      "speaker": 1
    },
    {
      "start": 4342.16,
      "end": 4345.96,
      "zh": "\"一个是关于螺旋藻对过敏性鼻炎的影响。\"",
      "en": "One is the effects of spirulina on allergic rhinitis.",
      "speaker": 1
    },
    {
      "start": 4345.96,
      "end": 4349.76,
      "zh": "\"另一个是关于螺旋藻效果的临床对比研究。\"",
      "en": "And the other is a clinical comparison of the efficacy of spirulina.",
      "speaker": 1
    },
    {
      "start": 4349.76,
      "end": 4353.72,
      "zh": "螺旋藻Platensis和西替利嗪治疗过敏性鼻炎的研究。",
      "en": "Platensis, that's a technical name, and cetirizine for the treatment of allergic rhinitis.",
      "speaker": 1
    },
    {
      "start": 4353.72,
      "end": 4355.9400000000005,
      "zh": "\"这些研究是针对人的。\"",
      "en": "These looked at humans.",
      "speaker": 1
    },
    {
      "start": 4355.9400000000005,
      "end": 4358.86,
      "zh": "所以这不是小鼠实验，这是在人身上的研究。",
      "en": "So this is not a mouse study, this is a study on humans.",
      "speaker": 1
    },
    {
      "start": 4359.78,
      "end": 4361.28,
      "zh": "\"男女都有参与。\"",
      "en": "Both sexes, so males and females.",
      "speaker": 1
    },
    {
      "start": 4361.28,
      "end": 4364.24,
      "zh": "有个案例里。",
      "en": "In one case.",
      "speaker": 1
    },
    {
      "start": 4361.28,
      "end": 4367.9400000000005,
      "zh": "看了100多个主题，129个，还有另外65个。",
      "en": "looking at 100 plus subjects, 129 subjects, the other 65 subjects.",
      "speaker": 1
    },
    {
      "start": 4364.24,
      "end": 4389.54,
      "zh": "主题还挺多的，随机试验，双盲测试，结果都看到鼻塞明显减轻，嗅觉改善，睡眠质量提高，每天工作的细胞因子和炎症因子也减少了，鼻子痒的症状也减轻了。可以想象，吃两克螺旋藻后会有这些效果，有时候需要吃一阵子才能见效。",
      "en": "So decent number of subjects, randomized trial, double-blind, both cases saw significant decreases in nasal obstruction, improved ability to smell, improved sleep, daily working cytokine, inflammatory cytokines were reduced as well, reduction nasal itching, all the stuff that you'd like to experience, I can imagine, after taking two grams, two grams, not milligrams, but two grams of Spirulina, sometimes had to be taken for a short while before the effect kicked in.",
      "speaker": 1
    },
    {
      "start": 4389.54,
      "end": 4402.9400000000005,
      "zh": "所以说，这效果挺不错的，不过这还没解释原理。不过在研究螺旋藻对减轻鼻炎的作用机制时，发现螺旋藻能抑制所谓组胺肥大细胞的形成或活性，这点挺有意思的。",
      "en": "So that's pretty impressive, I would say, but it doesn't really speak to mechanism, but in exploring the underlying mechanisms for Spirulina's effects on reducing rhinitis, it's interesting to find that Spirulina actually can inhibit the formation and or activity of so-called histaminergic mast cells, M-A-S-T, mast cells.",
      "speaker": 1
    },
    {
      "start": 4402.9400000000005,
      "end": 4407.38,
      "zh": "\"我们还没怎么聊过肥大细胞，但它们在免疫反应中挺有意思的。\"",
      "en": "We haven't talked a lot about mast cells, but they are a very interesting cell type in the immune response.",
      "speaker": 1
    },
    {
      "start": 4407.38,
      "end": 4422.88,
      "zh": "\"基本上，它们就是一些组胺的小包。当我们皮肤受伤或者受到刺激，比如被蚊子咬了，或者碰到毒橡树、毒常春藤之类的东西，导致皮肤痒或者体内炎症，不一定只是皮肤上的反应。\"",
      "en": "Essentially what they are, little packets of histamine, and when we have some sort of injury or irritant, rather, to the skin, so a mosquito bite, for instance, or poison oak or poison ivy, something that causes an itch or something that causes inflammation internally, it doesn't just have to be on the skin.",
      "speaker": 1
    },
    {
      "start": 4422.88,
      "end": 4431.84,
      "zh": "这些肥大细胞就像小气泡，里面有组胺，会跑到刺激部位释放组胺，导致局部细胞肿胀和发炎。",
      "en": "These mast cells are these little bubbles that contain histamine that go to that site and release their histaminergic contents and cause swelling and inflammation of whatever cells are affected locally.",
      "speaker": 1
    },
    {
      "start": 4431.84,
      "end": 4436.5,
      "zh": "\"你可能会想，为什么身体里会有导致肿胀和发炎的机制呢？\"",
      "en": "That's cause, you might think, well, why would I want to have a mechanism in my body that would cause swelling and inflammation?",
      "speaker": 1
    },
    {
      "start": 4436.5,
      "end": 4449.6,
      "zh": "\"哦，然后这些细胞会释放细胞因子信号，招募我们之前提到的那些先天免疫系统的细胞，比如巨噬细胞，还有其他会吞噬外来入侵者或者帮助隔离和清除毒素的细胞。\"",
      "en": "Ah, well, then those cells, in turn, send out cytokine signals that recruit the very cell types that we were talking about way back at the beginning of the episode, the cells that are characteristic of the innate immune system that come in, the macrophages and the other types of cells that will come in and gobble up the foreign invaders or will help sequester and move away, say, the poison from a bite or from whatever irritant.",
      "speaker": 1
    },
    {
      "start": 4449.6,
      "end": 4451.96,
      "zh": "\"而且不只是皮肤表面才会这样。\"",
      "en": "Again, it doesn't just have to be at the skin surface.",
      "speaker": 1
    },
    {
      "start": 4451.96,
      "end": 4454.54,
      "zh": "我这是在举个皮肤上的例子。",
      "en": "I'm describing an example at the skin.",
      "speaker": 1
    },
    {
      "start": 4454.54,
      "end": 4458.56,
      "zh": "比如说，你要是起过荨麻疹，那肯定和肥大细胞有关。",
      "en": "For instance, if you've ever had hives of any kind, that almost certainly involved mast cells.",
      "speaker": 1
    },
    {
      "start": 4458.56,
      "end": 4474.0,
      "zh": "所以，当你吃抗组胺药来对付季节性过敏时，其实就是在减少肥大细胞里的组胺。而螺旋藻也被证明在治疗季节性过敏方面很有效，效果跟一些主要的处方药和非处方药差不多。",
      "en": "So, and when you take an antihistamine, antihistamine, in order to deal with seasonal allergies, for instance, you're dealing, you're, excuse me, you're taking a compound that's reducing histamines in mast cells, and spirulina has also been used quite effectively as a way to treat seasonal allergies and some of the symptomology equally on par with some of the major prescription and over-the-counter drugs for that.",
      "speaker": 1
    },
    {
      "start": 4474.0,
      "end": 4480.139999999999,
      "zh": "不过要提醒一下，螺旋藻对有遗传突变导致苯丙酮尿症的人可能有副作用。",
      "en": "One cautionary note, spirulina does, can carry some side effects for people that are, have a genetic mutation leading to something called PKU.",
      "speaker": 1
    },
    {
      "start": 4480.139999999999,
      "end": 4481.8,
      "zh": "这些人自己知道的。",
      "en": "These people know who they are.",
      "speaker": 1
    },
    {
      "start": 4481.8,
      "end": 4484.0199999999995,
      "zh": "他们对苯丙氨酸特别敏感。",
      "en": "They're very sensitive to phenylalanine.",
      "speaker": 1
    },
    {
      "start": 4484.0199999999995,
      "end": 4488.72,
      "zh": "这些人也不能喝任何营养饮料或健怡汽水，他们自己明白原因。",
      "en": "These same people cannot drink any sort of nutritious or diet soda for reasons that they understand.",
      "speaker": 1
    },
    {
      "start": 4488.72,
      "end": 4490.679999999999,
      "zh": "\"可能会挺危险的。\"",
      "en": "It could be quite dangerous.",
      "speaker": 1
    },
    {
      "start": 4490.679999999999,
      "end": 4495.42,
      "zh": "虽然是个罕见的遗传病，但螺旋藻对这些人还是有问题。",
      "en": "It's a rare genetic disorder, but nonetheless, spirulina can be an issue for those people.",
      "speaker": 1
    },
    {
      "start": 4495.42,
      "end": 4497.9,
      "zh": "大多数人基本没什么副作用。",
      "en": "For most people, the side effect profile is pretty minimal.",
      "speaker": 1
    },
    {
      "start": 4497.9,
      "end": 4501.24,
      "zh": "\"说清楚，我跟螺旋藻公司没任何关系。\"",
      "en": "And just to be clear, I don't have any relationship to a spirulina company or anything.",
      "speaker": 1
    },
    {
      "start": 4501.24,
      "end": 4511.54,
      "zh": "\"我就觉得有意思，这些东西听起来有点新潮，因为它们来自藻类、植物，但看它们的作用机制，其实挺合理的。\"",
      "en": "I just find it interesting that there are these compounds that sound rather, forgive the phrase, but rather new agey because they come from a algae, from a plant, but when you look at the underlying mechanism, it makes perfect sense.",
      "speaker": 1
    },
    {
      "start": 4508.08,
      "end": 4531.92,
      "zh": "所以，我们常常想指出的是，如果有这种所谓的替代疗法，之所以叫替代疗法是因为大多数人没听说过，最好是能有个明确的原理和框架来解释它们的作用，而不是只听说\"哦，我听说螺旋藻对过敏很好\"这种说法。",
      "en": "So that's often what we like to point out here is that if there are these so-called alternative therapies, alternative because most people haven't heard of them, it's always nice if they map to a specific logical mechanism and framework by which that compound would work as opposed to just some anecdote of, oh, I hear spirulina is great for allergies.",
      "speaker": 1
    },
    {
      "start": 4531.92,
      "end": 4537.36,
      "zh": "\"哦，现在我们知道原因了，它抑制肥大细胞，特别是组胺肥大细胞。\"",
      "en": "Well, now we know why, it inhibits mast cells and histaminergic mast cells in particular.",
      "speaker": 1
    },
    {
      "start": 4537.38,
      "end": 4544.54,
      "zh": "\"之前我提到过一项很新鲜、很激动人心的研究，已经在《自然》上发表了完整文章。\"",
      "en": "Earlier, I mentioned a new and very exciting study published as a full article in Nature.",
      "speaker": 1
    },
    {
      "start": 4544.54,
      "end": 4547.62,
      "zh": "\"完整文章就是说明这是个重大发现。\"",
      "en": "Full article means that it is a major finding.",
      "speaker": 1
    },
    {
      "start": 4547.62,
      "end": 4551.9800000000005,
      "zh": "\"在《自然》杂志上，他们有些信件，都是重要的发现。\"",
      "en": "At the journal Nature, they have letters, which are important findings.",
      "speaker": 1
    },
    {
      "start": 4551.9800000000005,
      "end": 4558.12,
      "zh": "\"要在《自然》上发表信件也挺严格的，但完整文章通常每周刊里就一两篇。\"",
      "en": "They're still very high stringency for getting a letter in Nature published, but the full articles, generally, there's only one or two per issue in the weekly edition of Nature.",
      "speaker": 1
    },
    {
      "start": 4558.12,
      "end": 4564.0,
      "zh": "上周，哈佛医学院Chufu Ma的实验室发表了一篇很有意思的文章。",
      "en": "And just last week, there was a very exciting article published from Chufu Ma's lab at Harvard Medical School.",
      "speaker": 1
    },
    {
      "start": 4564.0,
      "end": 4566.56,
      "zh": "\"Chufu，我认识他好多年了。\"",
      "en": "Chufu, I've known for a number of years.",
      "speaker": 1
    },
    {
      "start": 4566.56,
      "end": 4575.32,
      "zh": "\"他的团队在研究瘙痒和疼痛机制方面做得非常出色，发现了一些相关的受体和通路。\"",
      "en": "His group has done phenomenal work on the mechanisms of itch and pain and discovering some of the receptors and pathways for itch and pain.",
      "speaker": 1
    },
    {
      "start": 4575.32,
      "end": 4578.900000000001,
      "zh": "最近，他们还在研究针灸的机制基础。",
      "en": "And more recently, they've been exploring the mechanistic basis of acupuncture.",
      "speaker": 1
    },
    {
      "start": 4578.900000000001,
      "end": 4583.76,
      "zh": "文章标题是“电针刺激迷走肾上腺轴的神经解剖基础”。",
      "en": "And the title of the article is a neuroanatomical basis for electroacupuncture to drive the vagal adrenal axis.",
      "speaker": 1
    },
    {
      "start": 4583.76,
      "end": 4589.900000000001,
      "zh": "\"虽然这名字有点拗口，但大多数人应该都懂我说的迷走肾上腺轴是什么。\"",
      "en": "And while that's a mouthful, now, most all of you are probably familiar with what I mean when I say vagal adrenal axis.",
      "speaker": 1
    },
    {
      "start": 4589.900000000001,
      "end": 4594.52,
      "zh": "\"迷走是指迷走神经，肾上腺是指肾上腺。\"",
      "en": "Vagal, meaning of the vagus and adrenal of the adrenal glands.",
      "speaker": 1
    },
    {
      "start": 4594.52,
      "end": 4601.4800000000005,
      "zh": "所以，当楚夫的实验室研究所谓电针刺激身体时，我们可能不意外，但还是很兴奋。",
      "en": "And so perhaps we should not be surprised, although excited nonetheless, that when Chufu's lab looked at stimulation of the body with so-called electroacupuncture.",
      "speaker": 1
    },
    {
      "start": 4601.4800000000005,
      "end": 4606.08,
      "zh": "“所以这些针就是通过针头传递微弱电流进到身体里。”",
      "en": "So these are needles where it's a small bit of electrical current, low level of electrical current is passed into the needle and therefore into the body.",
      "speaker": 1
    },
    {
      "start": 4606.08,
      "end": 4611.2,
      "zh": "\"他们找到了身体上可以通过释放炎症因子来增加炎症的部位。\"",
      "en": "They located sites on the body that can increase inflammation by way of releasing inflammatory cytokines.",
      "speaker": 1
    },
    {
      "start": 4611.2,
      "end": 4619.400000000001,
      "zh": "\"这些部位包括腹部，他们还发现像下肢这样的地方可以刺激迷走肾上腺反射，从而减少炎症。\"",
      "en": "These areas included the abdomen and they found areas on the body such as the lower limbs or the hind limbs in this case that can stimulate the vagal adrenal reflex and can lead to reduced inflammation.",
      "speaker": 1
    },
    {
      "start": 4619.400000000001,
      "end": 4624.26,
      "zh": "\"有意思的是，他们发现是筋膜里的神经末梢被激活了。\"",
      "en": "And what was really interesting is that they figured out that it was activation of nerve endings that resided in the fascia.",
      "speaker": 1
    },
    {
      "start": 4624.26,
      "end": 4628.54,
      "zh": "我之前提到过筋膜是什么，简单说就是包裹肌肉的一层厚组织。",
      "en": "I mentioned earlier what fascia is, but just to remind you, the fascia is a really thick sheath of tissue that surrounds muscle.",
      "speaker": 1
    },
    {
      "start": 4628.54,
      "end": 4633.18,
      "zh": "如果你听说过罗尔夫按摩，这是一种很强烈的按摩方式。",
      "en": "If ever you've heard of rolfing, rolfing is a form of very intense massage.",
      "speaker": 1
    },
    {
      "start": 4633.18,
      "end": 4636.12,
      "zh": "我没试过，但听说过。",
      "en": "I've never had this done, but I've heard about this.",
      "speaker": 1
    },
    {
      "start": 4636.12,
      "end": 4639.4400000000005,
      "zh": "\"它其实包括把肌肉和筋膜稍微分开。\"",
      "en": "It involves among other things, actually separating the muscle away from the fascia somewhat.",
      "speaker": 1
    },
    {
      "start": 4639.4400000000005,
      "end": 4642.38,
      "zh": "所以这就是一种很深层的按摩。",
      "en": "So it's a very, very deep tissue massage.",
      "speaker": 1
    },
    {
      "start": 4642.38,
      "end": 4647.82,
      "zh": "\"我有个朋友做过，他说这可能是他经历过最难受的身体体验之一。\"",
      "en": "Actually a good friend of mine who had this done told me that it was probably the most challenging experience that physical experience that he'd ever been through going through this rolfing procedure.",
      "speaker": 1
    },
    {
      "start": 4647.82,
      "end": 4653.46,
      "zh": "\"可能有些人试过罗尔夫按摩，可以分享一下感受，到底是舒服还是不舒服，有没有效果。\"",
      "en": "Maybe some of you have been rolfed as they say and can report to the experience whether or not it was pleasant or unpleasant or you felt benefits or not.",
      "speaker": 1
    },
    {
      "start": 4654.62,
      "end": 4659.46,
      "zh": "反正，这研究不是专门讲罗尔夫按摩，而是关于筋膜的。",
      "en": "In any case, this study isn't about rolfing per se, but it is about the fascia.",
      "speaker": 1
    },
    {
      "start": 4659.46,
      "end": 4662.26,
      "zh": "所以他们发现有一类特定的神经元。",
      "en": "And so what they discovered is there's a specific population of neurons.",
      "speaker": 1
    },
    {
      "start": 4662.26,
      "end": 4665.820000000001,
      "zh": "那些神经元有个名字，科学上经常这样。",
      "en": "Those neurons have a name as they often do in science.",
      "speaker": 1
    },
    {
      "start": 4665.820000000001,
      "end": 4670.660000000001,
      "zh": "名字不重要，不过你要查的话，是PROC-R2神经元。",
      "en": "Name isn't important, but if you want to look it up, it's the PROC-R2 neurons, P-R-O-K-R2 neurons.",
      "speaker": 1
    },
    {
      "start": 4670.660000000001,
      "end": 4674.02,
      "zh": "\"它们深入连接到四肢的筋膜组织。\"",
      "en": "And they send a connection deep into the limb fascial tissue.",
      "speaker": 1
    },
    {
      "start": 4674.02,
      "end": 4676.740000000001,
      "zh": "\"然后，它们再发出另一个连接。\"",
      "en": "Okay, and then they send another connection.",
      "speaker": 1
    },
    {
      "start": 4676.740000000001,
      "end": 4679.5,
      "zh": "我们说的连接其实就是轴突。",
      "en": "The connections we're referring to are axons.",
      "speaker": 1
    },
    {
      "start": 4679.5,
      "end": 4681.38,
      "zh": "神经元有轴突。",
      "en": "Neurons have axons.",
      "speaker": 1
    },
    {
      "start": 4679.5,
      "end": 4686.9400000000005,
      "zh": "\"所以有一根线往一个方向深入到腿部的筋膜组织，靠近小腿和大腿。\"",
      "en": "So a wire in one direction that goes into the deep fascial tissue of the lower limb and near the calf and thigh.",
      "speaker": 1
    },
    {
      "start": 4687.06,
      "end": 4694.42,
      "zh": "然后它们再发出一根线，往上连接到脊髓，进入靠近颈部的大脑后面的延髓区域。",
      "en": "And then they send another wire up into the spinal cord and to a region of the hind brain in the back of your brain kind of near your neck called the medulla in the medulla oblongata.",
      "speaker": 1
    },
    {
      "start": 4694.42,
      "end": 4698.26,
      "zh": "那个神经元也有个名字叫DMZ，不过这不重要。",
      "en": "That neuron also has a name called the DMZ, doesn't matter.",
      "speaker": 1
    },
    {
      "start": 4698.26,
      "end": 4706.5,
      "zh": "\"然后那个神经元连接到肾上腺，释放我们熟悉的儿茶酚胺，像去甲肾上腺素、肾上腺素和多巴胺。\"",
      "en": "And that neuron connects to the adrenal gland to release our good old friends, the catecholamines, noradrenaline, adrenaline, and dopamine, or norepinephrine, epinephrine, and dopamine.",
      "speaker": 1
    },
    {
      "start": 4706.5,
      "end": 4713.820000000001,
      "zh": "\"这些物质一释放，就能减轻炎症，即使是面对能引发发烧的脂多糖注射也有效。\"",
      "en": "And their release causes a reduction in inflammation, even in response to an injection of something called lipopolysaccharide, which can actually induce fever.",
      "speaker": 1
    },
    {
      "start": 4713.820000000001,
      "end": 4715.740000000001,
      "zh": "\"那这说明了什么呢？\"",
      "en": "So what is all this saying?",
      "speaker": 1
    },
    {
      "start": 4715.740000000001,
      "end": 4725.26,
      "zh": "\"这就是说，深筋膜组织的激活会引发一连串神经反应，最终释放去甲肾上腺素、肾上腺素和多巴胺。\"",
      "en": "This is saying that activation of the deep fascial tissue causes a chain of neural reactions that leads eventually to the release of norepinephrine, noradrenaline, adrenaline, and dopamine.",
      "speaker": 1
    },
    {
      "start": 4723.06,
      "end": 4734.22,
      "zh": "\"这又能降低炎症，很像我们之前提到的呼吸研究，还有那种循环换气和屏息的方式，也能减少炎症。\"",
      "en": "And once again, lowers inflammation, very much like the breathing study that we talked about earlier and the pattern of cyclic hyperventilation with retention leading to reductions in inflammation.",
      "speaker": 1
    },
    {
      "start": 4734.22,
      "end": 4736.22,
      "zh": "\"这真让我太高兴了。\"",
      "en": "I can't tell you how happy this makes me.",
      "speaker": 1
    },
    {
      "start": 4734.22,
      "end": 4747.42,
      "zh": "\"我跟这个研究没关系，但让我高兴的是，那些存在了几百年甚至几千年的方法，比如针灸和呼吸法，开始和一些硬核的机械科学结合起来了。\"",
      "en": "I had nothing to do with this work, but the reason it makes me happy is because I have a particular fondness for when practices that have existed for many centuries or even thousands of years, such as acupuncture, such as respiration work, start to converge with some of the hardcore mechanistic science.",
      "speaker": 1
    },
    {
      "start": 4746.62,
      "end": 4752.58,
      "zh": "\"让我兴奋的原因不是因为我们想用科学取代这些古老方法，完全不是这样。\"",
      "en": "And the reason this excites me is not because we want to take science and erase the previous tools and methods of these ancient practices, not at all.",
      "speaker": 1
    },
    {
      "start": 4752.58,
      "end": 4757.22,
      "zh": "\"我们也不是想用现代科学给这些东西起新名字。\"",
      "en": "And it certainly isn't the case that we just want to name things or rename things with modern science.",
      "speaker": 1
    }
  ],
  "guest": {
    "name": "Andrew Huberman 博士",
    "title": "斯坦福大学医学院神经生物学与眼科学教授",
    "bio": "Huberman 博士的研究专注于大脑发育、神经可塑性以及神经再生。作为科学传播者，他致力于将前沿神经科学研究转化为可实践的健康工具。"
  },
  "summary": {
    "zh": "你的大脑能控制免疫系统吗？在本期节目中，Andrew Huberman 博士带你深入探索神经系统与免疫系统之间令人惊叹的双向连接。从哈佛医学院最新发表在《自然》杂志上的针灸研究，到脑淋巴系统如何在睡眠中清理大脑废物，再到呼吸练习如何激活抗炎反应——这不是玄学，而是有充分科学证据支持的生理机制。Huberman 博士将解析免疫系统的三层防御体系，揭示发烧、炎症等看似令人不适的症状背后的生存智慧，并分享多种经过验证的方法来增强免疫功能。",
    "en": "Can your brain control your immune system? In this episode, Dr. Andrew Huberman explores the fascinating bidirectional connections between your nervous system and immune system, from Harvard's latest Nature publication on acupuncture to how the glymphatic system clears brain waste during sleep."
  },
  "keyPoints": [
    {
      "title": "针灸的科学机制",
      "highlights": [
        "哈佛医学院研究发现，刺激特定筋膜组织可以通过神经通路触发肾上腺释放抗炎分子",
        "针灸通过激活副交感神经系统，能够快速降低全身炎症水平",
        "这项研究为传统中医疗法提供了现代神经科学的解释"
      ],
      "startAt": 98
    },
    {
      "title": "睡眠与免疫清洁",
      "highlights": [
        "脑淋巴系统（glymphatic system）在深度睡眠时活跃度提升10-60倍",
        "睡眠期间大脑会清除代谢废物和免疫系统产生的炎症因子",
        "抬高双脚睡觉可能通过改善淋巴回流来增强这一清洁过程"
      ],
      "startAt": 2542
    },
    {
      "title": "呼吸调节炎症",
      "highlights": [
        "特定的呼吸模式（如生理性叹息）能够实时激活副交感神经系统",
        "通过控制呼吸节奏，可以在几分钟内降低体内炎症水平",
        "这种方法完全免费且随时可用，是增强免疫的实用工具"
      ],
      "startAt": 3402
    },
    {
      "title": "心态即药物",
      "highlights": [
        "心理状态和动机水平能直接影响免疫细胞的迁移速度",
        "积极的心态可以加快伤口愈合效率高达25%",
        "心理-神经-免疫连接比我们想象的更加直接和强大"
      ],
      "startAt": 3865
    }
  ],
  "highlights": [
    {
      "title": "针灸激活抗炎通路",
      "time": "01:38",
      "startAt": 98,
      "zh": "哈佛医学院Chufu Ma的实验室在《Nature》上发表了一篇论文，研究针灸如何减少身体的炎症。",
      "en": "Harvard Medical School's Chufu Ma lab published a Nature paper on how acupuncture reduces inflammation."
    },
    {
      "title": "发烧的智慧",
      "time": "32:38",
      "startAt": 1958,
      "zh": "前视区的神经元会让体温升高，引发发烧，这是身体对抗感染的重要机制。",
      "en": "Neurons in the preoptic area raise body temperature to induce fever, a crucial defense mechanism."
    },
    {
      "title": "脑部清洁系统",
      "time": "42:22",
      "startAt": 2542,
      "zh": "脑淋巴系统是大脑里的一个系统，可以清除白天积累的垃圾，尤其是神经炎症和身体炎症时产生的垃圾。",
      "en": "The glymphatic system clears accumulated waste from the brain, especially during inflammation."
    }
  ],
  "resources": [
    {
      "title": "Neuroanatomical Basis for Facilitation of Hypothalamic-Pituitary-Adrenal Responses to a Specific Psychological Stressor",
      "url": "https://www.nature.com/articles/s41586-021-04330-4",
      "source": "Nature",
      "kind": "paper"
    },
    {
      "title": "Huberman Lab Official Website",
      "url": "https://hubermanlab.com",
      "source": "Stanford University",
      "kind": "site"
    }
  ],
  "coverImage": "/images/huberman-immune-system.jpg"
}